<abi-corpus path='libpython3.8.so' soname='libpython3.8.so.1.0'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_mod2obj' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_obj2mod' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_abstract_hack' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_capitalize__doc__' size='124' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_count__doc__' size='199' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_endswith__doc__' size='264' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_find__doc__' size='239' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_index__doc__' size='270' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalnum__doc__' size='132' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalpha__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isascii__doc__' size='98' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isdigit__doc__' size='126' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_islower__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isspace__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_istitle__doc__' size='230' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isupper__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_lower__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_maketrans__doc__' size='291' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_open_cloexec_works' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rfind__doc__' size='241' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rindex__doc__' size='271' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_startswith__doc__' size='268' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_swapcase__doc__' size='123' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_title__doc__' size='155' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_upper__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_Py_gitversion' mangled-name='_Py_gitversion' filepath='./Modules/getbuildinfo.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitversion'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/acceler.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='void' id='type-id-4'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-5' visibility='default' filepath='./Include/grammar.h' line='60' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_ndfas' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dfa' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_ll' type-id='type-id-9' visibility='default' filepath='./Include/grammar.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='g_start' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='g_accel' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-7'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-10' visibility='default' filepath='./Include/grammar.h' line='50' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_type' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_name' type-id='type-id-12' visibility='default' filepath='./Include/grammar.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_nstates' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_state' type-id='type-id-13' visibility='default' filepath='./Include/grammar.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_first' type-id='type-id-14' visibility='default' filepath='./Include/grammar.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-12'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-15' visibility='default' filepath='./Include/grammar.h' line='37' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_narcs' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_arc' type-id='type-id-17' visibility='default' filepath='./Include/grammar.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_lower' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='s_upper' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_accel' type-id='type-id-18' visibility='default' filepath='./Include/grammar.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='s_accept' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-19' visibility='default' filepath='./Include/grammar.h' line='30' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a_lbl' type-id='type-id-21' visibility='default' filepath='./Include/grammar.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='a_arrow' type-id='type-id-21' visibility='default' filepath='./Include/grammar.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-21'/>
    <typedef-decl name='arc' type-id='type-id-20' filepath='./Include/grammar.h' line='33' column='1' id='type-id-19'/>
    <qualified-type-def type-id='type-id-19' const='yes' id='type-id-22'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <typedef-decl name='state' type-id='type-id-16' filepath='./Include/grammar.h' line='46' column='1' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-13'/>
    <typedef-decl name='bitset' type-id='type-id-12' filepath='./Include/bitset.h' line='11' column='1' id='type-id-14'/>
    <typedef-decl name='dfa' type-id='type-id-11' filepath='./Include/grammar.h' line='56' column='1' id='type-id-10'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-8'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-24' visibility='default' filepath='./Include/grammar.h' line='23' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ll_nlabels' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ll_label' type-id='type-id-26' visibility='default' filepath='./Include/grammar.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-27' visibility='default' filepath='./Include/grammar.h' line='14' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lb_type' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lb_str' type-id='type-id-3' visibility='default' filepath='./Include/grammar.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='label' type-id='type-id-28' filepath='./Include/grammar.h' line='17' column='1' id='type-id-27'/>
    <qualified-type-def type-id='type-id-27' const='yes' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-26'/>
    <typedef-decl name='labellist' type-id='type-id-25' filepath='./Include/grammar.h' line='26' column='1' id='type-id-24'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-9'/>
    <typedef-decl name='grammar' type-id='type-id-6' filepath='./Include/grammar.h' line='66' column='1' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-30'/>
    <function-decl name='PyGrammar_RemoveAccelerators' mangled-name='PyGrammar_RemoveAccelerators' filepath='Parser/acceler.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_RemoveAccelerators'>
      <parameter type-id='type-id-30' name='g' filepath='Parser/acceler.c' line='34' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyGrammar_AddAccelerators' mangled-name='PyGrammar_AddAccelerators' filepath='Parser/acceler.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_AddAccelerators'>
      <parameter type-id='type-id-30' name='g' filepath='Parser/acceler.c' line='24' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/grammar1.c' comp-dir-path='/src' language='LANG_C99'>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-31'/>
    <function-decl name='PyGrammar_LabelRepr' mangled-name='PyGrammar_LabelRepr' filepath='Parser/grammar1.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_LabelRepr'>
      <parameter type-id='type-id-31' name='lb' filepath='Parser/grammar1.c' line='20' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyGrammar_FindDFA' mangled-name='PyGrammar_FindDFA' filepath='Parser/grammar1.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_FindDFA'>
      <parameter type-id='type-id-30' name='g' filepath='Parser/grammar1.c' line='11' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='Parser/grammar1.c' line='11' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/listnode.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_node' size-in-bits='384' is-struct='yes' visibility='default' filepath='./Include/node.h' line='10' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_type' type-id='type-id-21' visibility='default' filepath='./Include/node.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_str' type-id='type-id-12' visibility='default' filepath='./Include/node.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='n_lineno' type-id='type-id-7' visibility='default' filepath='./Include/node.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='n_col_offset' type-id='type-id-7' visibility='default' filepath='./Include/node.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n_nchildren' type-id='type-id-7' visibility='default' filepath='./Include/node.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_child' type-id='type-id-33' visibility='default' filepath='./Include/node.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_end_lineno' type-id='type-id-7' visibility='default' filepath='./Include/node.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='n_end_col_offset' type-id='type-id-7' visibility='default' filepath='./Include/node.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-33'/>
    <typedef-decl name='node' type-id='type-id-32' filepath='./Include/node.h' line='19' column='1' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <function-decl name='PyNode_ListTree' mangled-name='PyNode_ListTree' filepath='Parser/listnode.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_ListTree'>
      <parameter type-id='type-id-35' name='n' filepath='Parser/listnode.c' line='13' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/node.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='type-id-36'/>
    <typedef-decl name='__ssize_t' type-id='type-id-36' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-37'/>
    <typedef-decl name='ssize_t' type-id='type-id-37' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-38'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-38' filepath='./Include/pyport.h' line='105' column='1' id='type-id-39'/>
    <function-decl name='_PyNode_SizeOf' mangled-name='_PyNode_SizeOf' filepath='Parser/node.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNode_SizeOf'>
      <parameter type-id='type-id-35' name='n' filepath='Parser/node.c' line='154' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyNode_Free' mangled-name='PyNode_Free' filepath='Parser/node.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_Free'>
      <parameter type-id='type-id-35' name='n' filepath='Parser/listnode.c' line='13' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNode_AddChild' mangled-name='PyNode_AddChild' filepath='Parser/node.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_AddChild'>
      <parameter type-id='type-id-35' name='n1' filepath='Parser/node.c' line='95' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='Parser/node.c' line='95' column='1'/>
      <parameter type-id='type-id-12' name='str' filepath='Parser/node.c' line='95' column='1'/>
      <parameter type-id='type-id-7' name='lineno' filepath='Parser/node.c' line='95' column='1'/>
      <parameter type-id='type-id-7' name='col_offset' filepath='Parser/node.c' line='95' column='1'/>
      <parameter type-id='type-id-7' name='end_lineno' filepath='Parser/node.c' line='96' column='1'/>
      <parameter type-id='type-id-7' name='end_col_offset' filepath='Parser/node.c' line='96' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyNode_FinalizeEndPos' mangled-name='_PyNode_FinalizeEndPos' filepath='Parser/node.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNode_FinalizeEndPos'>
      <parameter type-id='type-id-35' name='n' filepath='Parser/node.c' line='81' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNode_New' mangled-name='PyNode_New' filepath='Parser/node.c' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_New'>
      <parameter type-id='type-id-7' name='type' filepath='Parser/node.c' line='8' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/parser.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='326656' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-40' visibility='default' filepath='Parser/parser.h' line='24' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_stack' type-id='type-id-42' visibility='default' filepath='Parser/parser.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='326464'>
        <var-decl name='p_grammar' type-id='type-id-30' visibility='default' filepath='Parser/parser.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='326528'>
        <var-decl name='p_tree' type-id='type-id-35' visibility='default' filepath='Parser/parser.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='326592'>
        <var-decl name='p_flags' type-id='type-id-43' visibility='default' filepath='Parser/parser.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='326464' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='Parser/parser.h' line='18' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_top' type-id='type-id-45' visibility='default' filepath='Parser/parser.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_base' type-id='type-id-46' visibility='default' filepath='Parser/parser.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-47' visibility='default' filepath='Parser/parser.h' line='12' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_state' type-id='type-id-7' visibility='default' filepath='Parser/parser.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_dfa' type-id='type-id-8' visibility='default' filepath='Parser/parser.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_parent' type-id='type-id-33' visibility='default' filepath='Parser/parser.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='stackentry' type-id='type-id-48' filepath='Parser/parser.h' line='16' column='1' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-45'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-43'/>

    <array-type-def dimensions='1' type-id='type-id-47' size-in-bits='326400' id='type-id-46'>
      <subrange length='1700' type-id='type-id-43' id='type-id-49'/>

    </array-type-def>
    <typedef-decl name='stack' type-id='type-id-44' filepath='Parser/parser.h' line='22' column='1' id='type-id-42'/>
    <typedef-decl name='parser_state' type-id='type-id-41' filepath='Parser/parser.h' line='31' column='1' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-50'/>
    <function-decl name='PyParser_AddToken' mangled-name='PyParser_AddToken' filepath='Parser/parser.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_AddToken'>
      <parameter type-id='type-id-50' name='ps' filepath='Parser/parser.c' line='231' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='Parser/parser.c' line='231' column='1'/>
      <parameter type-id='type-id-12' name='str' filepath='Parser/parser.c' line='231' column='1'/>
      <parameter type-id='type-id-7' name='lineno' filepath='Parser/parser.c' line='232' column='1'/>
      <parameter type-id='type-id-7' name='col_offset' filepath='Parser/parser.c' line='232' column='1'/>
      <parameter type-id='type-id-7' name='end_lineno' filepath='Parser/parser.c' line='233' column='1'/>
      <parameter type-id='type-id-7' name='end_col_offset' filepath='Parser/parser.c' line='233' column='1'/>
      <parameter type-id='type-id-18' name='expected_ret' filepath='Parser/parser.c' line='234' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyParser_Delete' mangled-name='PyParser_Delete' filepath='Parser/parser.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_Delete'>
      <parameter type-id='type-id-50' name='ps' filepath='Parser/parser.c' line='96' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyParser_New' mangled-name='PyParser_New' filepath='Parser/parser.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_New'>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parser.c' line='72' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parser.c' line='72' column='1'/>
      <return type-id='type-id-50'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/token.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-51'/>

    <array-type-def dimensions='1' type-id='type-id-51' size-in-bits='infinite' id='type-id-52'>
      <subrange length='infinite' id='type-id-53'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-54'/>
    <var-decl name='_PyParser_TokenNames' type-id='type-id-54' mangled-name='_PyParser_TokenNames' visibility='default' filepath='./Include/token.h' line='83' column='1' elf-symbol-id='_PyParser_TokenNames'/>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='Parser/token.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_ThreeChars'>
      <parameter type-id='type-id-7' name='c1' filepath='Parser/token.c' line='193' column='1'/>
      <parameter type-id='type-id-7' name='c2' filepath='Parser/token.c' line='193' column='1'/>
      <parameter type-id='type-id-7' name='c3' filepath='Parser/token.c' line='193' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='Parser/token.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_TwoChars'>
      <parameter type-id='type-id-7' name='c1' filepath='Parser/token.c' line='109' column='1'/>
      <parameter type-id='type-id-7' name='c2' filepath='Parser/token.c' line='109' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='Parser/token.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_OneChar'>
      <parameter type-id='type-id-7' name='c1' filepath='Parser/token.c' line='78' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/myreadline.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_ts' size-in-bits='2112' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='51' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-56' visibility='default' filepath='./Include/cpython/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-56' visibility='default' filepath='./Include/cpython/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-57' visibility='default' filepath='./Include/cpython/pystate.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-58' visibility='default' filepath='./Include/cpython/pystate.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='overflowed' type-id='type-id-1' visibility='default' filepath='./Include/cpython/pystate.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='recursion_critical' type-id='type-id-1' visibility='default' filepath='./Include/cpython/pystate.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_tracing' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-59' visibility='default' filepath='./Include/cpython/pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-59' visibility='default' filepath='./Include/cpython/pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-61' visibility='default' filepath='./Include/cpython/pystate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-62' visibility='default' filepath='./Include/cpython/pystate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-43' visibility='default' filepath='./Include/cpython/pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-63' visibility='default' filepath='./Include/cpython/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-64' visibility='default' filepath='./Include/cpython/pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-7' visibility='default' filepath='./Include/cpython/pystate.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='async_gen_firstiter' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='async_gen_finalizer' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='context' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='context_ver' type-id='type-id-65' visibility='default' filepath='./Include/cpython/pystate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='id' type-id='type-id-65' visibility='default' filepath='./Include/cpython/pystate.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
    <class-decl name='_is' size-in-bits='21760' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='67' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-67' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_head' type-id='type-id-56' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-68' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id_refcount' type-id='type-id-68' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='requires_idref' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='id_mutex' type-id='type-id-69' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='finalizing' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='modules' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='modules_by_index' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sysdict' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='builtins' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='importlib' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='check_interval' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='num_threads' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='pythread_stacksize' type-id='type-id-70' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='codec_search_path' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='codec_search_cache' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='codec_error_registry' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='codecs_initialized' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='fs_codec' type-id='type-id-71' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='config' type-id='type-id-72' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='dlopenflags' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='dict' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='builtins_copy' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='import_func' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='eval_frame' type-id='type-id-73' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='co_extra_user_count' type-id='type-id-39' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-74' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20992'>
        <var-decl name='before_forkers' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21056'>
        <var-decl name='after_forkers_parent' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21120'>
        <var-decl name='after_forkers_child' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21184'>
        <var-decl name='pyexitfunc' type-id='type-id-75' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21248'>
        <var-decl name='pyexitmodule' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21312'>
        <var-decl name='tstate_next_unique_id' type-id='type-id-65' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21376'>
        <var-decl name='warnings' type-id='type-id-76' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21632'>
        <var-decl name='audit_hooks' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21696'>
        <var-decl name='int_max_str_digits' type-id='type-id-7' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-67'/>
    <typedef-decl name='__int64_t' type-id='type-id-36' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-77'/>
    <typedef-decl name='int64_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-68'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-64'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-64' filepath='./Include/pythread.h' line='5' column='1' id='type-id-69'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/object.h' line='104' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-39' visibility='default' filepath='./Include/object.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-79' visibility='default' filepath='./Include/object.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' size-in-bits='3328' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='177' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-81' visibility='default' filepath='./Include/cpython/object.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-83' visibility='default' filepath='./Include/cpython/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-84' visibility='default' filepath='./Include/cpython/object.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-85' visibility='default' filepath='./Include/cpython/object.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-86' visibility='default' filepath='./Include/cpython/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-88' visibility='default' filepath='./Include/cpython/object.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-90' visibility='default' filepath='./Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-86' visibility='default' filepath='./Include/cpython/object.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-93' visibility='default' filepath='./Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-94' visibility='default' filepath='./Include/cpython/object.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-43' visibility='default' filepath='./Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-95' visibility='default' filepath='./Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-96' visibility='default' filepath='./Include/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-97' visibility='default' filepath='./Include/cpython/object.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-98' visibility='default' filepath='./Include/cpython/object.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-99' visibility='default' filepath='./Include/cpython/object.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-102' visibility='default' filepath='./Include/cpython/object.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-103' visibility='default' filepath='./Include/cpython/object.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-104' visibility='default' filepath='./Include/cpython/object.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-105' visibility='default' filepath='./Include/cpython/object.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-106' visibility='default' filepath='./Include/cpython/object.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-107' visibility='default' filepath='./Include/cpython/object.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-108' visibility='default' filepath='./Include/cpython/object.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-96' visibility='default' filepath='./Include/cpython/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-109' visibility='default' filepath='./Include/cpython/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-110' visibility='default' filepath='./Include/cpython/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tp_print' type-id='type-id-111' visibility='default' filepath='./Include/cpython/object.h' line='260' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-81' visibility='default' filepath='./Include/object.h' line='113' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-113' visibility='default' filepath='./Include/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-39' visibility='default' filepath='./Include/object.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyObject' type-id='type-id-78' filepath='./Include/object.h' line='108' column='1' id='type-id-113'/>
    <typedef-decl name='PyVarObject' type-id='type-id-112' filepath='./Include/object.h' line='116' column='1' id='type-id-81'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-75'/>
    <typedef-decl name='destructor' type-id='type-id-75' filepath='./Include/object.h' line='157' column='1' id='type-id-82'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='getattrfunc' type-id='type-id-116' filepath='./Include/object.h' line='158' column='1' id='type-id-83'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <typedef-decl name='setattrfunc' type-id='type-id-118' filepath='./Include/object.h' line='160' column='1' id='type-id-84'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='162' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <typedef-decl name='unaryfunc' type-id='type-id-123' filepath='./Include/object.h' line='140' column='1' id='type-id-121'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-120' filepath='./Include/cpython/object.h' line='166' column='1' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-85'/>
    <typedef-decl name='reprfunc' type-id='type-id-123' filepath='./Include/object.h' line='162' column='1' id='type-id-86'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='95' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-96' visibility='default' filepath='./Include/cpython/object.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-64' visibility='default' filepath='./Include/cpython/object.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-121' visibility='default' filepath='./Include/cpython/object.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='binaryfunc' type-id='type-id-128' filepath='./Include/object.h' line='141' column='1' id='type-id-126'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-130' filepath='./Include/object.h' line='142' column='1' id='type-id-91'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <typedef-decl name='inquiry' type-id='type-id-132' filepath='./Include/object.h' line='143' column='1' id='type-id-96'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-125' filepath='./Include/cpython/object.h' line='140' column='1' id='type-id-124'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-87'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='142' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-135' visibility='default' filepath='./Include/cpython/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-136' visibility='default' filepath='./Include/cpython/object.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-136' visibility='default' filepath='./Include/cpython/object.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-64' visibility='default' filepath='./Include/cpython/object.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-137' visibility='default' filepath='./Include/cpython/object.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-64' visibility='default' filepath='./Include/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-138' visibility='default' filepath='./Include/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-136' visibility='default' filepath='./Include/cpython/object.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <typedef-decl name='lenfunc' type-id='type-id-140' filepath='./Include/object.h' line='144' column='1' id='type-id-135'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-142' filepath='./Include/object.h' line='145' column='1' id='type-id-136'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-144' filepath='./Include/object.h' line='147' column='1' id='type-id-137'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <typedef-decl name='objobjproc' type-id='type-id-146' filepath='./Include/object.h' line='151' column='1' id='type-id-138'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-134' filepath='./Include/cpython/object.h' line='154' column='1' id='type-id-133'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-88'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-147' visibility='default' filepath='./Include/cpython/object.h' line='156' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-135' visibility='default' filepath='./Include/cpython/object.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-126' visibility='default' filepath='./Include/cpython/object.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-149' visibility='default' filepath='./Include/cpython/object.h' line='159' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <typedef-decl name='objobjargproc' type-id='type-id-151' filepath='./Include/object.h' line='149' column='1' id='type-id-149'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-148' filepath='./Include/cpython/object.h' line='160' column='1' id='type-id-147'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-89'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-39' filepath='./Include/pyport.h' line='114' column='1' id='type-id-152'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <typedef-decl name='hashfunc' type-id='type-id-154' filepath='./Include/object.h' line='163' column='1' id='type-id-90'/>
    <typedef-decl name='getattrofunc' type-id='type-id-128' filepath='./Include/object.h' line='159' column='1' id='type-id-92'/>
    <typedef-decl name='setattrofunc' type-id='type-id-151' filepath='./Include/object.h' line='161' column='1' id='type-id-93'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-155' visibility='default' filepath='./Include/cpython/object.h' line='168' column='1' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-157' visibility='default' filepath='./Include/cpython/object.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-158' visibility='default' filepath='./Include/cpython/object.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bufferinfo' size-in-bits='640' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='40' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-64' visibility='default' filepath='./Include/cpython/object.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-7' visibility='default' filepath='./Include/cpython/object.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-7' visibility='default' filepath='./Include/cpython/object.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-12' visibility='default' filepath='./Include/cpython/object.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-160' visibility='default' filepath='./Include/cpython/object.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-160' visibility='default' filepath='./Include/cpython/object.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-160' visibility='default' filepath='./Include/cpython/object.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-64' visibility='default' filepath='./Include/cpython/object.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-160'/>
    <typedef-decl name='Py_buffer' type-id='type-id-159' filepath='./Include/cpython/object.h' line='53' column='1' id='type-id-161'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-164'/>
    <typedef-decl name='getbufferproc' type-id='type-id-164' filepath='./Include/cpython/object.h' line='55' column='1' id='type-id-157'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-166' filepath='./Include/cpython/object.h' line='56' column='1' id='type-id-158'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-156' filepath='./Include/cpython/object.h' line='171' column='1' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <typedef-decl name='visitproc' type-id='type-id-168' filepath='./Include/object.h' line='152' column='1' id='type-id-169'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='traverseproc' type-id='type-id-171' filepath='./Include/object.h' line='153' column='1' id='type-id-95'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-173' filepath='./Include/object.h' line='164' column='1' id='type-id-97'/>
    <typedef-decl name='getiterfunc' type-id='type-id-123' filepath='./Include/object.h' line='165' column='1' id='type-id-98'/>
    <typedef-decl name='iternextfunc' type-id='type-id-123' filepath='./Include/object.h' line='166' column='1' id='type-id-99'/>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/methodobject.h' line='51' column='1' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-175' visibility='default' filepath='./Include/methodobject.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-7' visibility='default' filepath='./Include/methodobject.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCFunction' type-id='type-id-128' filepath='./Include/methodobject.h' line='18' column='1' id='type-id-175'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-100'/>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-101'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/descrobject.h' line='11' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-178' visibility='default' filepath='./Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-179' visibility='default' filepath='./Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-64' visibility='default' filepath='./Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <typedef-decl name='getter' type-id='type-id-181' filepath='./Include/descrobject.h' line='8' column='1' id='type-id-178'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <typedef-decl name='setter' type-id='type-id-183' filepath='./Include/descrobject.h' line='9' column='1' id='type-id-179'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-79'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-130' filepath='./Include/object.h' line='167' column='1' id='type-id-103'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-151' filepath='./Include/object.h' line='168' column='1' id='type-id-104'/>
    <typedef-decl name='initproc' type-id='type-id-151' filepath='./Include/object.h' line='169' column='1' id='type-id-105'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <typedef-decl name='allocfunc' type-id='type-id-185' filepath='./Include/object.h' line='171' column='1' id='type-id-106'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-187'/>
    <typedef-decl name='newfunc' type-id='type-id-187' filepath='./Include/object.h' line='170' column='1' id='type-id-107'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-63'/>
    <typedef-decl name='freefunc' type-id='type-id-63' filepath='./Include/object.h' line='156' column='1' id='type-id-108'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-109'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-189'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <typedef-decl name='size_t' type-id='type-id-43' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-70'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-192' filepath='./Include/cpython/object.h' line='58' column='1' id='type-id-110'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-194' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-195' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-196' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-197' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-198' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-199' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-200' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-201' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-202' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-203' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-195' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-70' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-204' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-194'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-195'/>
    <typedef-decl name='__off_t' type-id='type-id-36' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-196'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-197'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-198'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-199'>
      <subrange length='1' type-id='type-id-43' id='type-id-206'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-207'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-200'/>
    <typedef-decl name='__off64_t' type-id='type-id-36' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-201'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-208'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-202'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-209'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-203'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-204'>
      <subrange length='20' type-id='type-id-43' id='type-id-210'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-193' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-211'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-111'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='103' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='errors' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='error_handler' type-id='type-id-214' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-215'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='./Include/fileutils.h' line='23' column='1' id='type-id-216'>
      <underlying-type type-id='type-id-215'/>
      <enumerator name='_Py_ERROR_UNKNOWN' value='0'/>
      <enumerator name='_Py_ERROR_STRICT' value='1'/>
      <enumerator name='_Py_ERROR_SURROGATEESCAPE' value='2'/>
      <enumerator name='_Py_ERROR_REPLACE' value='3'/>
      <enumerator name='_Py_ERROR_IGNORE' value='4'/>
      <enumerator name='_Py_ERROR_BACKSLASHREPLACE' value='5'/>
      <enumerator name='_Py_ERROR_SURROGATEPASS' value='6'/>
      <enumerator name='_Py_ERROR_XMLCHARREFREPLACE' value='7'/>
      <enumerator name='_Py_ERROR_OTHER' value='8'/>
    </enum-decl>
    <typedef-decl name='_Py_error_handler' type-id='type-id-216' filepath='./Include/fileutils.h' line='33' column='1' id='type-id-214'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2880' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='./Include/cpython/initconfig.h' line='129' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isolated' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_environment' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dev_mode' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='install_signal_handlers' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_hash_seed' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_seed' type-id='type-id-43' visibility='default' filepath='./Include/cpython/initconfig.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='faulthandler' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tracemalloc' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='import_time' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='show_ref_count' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_alloc_count' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='dump_refs' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='malloc_stats' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='filesystem_encoding' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='filesystem_errors' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pycache_prefix' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='parse_argv' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='argv' type-id='type-id-219' visibility='default' filepath='./Include/cpython/initconfig.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='program_name' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xoptions' type-id='type-id-219' visibility='default' filepath='./Include/cpython/initconfig.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='warnoptions' type-id='type-id-219' visibility='default' filepath='./Include/cpython/initconfig.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='site_import' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='bytes_warning' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='inspect' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='interactive' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='optimization_level' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='parser_debug' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='write_bytecode' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='verbose' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='quiet' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='user_site_directory' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='configure_c_stdio' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='buffered_stdio' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='stdio_encoding' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='stdio_errors' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='check_hash_pycs_mode' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='pathconfig_warnings' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='pythonpath_env' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='home' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='module_search_paths_set' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='module_search_paths' type-id='type-id-219' visibility='default' filepath='./Include/cpython/initconfig.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='executable' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='base_executable' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='prefix' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='base_prefix' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='exec_prefix' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='base_exec_prefix' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='skip_source_first_line' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='run_command' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='run_module' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='run_filename' type-id='type-id-218' visibility='default' filepath='./Include/cpython/initconfig.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='_install_importlib' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='_init_main' type-id='type-id-7' visibility='default' filepath='./Include/cpython/initconfig.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wchar_t' type-id='type-id-7' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='321' column='1' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-218'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-219' visibility='default' filepath='./Include/cpython/initconfig.h' line='31' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-39' visibility='default' filepath='./Include/cpython/initconfig.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='items' type-id='type-id-222' visibility='default' filepath='./Include/cpython/initconfig.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-222'/>
    <typedef-decl name='PyWideStringList' type-id='type-id-221' filepath='./Include/cpython/initconfig.h' line='36' column='1' id='type-id-219'/>
    <typedef-decl name='PyConfig' type-id='type-id-217' filepath='./Include/cpython/initconfig.h' line='405' column='1' id='type-id-72'/>
    <class-decl name='_frame' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-225' filepath='./Include/internal/pycore_pystate.h' line='64' column='1' id='type-id-73'/>

    <array-type-def dimensions='1' type-id='type-id-108' size-in-bits='16320' id='type-id-74'>
      <subrange length='255' type-id='type-id-43' id='type-id-226'/>

    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-227'/>
    <typedef-decl name='uint64_t' type-id='type-id-227' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-65'/>
    <class-decl name='_warnings_runtime_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='13' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filters' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='once_registry' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_action' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='filters_version' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyInterpreterState' type-id='type-id-66' filepath='./Include/pystate.h' line='25' column='1' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-230'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-230' filepath='./Include/cpython/pystate.h' line='19' column='1' id='type-id-59'/>
    <class-decl name='_err_stackitem' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='36' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_type' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exc_value' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exc_traceback' type-id='type-id-60' visibility='default' filepath='./Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='previous_item' type-id='type-id-232' visibility='default' filepath='./Include/cpython/pystate.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-232'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-231' filepath='./Include/cpython/pystate.h' line='47' column='1' id='type-id-61'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-62'/>
    <typedef-decl name='PyThreadState' type-id='type-id-55' filepath='./Include/pystate.h' line='23' column='1' id='type-id-233'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <var-decl name='_PyOS_ReadlineTState' type-id='type-id-234' mangled-name='_PyOS_ReadlineTState' visibility='default' filepath='./Include/pythonrun.h' line='189' column='1' elf-symbol-id='_PyOS_ReadlineTState'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <var-decl name='PyOS_InputHook' type-id='type-id-236' mangled-name='PyOS_InputHook' visibility='default' filepath='./Include/pythonrun.h' line='186' column='1' elf-symbol-id='PyOS_InputHook'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <var-decl name='PyOS_ReadlineFunctionPointer' type-id='type-id-238' mangled-name='PyOS_ReadlineFunctionPointer' visibility='default' filepath='./Include/pythonrun.h' line='187' column='1' elf-symbol-id='PyOS_ReadlineFunctionPointer'/>
    <function-decl name='PyOS_Readline' mangled-name='PyOS_Readline' filepath='Parser/myreadline.c' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_Readline'>
      <parameter type-id='type-id-212' name='sys_stdin' filepath='Parser/myreadline.c' line='357' column='1'/>
      <parameter type-id='type-id-212' name='sys_stdout' filepath='Parser/myreadline.c' line='357' column='1'/>
      <parameter type-id='type-id-3' name='prompt' filepath='Parser/myreadline.c' line='357' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyOS_StdioReadline' mangled-name='PyOS_StdioReadline' filepath='Parser/myreadline.c' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_StdioReadline'>
      <parameter type-id='type-id-212' name='sys_stdin' filepath='Parser/myreadline.c' line='242' column='1'/>
      <parameter type-id='type-id-212' name='sys_stdout' filepath='Parser/myreadline.c' line='242' column='1'/>
      <parameter type-id='type-id-3' name='prompt' filepath='Parser/myreadline.c' line='242' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-122'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-191'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-141'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-224'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-60'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-12'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-131'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-213'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-145'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-150'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-162'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-117'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-153'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-152'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-114'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-162'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/parsetok.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-239' visibility='default' filepath='./Include/parsetok.h' line='13' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-7' visibility='default' filepath='./Include/parsetok.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='filename' type-id='type-id-60' visibility='default' filepath='./Include/parsetok.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lineno' type-id='type-id-7' visibility='default' filepath='./Include/parsetok.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offset' type-id='type-id-7' visibility='default' filepath='./Include/parsetok.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='text' type-id='type-id-12' visibility='default' filepath='./Include/parsetok.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='token' type-id='type-id-7' visibility='default' filepath='./Include/parsetok.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='expected' type-id='type-id-7' visibility='default' filepath='./Include/parsetok.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='perrdetail' type-id='type-id-240' filepath='./Include/parsetok.h' line='21' column='1' id='type-id-239'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-241'/>
    <function-decl name='PyParser_ParseFileFlagsEx' mangled-name='PyParser_ParseFileFlagsEx' filepath='Parser/parsetok.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileFlagsEx'>
      <parameter type-id='type-id-212' name='fp' filepath='Parser/parsetok.c' line='190' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='190' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/parsetok.c' line='191' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='191' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='191' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='192' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='192' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='193' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='Parser/parsetok.c' line='193' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseFileObject' mangled-name='PyParser_ParseFileObject' filepath='Parser/parsetok.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileObject'>
      <parameter type-id='type-id-212' name='fp' filepath='Parser/parsetok.c' line='163' column='1'/>
      <parameter type-id='type-id-60' name='filename' filepath='Parser/parsetok.c' line='163' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/parsetok.c' line='164' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='164' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='164' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='165' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='165' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='166' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='Parser/parsetok.c' line='166' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseFileFlags' mangled-name='PyParser_ParseFileFlags' filepath='Parser/parsetok.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileFlags'>
      <parameter type-id='type-id-212' name='fp' filepath='Parser/parsetok.c' line='152' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='152' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/parsetok.c' line='152' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='153' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='153' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='154' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='154' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='155' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Parser/parsetok.c' line='155' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseFile' mangled-name='PyParser_ParseFile' filepath='Parser/parsetok.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFile'>
      <parameter type-id='type-id-212' name='fp' filepath='Parser/parsetok.c' line='143' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='143' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='143' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='143' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='144' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='144' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='145' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlagsFilenameEx' mangled-name='PyParser_ParseStringFlagsFilenameEx' filepath='Parser/parsetok.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlagsFilenameEx'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='122' column='1'/>
      <parameter type-id='type-id-3' name='filename_str' filepath='Parser/parsetok.c' line='122' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='123' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='123' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='124' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='Parser/parsetok.c' line='124' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringObject' mangled-name='PyParser_ParseStringObject' filepath='Parser/parsetok.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringObject'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='87' column='1'/>
      <parameter type-id='type-id-60' name='filename' filepath='Parser/parsetok.c' line='87' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='88' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='88' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='89' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='Parser/parsetok.c' line='89' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlagsFilename' mangled-name='PyParser_ParseStringFlagsFilename' filepath='Parser/parsetok.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlagsFilename'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='77' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='77' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='78' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='78' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='79' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Parser/parsetok.c' line='79' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlags' mangled-name='PyParser_ParseStringFlags' filepath='Parser/parsetok.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlags'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='69' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='69' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='69' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='70' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Parser/parsetok.c' line='70' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='PyParser_ParseString' mangled-name='PyParser_ParseString' filepath='Parser/parsetok.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseString'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='63' column='1'/>
      <parameter type-id='type-id-30' name='g' filepath='Parser/parsetok.c' line='63' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='Parser/parsetok.c' line='63' column='1'/>
      <parameter type-id='type-id-241' name='err_ret' filepath='Parser/parsetok.c' line='63' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/tokenizer.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='PyTokenizer_FindEncoding' mangled-name='PyTokenizer_FindEncoding' filepath='Parser/tokenizer.c' line='1867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FindEncoding'>
      <parameter type-id='type-id-7' name='fd' filepath='Parser/tokenizer.c' line='1867' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyTokenizer_FindEncodingFilename' mangled-name='PyTokenizer_FindEncodingFilename' filepath='Parser/tokenizer.c' line='1821' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FindEncodingFilename'>
      <parameter type-id='type-id-7' name='fd' filepath='Parser/tokenizer.c' line='1821' column='1'/>
      <parameter type-id='type-id-60' name='filename' filepath='Parser/tokenizer.c' line='1821' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <class-decl name='tok_state' size-in-bits='16192' is-struct='yes' visibility='default' filepath='Parser/tokenizer.h' line='23' column='1' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-12' visibility='default' filepath='Parser/tokenizer.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cur' type-id='type-id-12' visibility='default' filepath='Parser/tokenizer.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='inp' type-id='type-id-12' visibility='default' filepath='Parser/tokenizer.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='end' type-id='type-id-12' visibility='default' filepath='Parser/tokenizer.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='start' type-id='type-id-12' visibility='default' filepath='Parser/tokenizer.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='done' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fp' type-id='type-id-212' visibility='default' filepath='Parser/tokenizer.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tabsize' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='indent' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='indstack' type-id='type-id-243' visibility='default' filepath='Parser/tokenizer.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='atbol' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='pendin' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='prompt' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='nextprompt' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='lineno' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='first_lineno' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='level' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4000'>
        <var-decl name='parenstack' type-id='type-id-244' visibility='default' filepath='Parser/tokenizer.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5600'>
        <var-decl name='parenlinenostack' type-id='type-id-245' visibility='default' filepath='Parser/tokenizer.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12032'>
        <var-decl name='filename' type-id='type-id-60' visibility='default' filepath='Parser/tokenizer.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12096'>
        <var-decl name='altindstack' type-id='type-id-243' visibility='default' filepath='Parser/tokenizer.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15296'>
        <var-decl name='decoding_state' type-id='type-id-246' visibility='default' filepath='Parser/tokenizer.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15328'>
        <var-decl name='decoding_erred' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15360'>
        <var-decl name='read_coding_spec' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15424'>
        <var-decl name='encoding' type-id='type-id-12' visibility='default' filepath='Parser/tokenizer.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15488'>
        <var-decl name='cont_line' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15552'>
        <var-decl name='line_start' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15616'>
        <var-decl name='multi_line_start' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15680'>
        <var-decl name='decoding_readline' type-id='type-id-60' visibility='default' filepath='Parser/tokenizer.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15744'>
        <var-decl name='decoding_buffer' type-id='type-id-60' visibility='default' filepath='Parser/tokenizer.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15808'>
        <var-decl name='enc' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15872'>
        <var-decl name='str' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15936'>
        <var-decl name='input' type-id='type-id-3' visibility='default' filepath='Parser/tokenizer.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16000'>
        <var-decl name='type_comments' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16032'>
        <var-decl name='async_hacks' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16064'>
        <var-decl name='async_def' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16096'>
        <var-decl name='async_def_indent' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16128'>
        <var-decl name='async_def_nl' type-id='type-id-7' visibility='default' filepath='Parser/tokenizer.h' line='72' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='3200' id='type-id-243'>
      <subrange length='100' type-id='type-id-43' id='type-id-247'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='1600' id='type-id-244'>
      <subrange length='200' type-id='type-id-43' id='type-id-248'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='6400' id='type-id-245'>
      <subrange length='200' type-id='type-id-43' id='type-id-248'/>

    </array-type-def>
    <enum-decl name='decoding_state' filepath='Parser/tokenizer.h' line='16' column='1' id='type-id-246'>
      <underlying-type type-id='type-id-215'/>
      <enumerator name='STATE_INIT' value='0'/>
      <enumerator name='STATE_RAW' value='1'/>
      <enumerator name='STATE_NORMAL' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-249'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-250'/>
    <function-decl name='PyTokenizer_Get' mangled-name='PyTokenizer_Get' filepath='Parser/tokenizer.c' line='1800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_Get'>
      <parameter type-id='type-id-249' name='tok' filepath='Parser/tokenizer.c' line='1800' column='1'/>
      <parameter type-id='type-id-250' name='p_start' filepath='Parser/tokenizer.c' line='1800' column='1'/>
      <parameter type-id='type-id-250' name='p_end' filepath='Parser/tokenizer.c' line='1800' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyTokenizer_Free' mangled-name='PyTokenizer_Free' filepath='Parser/tokenizer.c' line='805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_Free'>
      <parameter type-id='type-id-249' name='tok' filepath='Parser/tokenizer.c' line='805' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromFile' mangled-name='PyTokenizer_FromFile' filepath='Parser/tokenizer.c' line='772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FromFile'>
      <parameter type-id='type-id-212' name='fp' filepath='Parser/tokenizer.c' line='772' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/tokenizer.c' line='772' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/tokenizer.c' line='773' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/tokenizer.c' line='773' column='1'/>
      <return type-id='type-id-249'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromUTF8' mangled-name='PyTokenizer_FromUTF8' filepath='Parser/tokenizer.c' line='743' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FromUTF8'>
      <parameter type-id='type-id-3' name='str' filepath='Parser/tokenizer.c' line='743' column='1'/>
      <parameter type-id='type-id-7' name='exec_input' filepath='Parser/tokenizer.c' line='743' column='1'/>
      <return type-id='type-id-249'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromString' mangled-name='PyTokenizer_FromString' filepath='Parser/tokenizer.c' line='726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FromString'>
      <parameter type-id='type-id-3' name='str' filepath='Parser/tokenizer.c' line='743' column='1'/>
      <parameter type-id='type-id-7' name='exec_input' filepath='Parser/tokenizer.c' line='743' column='1'/>
      <return type-id='type-id-249'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/abstract.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-251'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='Objects/abstract.c' line='2689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-252' name='array' filepath='Objects/abstract.c' line='2689' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/structmember.h' line='18' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='./Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-7' visibility='default' filepath='./Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-39' visibility='default' filepath='./Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-7' visibility='default' filepath='./Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='./Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='Objects/abstract.c' line='2630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-60' name='self' filepath='Objects/abstract.c' line='2630' column='1'/>
      <return type-id='type-id-252'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='Objects/abstract.c' line='2609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='Objects/abstract.c' line='2595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='2595' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='Objects/abstract.c' line='2568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2568' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='Objects/abstract.c' line='2561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-60' name='derived' filepath='Objects/abstract.c' line='2561' column='1'/>
      <parameter type-id='type-id-60' name='cls' filepath='Objects/abstract.c' line='2561' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='Objects/abstract.c' line='2555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-60' name='derived' filepath='Objects/abstract.c' line='2561' column='1'/>
      <parameter type-id='type-id-60' name='cls' filepath='Objects/abstract.c' line='2561' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='Objects/abstract.c' line='2499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-60' name='derived' filepath='Objects/abstract.c' line='2499' column='1'/>
      <parameter type-id='type-id-60' name='cls' filepath='Objects/abstract.c' line='2499' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='Objects/abstract.c' line='2424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-60' name='derived' filepath='Objects/abstract.c' line='2499' column='1'/>
      <parameter type-id='type-id-60' name='cls' filepath='Objects/abstract.c' line='2499' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='Objects/abstract.c' line='2274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='Objects/abstract.c' line='2260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='Objects/abstract.c' line='2246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='Objects/abstract.c' line='2201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2201' column='1'/>
      <parameter type-id='type-id-60' name='key' filepath='Objects/abstract.c' line='2201' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='Objects/abstract.c' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2187' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2187' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='Objects/abstract.c' line='2168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2168' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2168' column='1'/>
      <parameter type-id='type-id-60' name='value' filepath='Objects/abstract.c' line='2168' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='Objects/abstract.c' line='2151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2151' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2151' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='Objects/abstract.c' line='2144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2144' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='Objects/abstract.c' line='2117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2117' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='Objects/abstract.c' line='2110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='2595' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='Objects/abstract.c' line='2102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='2102' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2102' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='Objects/abstract.c' line='2096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-60' name='derived' filepath='Objects/abstract.c' line='2561' column='1'/>
      <parameter type-id='type-id-60' name='cls' filepath='Objects/abstract.c' line='2561' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='Objects/abstract.c' line='2083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-60' name='seq' filepath='Objects/abstract.c' line='2083' column='1'/>
      <parameter type-id='type-id-60' name='ob' filepath='Objects/abstract.c' line='2083' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='Objects/abstract.c' line='2074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='2102' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2102' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='Objects/abstract.c' line='1989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-60' name='seq' filepath='Objects/abstract.c' line='1989' column='1'/>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='1989' column='1'/>
      <parameter type-id='type-id-7' name='operation' filepath='Objects/abstract.c' line='1989' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='Objects/abstract.c' line='1956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1956' column='1'/>
      <parameter type-id='type-id-3' name='m' filepath='Objects/abstract.c' line='1956' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='Objects/abstract.c' line='1933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1933' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='Objects/abstract.c' line='1849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1849' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='Objects/abstract.c' line='1825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1825' column='1'/>
      <parameter type-id='type-id-39' name='i1' filepath='Objects/abstract.c' line='1825' column='1'/>
      <parameter type-id='type-id-39' name='i2' filepath='Objects/abstract.c' line='1825' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='Objects/abstract.c' line='1800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1800' column='1'/>
      <parameter type-id='type-id-39' name='i1' filepath='Objects/abstract.c' line='1800' column='1'/>
      <parameter type-id='type-id-39' name='i2' filepath='Objects/abstract.c' line='1800' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1800' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='Objects/abstract.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1767' column='1'/>
      <parameter type-id='type-id-39' name='i' filepath='Objects/abstract.c' line='1767' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='Objects/abstract.c' line='1734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1734' column='1'/>
      <parameter type-id='type-id-39' name='i' filepath='Objects/abstract.c' line='1734' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1734' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='Objects/abstract.c' line='1711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1711' column='1'/>
      <parameter type-id='type-id-39' name='i1' filepath='Objects/abstract.c' line='1711' column='1'/>
      <parameter type-id='type-id-39' name='i2' filepath='Objects/abstract.c' line='1711' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='Objects/abstract.c' line='1681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1681' column='1'/>
      <parameter type-id='type-id-39' name='i' filepath='Objects/abstract.c' line='1681' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='Objects/abstract.c' line='1651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1681' column='1'/>
      <parameter type-id='type-id-39' name='i' filepath='Objects/abstract.c' line='1681' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='Objects/abstract.c' line='1626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1626' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1626' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='Objects/abstract.c' line='1596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1681' column='1'/>
      <parameter type-id='type-id-39' name='i' filepath='Objects/abstract.c' line='1681' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='Objects/abstract.c' line='1571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1626' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1626' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='Objects/abstract.c' line='1564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2144' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='Objects/abstract.c' line='1538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2117' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='Objects/abstract.c' line='1529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='2595' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='Objects/abstract.c' line='1510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-60' name='n' filepath='Objects/abstract.c' line='1510' column='1'/>
      <parameter type-id='type-id-7' name='base' filepath='Objects/abstract.c' line='1510' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='Objects/abstract.c' line='1451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1451' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='Objects/abstract.c' line='1352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1352' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='Objects/abstract.c' line='1307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-60' name='item' filepath='Objects/abstract.c' line='1307' column='1'/>
      <parameter type-id='type-id-60' name='err' filepath='Objects/abstract.c' line='1307' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='Objects/abstract.c' line='1265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='Objects/abstract.c' line='1254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='2595' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='Objects/abstract.c' line='1236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='Objects/abstract.c' line='1220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='Objects/abstract.c' line='1204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='Objects/abstract.c' line='1188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='Objects/abstract.c' line='1173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='z' filepath='Objects/abstract.c' line='1173' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='Objects/abstract.c' line='1166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='Objects/abstract.c' line='1159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='Objects/abstract.c' line='1130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1626' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1626' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='Objects/abstract.c' line='1109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1626' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1626' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='Objects/abstract.c' line='1102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='Objects/abstract.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InMatrixMultiply' mangled-name='PyNumber_InMatrixMultiply' filepath='Objects/abstract.c' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InMatrixMultiply'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='Objects/abstract.c' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='Objects/abstract.c' line='1090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='Objects/abstract.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='z' filepath='Objects/abstract.c' line='1173' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='1024' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='1018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='1006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='987' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1626' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1626' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-60' name='s' filepath='Objects/abstract.c' line='1626' column='1'/>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='1626' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='953' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='2595' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='698' column='1'/>
      <parameter type-id='type-id-60' name='format_spec' filepath='Objects/abstract.c' line='698' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-162' name='view' filepath='Objects/abstract.c' line='684' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-162' name='view' filepath='Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-64' name='buf' filepath='Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-7' name='readonly' filepath='Objects/abstract.c' line='646' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Objects/abstract.c' line='646' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-7' name='nd' filepath='Objects/abstract.c' line='621' column='1'/>
      <parameter type-id='type-id-160' name='shape' filepath='Objects/abstract.c' line='621' column='1'/>
      <parameter type-id='type-id-160' name='strides' filepath='Objects/abstract.c' line='622' column='1'/>
      <parameter type-id='type-id-7' name='itemsize' filepath='Objects/abstract.c' line='622' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='Objects/abstract.c' line='623' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-60' name='dest' filepath='Objects/abstract.c' line='550' column='1'/>
      <parameter type-id='type-id-60' name='src' filepath='Objects/abstract.c' line='550' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-162' name='view' filepath='Objects/abstract.c' line='499' column='1'/>
      <parameter type-id='type-id-64' name='buf' filepath='Objects/abstract.c' line='499' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/abstract.c' line='499' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='Objects/abstract.c' line='499' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-253'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='Objects/abstract.c' line='483' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-7' name='nd' filepath='Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-160' name='index' filepath='Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-254' name='shape' filepath='Objects/abstract.c' line='483' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='Objects/abstract.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-7' name='nd' filepath='Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-160' name='index' filepath='Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-254' name='shape' filepath='Objects/abstract.c' line='483' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-162' name='view' filepath='Objects/abstract.c' line='451' column='1'/>
      <parameter type-id='type-id-160' name='indices' filepath='Objects/abstract.c' line='451' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-255'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-256' name='view' filepath='Objects/abstract.c' line='435' column='1'/>
      <parameter type-id='type-id-1' name='order' filepath='Objects/abstract.c' line='435' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='354' column='1'/>
      <parameter type-id='type-id-162' name='view' filepath='Objects/abstract.c' line='354' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Objects/abstract.c' line='354' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-257'/>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='325' column='1'/>
      <parameter type-id='type-id-257' name='buffer' filepath='Objects/abstract.c' line='326' column='1'/>
      <parameter type-id='type-id-160' name='buffer_len' filepath='Objects/abstract.c' line='327' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='Objects/abstract.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='318' column='1'/>
      <parameter type-id='type-id-257' name='buffer' filepath='Objects/abstract.c' line='319' column='1'/>
      <parameter type-id='type-id-160' name='buffer_len' filepath='Objects/abstract.c' line='320' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-258'/>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='311' column='1'/>
      <parameter type-id='type-id-258' name='buffer' filepath='Objects/abstract.c' line='312' column='1'/>
      <parameter type-id='type-id-160' name='buffer_len' filepath='Objects/abstract.c' line='313' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='276' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='255' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='255' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='223' column='1'/>
      <parameter type-id='type-id-60' name='key' filepath='Objects/abstract.c' line='223' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='191' column='1'/>
      <parameter type-id='type-id-60' name='key' filepath='Objects/abstract.c' line='191' column='1'/>
      <parameter type-id='type-id-60' name='value' filepath='Objects/abstract.c' line='191' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='143' column='1'/>
      <parameter type-id='type-id-60' name='key' filepath='Objects/abstract.c' line='143' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='86' column='1'/>
      <parameter type-id='type-id-39' name='defaultvalue' filepath='Objects/abstract.c' line='86' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='Objects/abstract.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/abstract.c' line='2595' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2144' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='Objects/abstract.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2117' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/accu.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-259' visibility='default' filepath='./Include/internal/pycore_accu.h' line='24' column='1' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_accu.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_accu.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyAccu' type-id='type-id-260' filepath='./Include/internal/pycore_accu.h' line='27' column='1' id='type-id-259'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-261'/>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-261' name='acc' filepath='Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-261' name='acc' filepath='Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-261' name='acc' filepath='Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-261' name='acc' filepath='Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-60' name='unicode' filepath='Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-261' name='acc' filepath='Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/boolobject.c' comp-dir-path='/src' language='LANG_C99'>
    <typedef-decl name='PyTypeObject' type-id='type-id-80' filepath='./Include/cpython/object.h' line='270' column='1' id='type-id-262'/>
    <var-decl name='PyBool_Type' type-id='type-id-262' mangled-name='PyBool_Type' visibility='default' filepath='./Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/longintrepr.h' line='85' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-81' visibility='default' filepath='./Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-264' visibility='default' filepath='./Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-109' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-265'/>
    <typedef-decl name='uint32_t' type-id='type-id-265' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-266'/>
    <typedef-decl name='digit' type-id='type-id-266' filepath='./Include/longintrepr.h' line='45' column='1' id='type-id-267'/>

    <array-type-def dimensions='1' type-id='type-id-267' size-in-bits='32' id='type-id-264'>
      <subrange length='1' type-id='type-id-43' id='type-id-206'/>

    </array-type-def>
    <var-decl name='_Py_FalseStruct' type-id='type-id-263' mangled-name='_Py_FalseStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-263' mangled-name='_Py_TrueStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-36' name='ok' filepath='Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/src' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='infinite' id='type-id-268'>
      <subrange length='infinite' id='type-id-53'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-268' const='yes' id='type-id-269'/>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-269' mangled-name='_Py_isspace__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='38' column='1' elf-symbol-id='_Py_isspace__doc__'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-269' mangled-name='_Py_isalpha__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='39' column='1' elf-symbol-id='_Py_isalpha__doc__'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-269' mangled-name='_Py_isalnum__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='40' column='1' elf-symbol-id='_Py_isalnum__doc__'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-269' mangled-name='_Py_isascii__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='41' column='1' elf-symbol-id='_Py_isascii__doc__'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-269' mangled-name='_Py_isdigit__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='42' column='1' elf-symbol-id='_Py_isdigit__doc__'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-269' mangled-name='_Py_islower__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='43' column='1' elf-symbol-id='_Py_islower__doc__'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-269' mangled-name='_Py_isupper__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='44' column='1' elf-symbol-id='_Py_isupper__doc__'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-269' mangled-name='_Py_istitle__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='45' column='1' elf-symbol-id='_Py_istitle__doc__'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-269' mangled-name='_Py_lower__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='46' column='1' elf-symbol-id='_Py_lower__doc__'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-269' mangled-name='_Py_upper__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='47' column='1' elf-symbol-id='_Py_upper__doc__'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-269' mangled-name='_Py_title__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='48' column='1' elf-symbol-id='_Py_title__doc__'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-269' mangled-name='_Py_capitalize__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='49' column='1' elf-symbol-id='_Py_capitalize__doc__'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-269' mangled-name='_Py_swapcase__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='50' column='1' elf-symbol-id='_Py_swapcase__doc__'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-269' mangled-name='_Py_maketrans__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='58' column='1' elf-symbol-id='_Py_maketrans__doc__'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-269' mangled-name='_Py_find__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='52' column='1' elf-symbol-id='_Py_find__doc__'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-269' mangled-name='_Py_index__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='53' column='1' elf-symbol-id='_Py_index__doc__'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-269' mangled-name='_Py_rfind__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='54' column='1' elf-symbol-id='_Py_rfind__doc__'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-269' mangled-name='_Py_rindex__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='55' column='1' elf-symbol-id='_Py_rindex__doc__'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-269' mangled-name='_Py_count__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='51' column='1' elf-symbol-id='_Py_count__doc__'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-269' mangled-name='_Py_startswith__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='56' column='1' elf-symbol-id='_Py_startswith__doc__'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-269' mangled-name='_Py_endswith__doc__' visibility='default' filepath='./Include/bytes_methods.h' line='57' column='1' elf-symbol-id='_Py_endswith__doc__'/>
    <function-decl name='_Py_bytes_endswith' mangled-name='_Py_bytes_endswith' filepath='Objects/bytes_methods.c' line='830' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_endswith'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='830' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='830' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='830' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_startswith' mangled-name='_Py_bytes_startswith' filepath='Objects/bytes_methods.c' line='816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_startswith'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='830' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='830' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='830' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_contains' mangled-name='_Py_bytes_contains' filepath='Objects/bytes_methods.c' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_contains'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='696' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='696' column='1'/>
      <parameter type-id='type-id-60' name='arg' filepath='Objects/bytes_methods.c' line='696' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_bytes_count' mangled-name='_Py_bytes_count' filepath='Objects/bytes_methods.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_count'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='656' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='656' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='656' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_rindex' mangled-name='_Py_bytes_rindex' filepath='Objects/bytes_methods.c' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_rindex'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_rfind' mangled-name='_Py_bytes_rfind' filepath='Objects/bytes_methods.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_rfind'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_index' mangled-name='_Py_bytes_index' filepath='Objects/bytes_methods.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_index'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_find' mangled-name='_Py_bytes_find' filepath='Objects/bytes_methods.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_find'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytes_methods.c' line='635' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_maketrans' mangled-name='_Py_bytes_maketrans' filepath='Objects/bytes_methods.c' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_maketrans'>
      <parameter type-id='type-id-162' name='frm' filepath='Objects/bytes_methods.c' line='406' column='1'/>
      <parameter type-id='type-id-162' name='to' filepath='Objects/bytes_methods.c' line='406' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_swapcase' mangled-name='_Py_bytes_swapcase' filepath='Objects/bytes_methods.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_swapcase'>
      <parameter type-id='type-id-12' name='result' filepath='Objects/bytes_methods.c' line='378' column='1'/>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytes_methods.c' line='378' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='378' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' mangled-name='_Py_bytes_capitalize' filepath='Objects/bytes_methods.c' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_capitalize'>
      <parameter type-id='type-id-12' name='result' filepath='Objects/bytes_methods.c' line='362' column='1'/>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytes_methods.c' line='362' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='362' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' mangled-name='_Py_bytes_title' filepath='Objects/bytes_methods.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_title'>
      <parameter type-id='type-id-12' name='result' filepath='Objects/bytes_methods.c' line='333' column='1'/>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytes_methods.c' line='333' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='333' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' mangled-name='_Py_bytes_upper' filepath='Objects/bytes_methods.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_upper'>
      <parameter type-id='type-id-12' name='result' filepath='Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='316' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' mangled-name='_Py_bytes_lower' filepath='Objects/bytes_methods.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_lower'>
      <parameter type-id='type-id-12' name='result' filepath='Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='316' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' mangled-name='_Py_bytes_istitle' filepath='Objects/bytes_methods.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_istitle'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='254' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='254' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' mangled-name='_Py_bytes_isupper' filepath='Objects/bytes_methods.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isupper'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='218' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='218' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' mangled-name='_Py_bytes_islower' filepath='Objects/bytes_methods.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_islower'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='218' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='218' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' mangled-name='_Py_bytes_isdigit' filepath='Objects/bytes_methods.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isdigit'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_isascii' mangled-name='_Py_bytes_isascii' filepath='Objects/bytes_methods.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isascii'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='113' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='113' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' mangled-name='_Py_bytes_isalnum' filepath='Objects/bytes_methods.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalnum'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' mangled-name='_Py_bytes_isalpha' filepath='Objects/bytes_methods.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalpha'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' mangled-name='_Py_bytes_isspace' filepath='Objects/bytes_methods.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isspace'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/src' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-270'>
      <subrange length='infinite' id='type-id-53'/>

    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-270' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='./Include/bytearrayobject.h' line='56' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-262' mangled-name='PyByteArray_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='34' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-262' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='35' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-60' name='a' filepath='Objects/bytearrayobject.c' line='258' column='1'/>
      <parameter type-id='type-id-60' name='b' filepath='Objects/bytearrayobject.c' line='258' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-60' name='self' filepath='Objects/bytearrayobject.c' line='179' column='1'/>
      <parameter type-id='type-id-39' name='requested_size' filepath='Objects/bytearrayobject.c' line='179' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='Objects/bytearrayobject.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-60' name='self' filepath='Objects/bytearrayobject.c' line='170' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2144' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='Objects/bytearrayobject.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-3' name='cptr' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-60' name='input' filepath='Objects/bytearrayobject.c' line='90' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytesobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyBytes_Type' type-id='type-id-262' mangled-name='PyBytes_Type' visibility='default' filepath='./Include/bytesobject.h' line='44' column='1' elf-symbol-id='PyBytes_Type'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-262' mangled-name='PyBytesIter_Type' visibility='default' filepath='./Include/bytesobject.h' line='45' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <class-decl name='__anonymous_struct__' size-in-bits='4416' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-271' visibility='default' filepath='./Include/bytesobject.h' line='144' column='1' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-60' visibility='default' filepath='./Include/bytesobject.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-39' visibility='default' filepath='./Include/bytesobject.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='min_size' type-id='type-id-39' visibility='default' filepath='./Include/bytesobject.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_bytearray' type-id='type-id-7' visibility='default' filepath='./Include/bytesobject.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='overallocate' type-id='type-id-7' visibility='default' filepath='./Include/bytesobject.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='use_small_buffer' type-id='type-id-7' visibility='default' filepath='./Include/bytesobject.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='small_buffer' type-id='type-id-273' visibility='default' filepath='./Include/bytesobject.h' line='164' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='4096' id='type-id-273'>
      <subrange length='512' type-id='type-id-43' id='type-id-274'/>

    </array-type-def>
    <typedef-decl name='_PyBytesWriter' type-id='type-id-272' filepath='./Include/bytesobject.h' line='165' column='1' id='type-id-271'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-275'/>
    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='Objects/bytesobject.c' line='3476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3476' column='1'/>
      <parameter type-id='type-id-64' name='ptr' filepath='Objects/bytesobject.c' line='3476' column='1'/>
      <parameter type-id='type-id-64' name='bytes' filepath='Objects/bytesobject.c' line='3477' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='Objects/bytesobject.c' line='3477' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='Objects/bytesobject.c' line='3432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3432' column='1'/>
      <parameter type-id='type-id-64' name='str' filepath='Objects/bytesobject.c' line='3432' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='Objects/bytesobject.c' line='3402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3402' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='Objects/bytesobject.c' line='3402' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='Objects/bytesobject.c' line='3372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3372' column='1'/>
      <parameter type-id='type-id-64' name='str' filepath='Objects/bytesobject.c' line='3372' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='Objects/bytesobject.c' line='3372' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='Objects/bytesobject.c' line='3302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3302' column='1'/>
      <parameter type-id='type-id-64' name='str' filepath='Objects/bytesobject.c' line='3302' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='Objects/bytesobject.c' line='3302' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='Objects/bytesobject.c' line='3232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3232' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='Objects/bytesobject.c' line='3221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init'>
      <parameter type-id='type-id-275' name='writer' filepath='Objects/bytesobject.c' line='3221' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_Fini' mangled-name='PyBytes_Fini' filepath='Objects/bytesobject.c' line='3047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Fini'>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-276'/>
    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='Objects/bytesobject.c' line='2995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
      <parameter type-id='type-id-276' name='pv' filepath='Objects/bytesobject.c' line='2995' column='1'/>
      <parameter type-id='type-id-39' name='newsize' filepath='Objects/bytesobject.c' line='2995' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='Objects/bytesobject.c' line='2973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
      <parameter type-id='type-id-276' name='pv' filepath='Objects/bytesobject.c' line='2973' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/bytesobject.c' line='2973' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_Concat' mangled-name='PyBytes_Concat' filepath='Objects/bytesobject.c' line='2924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Concat'>
      <parameter type-id='type-id-276' name='pv' filepath='Objects/bytesobject.c' line='2924' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/bytesobject.c' line='2924' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='Objects/bytesobject.c' line='2800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1933' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='Objects/bytesobject.c' line='2340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FromHex'>
      <parameter type-id='type-id-60' name='string' filepath='Objects/bytesobject.c' line='2340' column='1'/>
      <parameter type-id='type-id-7' name='use_bytearray' filepath='Objects/bytesobject.c' line='2340' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='Objects/bytesobject.c' line='1896' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='Objects/bytesobject.c' line='1332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/bytesobject.c' line='1332' column='1'/>
      <parameter type-id='type-id-7' name='smartquotes' filepath='Objects/bytesobject.c' line='1332' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='Objects/bytesobject.c' line='1290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/bytesobject.c' line='1290' column='1'/>
      <parameter type-id='type-id-250' name='s' filepath='Objects/bytesobject.c' line='1291' column='1'/>
      <parameter type-id='type-id-160' name='len' filepath='Objects/bytesobject.c' line='1292' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='Objects/bytesobject.c' line='1279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsString'>
      <parameter type-id='type-id-60' name='self' filepath='Objects/bytearrayobject.c' line='170' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyBytes_Size' mangled-name='PyBytes_Size' filepath='Objects/bytesobject.c' line='1268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Size'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2144' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytesobject.c' line='1241' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytesobject.c' line='1242' column='1'/>
      <parameter type-id='type-id-3' name='errors' filepath='Objects/bytesobject.c' line='1243' column='1'/>
      <parameter type-id='type-id-39' name='unicode' filepath='Objects/bytesobject.c' line='1244' column='1'/>
      <parameter type-id='type-id-3' name='recode_encoding' filepath='Objects/bytesobject.c' line='1245' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_DecodeEscape'>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytesobject.c' line='1118' column='1'/>
      <parameter type-id='type-id-39' name='len' filepath='Objects/bytesobject.c' line='1119' column='1'/>
      <parameter type-id='type-id-3' name='errors' filepath='Objects/bytesobject.c' line='1120' column='1'/>
      <parameter type-id='type-id-39' name='unicode' filepath='Objects/bytesobject.c' line='1121' column='1'/>
      <parameter type-id='type-id-3' name='recode_encoding' filepath='Objects/bytesobject.c' line='1122' column='1'/>
      <parameter type-id='type-id-258' name='first_invalid_escape' filepath='Objects/bytesobject.c' line='1123' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='Objects/bytesobject.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FormatEx'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/bytesobject.c' line='598' column='1'/>
      <parameter type-id='type-id-39' name='format_len' filepath='Objects/bytesobject.c' line='598' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/bytesobject.c' line='599' column='1'/>
      <parameter type-id='type-id-7' name='use_bytearray' filepath='Objects/bytesobject.c' line='599' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormat' mangled-name='PyBytes_FromFormat' filepath='Objects/bytesobject.c' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormat'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/bytesobject.c' line='371' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-64' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-64' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <function-decl name='PyBytes_FromFormatV' mangled-name='PyBytes_FromFormatV' filepath='Objects/bytesobject.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormatV'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/bytesobject.c' line='182' column='1'/>
      <parameter type-id='type-id-278' name='vargs' filepath='Objects/bytesobject.c' line='182' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyBytes_FromString' mangled-name='PyBytes_FromString' filepath='Objects/bytesobject.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromString'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytesobject.c' line='136' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='Objects/bytesobject.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromStringAndSize'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytesobject.c' line='102' column='1'/>
      <parameter type-id='type-id-39' name='size' filepath='Objects/bytesobject.c' line='102' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/call.c' comp-dir-path='/src' language='LANG_C99'>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-279'/>
    <function-decl name='_PyStack_UnpackDict' mangled-name='_PyStack_UnpackDict' filepath='Objects/call.c' line='1297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_UnpackDict'>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='1297' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='1297' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='1297' column='1'/>
      <parameter type-id='type-id-279' name='p_stack' filepath='Objects/call.c' line='1298' column='1'/>
      <parameter type-id='type-id-276' name='p_kwnames' filepath='Objects/call.c' line='1298' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyStack_AsDict' mangled-name='_PyStack_AsDict' filepath='Objects/call.c' line='1270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsDict'>
      <parameter type-id='type-id-190' name='values' filepath='Objects/call.c' line='1270' column='1'/>
      <parameter type-id='type-id-60' name='kwnames' filepath='Objects/call.c' line='1270' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='Objects/call.c' line='1254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='1254' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <class-decl name='_Py_Identifier' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='29' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-281' visibility='default' filepath='./Include/cpython/object.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' id='type-id-281'/>
    <function-decl name='_PyObject_CallMethodIdObjArgs' mangled-name='_PyObject_CallMethodIdObjArgs' filepath='Objects/call.c' line='1224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodIdObjArgs'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1224' column='1'/>
      <parameter type-id='type-id-281' name='name' filepath='Objects/call.c' line='1225' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='Objects/call.c' line='1200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1200' column='1'/>
      <parameter type-id='type-id-60' name='name' filepath='Objects/call.c' line='1200' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <typedef-decl name='_Py_Identifier' type-id='type-id-280' filepath='./Include/cpython/object.h' line='33' column='1' id='type-id-282'/>
    <function-decl name='_PyObject_CallMethodId_SizeT' mangled-name='_PyObject_CallMethodId_SizeT' filepath='Objects/call.c' line='1113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId_SizeT'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1113' column='1'/>
      <parameter type-id='type-id-281' name='name' filepath='Objects/call.c' line='1113' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='1114' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='Objects/call.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1089' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/call.c' line='1089' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='1090' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId' mangled-name='_PyObject_CallMethodId' filepath='Objects/call.c' line='1065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1113' column='1'/>
      <parameter type-id='type-id-281' name='name' filepath='Objects/call.c' line='1113' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='1114' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyEval_CallMethod' mangled-name='PyEval_CallMethod' filepath='Objects/call.c' line='1042' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallMethod'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1089' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/call.c' line='1089' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='1090' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_CallMethod' mangled-name='PyObject_CallMethod' filepath='Objects/call.c' line='1016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethod'>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='1089' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/call.c' line='1089' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='1090' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_CallFunction_SizeT' mangled-name='_PyObject_CallFunction_SizeT' filepath='Objects/call.c' line='986' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallFunction_SizeT'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='986' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='986' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyEval_CallFunction' mangled-name='PyEval_CallFunction' filepath='Objects/call.c' line='972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallFunction'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='986' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='986' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_CallFunction' mangled-name='PyObject_CallFunction' filepath='Objects/call.c' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunction'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='986' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='986' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_Call_Prepend' mangled-name='_PyObject_Call_Prepend' filepath='Objects/call.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_Call_Prepend'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='860' column='1'/>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='861' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/call.c' line='861' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='861' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_FastCall_Prepend' mangled-name='_PyObject_FastCall_Prepend' filepath='Objects/call.c' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCall_Prepend'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='825' column='1'/>
      <parameter type-id='type-id-60' name='obj' filepath='Objects/call.c' line='825' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='826' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='826' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_CallObject' mangled-name='PyObject_CallObject' filepath='Objects/call.c' line='816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallObject'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1166' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1166' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyEval_CallObjectWithKeywords' mangled-name='PyEval_CallObjectWithKeywords' filepath='Objects/call.c' line='784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallObjectWithKeywords'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='z' filepath='Objects/abstract.c' line='1173' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyCFunction_Call' mangled-name='PyCFunction_Call' filepath='Objects/call.c' line='768' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCFunction_Call'>
      <parameter type-id='type-id-60' name='v' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='w' filepath='Objects/abstract.c' line='1173' column='1'/>
      <parameter type-id='type-id-60' name='z' filepath='Objects/abstract.c' line='1173' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <typedef-decl name='PyMethodDef' type-id='type-id-174' filepath='./Include/methodobject.h' line='58' column='1' id='type-id-283'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-284'/>
    <function-decl name='_PyMethodDef_RawFastCallKeywords' mangled-name='_PyMethodDef_RawFastCallKeywords' filepath='Objects/call.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMethodDef_RawFastCallKeywords'>
      <parameter type-id='type-id-284' name='method' filepath='Objects/call.c' line='598' column='1'/>
      <parameter type-id='type-id-60' name='self' filepath='Objects/call.c' line='598' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='599' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='599' column='1'/>
      <parameter type-id='type-id-60' name='kwnames' filepath='Objects/call.c' line='600' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyCFunction_FastCallDict' mangled-name='_PyCFunction_FastCallDict' filepath='Objects/call.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCFunction_FastCallDict'>
      <parameter type-id='type-id-60' name='func' filepath='Objects/call.c' line='580' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='581' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='581' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='582' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyMethodDef_RawFastCallDict' mangled-name='_PyMethodDef_RawFastCallDict' filepath='Objects/call.c' line='449' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMethodDef_RawFastCallDict'>
      <parameter type-id='type-id-284' name='method' filepath='Objects/call.c' line='449' column='1'/>
      <parameter type-id='type-id-60' name='self' filepath='Objects/call.c' line='449' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='450' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='450' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='451' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyFunction_Vectorcall' mangled-name='_PyFunction_Vectorcall' filepath='Objects/call.c' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFunction_Vectorcall'>
      <parameter type-id='type-id-60' name='func' filepath='Objects/call.c' line='388' column='1'/>
      <parameter type-id='type-id-190' name='stack' filepath='Objects/call.c' line='388' column='1'/>
      <parameter type-id='type-id-70' name='nargsf' filepath='Objects/call.c' line='389' column='1'/>
      <parameter type-id='type-id-60' name='kwnames' filepath='Objects/call.c' line='389' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyFunction_FastCallDict' mangled-name='_PyFunction_FastCallDict' filepath='Objects/call.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFunction_FastCallDict'>
      <parameter type-id='type-id-60' name='func' filepath='Objects/call.c' line='300' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='300' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='300' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='301' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyObject_Call' mangled-name='PyObject_Call' filepath='Objects/call.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Call'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='215' column='1'/>
      <parameter type-id='type-id-60' name='args' filepath='Objects/call.c' line='215' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='215' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyVectorcall_Call' mangled-name='PyVectorcall_Call' filepath='Objects/call.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyVectorcall_Call'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='174' column='1'/>
      <parameter type-id='type-id-60' name='tuple' filepath='Objects/call.c' line='174' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='174' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_MakeTpCall' mangled-name='_PyObject_MakeTpCall' filepath='Objects/call.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_MakeTpCall'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='119' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='119' column='1'/>
      <parameter type-id='type-id-39' name='nargs' filepath='Objects/call.c' line='119' column='1'/>
      <parameter type-id='type-id-60' name='keywords' filepath='Objects/call.c' line='119' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyObject_FastCallDict' mangled-name='_PyObject_FastCallDict' filepath='Objects/call.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCallDict'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='74' column='1'/>
      <parameter type-id='type-id-190' name='args' filepath='Objects/call.c' line='74' column='1'/>
      <parameter type-id='type-id-70' name='nargsf' filepath='Objects/call.c' line='75' column='1'/>
      <parameter type-id='type-id-60' name='kwargs' filepath='Objects/call.c' line='75' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_CheckFunctionResult' mangled-name='_Py_CheckFunctionResult' filepath='Objects/call.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckFunctionResult'>
      <parameter type-id='type-id-60' name='callable' filepath='Objects/call.c' line='23' column='1'/>
      <parameter type-id='type-id-60' name='result' filepath='Objects/call.c' line='23' column='1'/>
      <parameter type-id='type-id-3' name='where' filepath='Objects/call.c' line='23' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/capsule.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyCapsule_Type' type-id='type-id-262' mangled-name='PyCapsule_Type' visibility='default' filepath='./Include/pycapsule.h' line='21' column='1' elf-symbol-id='PyCapsule_Type'/>
    <function-decl name='PyCapsule_Import' mangled-name='PyCapsule_Import' filepath='Objects/capsule.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_Import'>
      <parameter type-id='type-id-3' name='name' filepath='Objects/capsule.c' line='195' column='1'/>
      <parameter type-id='type-id-7' name='no_block' filepath='Objects/capsule.c' line='195' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='PyCapsule_SetContext' mangled-name='PyCapsule_SetContext' filepath='Objects/capsule.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetContext'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='181' column='1'/>
      <parameter type-id='type-id-64' name='context' filepath='Objects/capsule.c' line='181' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <typedef-decl name='PyCapsule_Destructor' type-id='type-id-75' filepath='./Include/pycapsule.h' line='23' column='1' id='type-id-285'/>
    <function-decl name='PyCapsule_SetDestructor' mangled-name='PyCapsule_SetDestructor' filepath='Objects/capsule.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetDestructor'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='167' column='1'/>
      <parameter type-id='type-id-285' name='destructor' filepath='Objects/capsule.c' line='167' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCapsule_SetName' mangled-name='PyCapsule_SetName' filepath='Objects/capsule.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetName'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2187' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2187' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCapsule_SetPointer' mangled-name='PyCapsule_SetPointer' filepath='Objects/capsule.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_SetPointer'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='181' column='1'/>
      <parameter type-id='type-id-64' name='context' filepath='Objects/capsule.c' line='181' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCapsule_GetContext' mangled-name='PyCapsule_GetContext' filepath='Objects/capsule.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetContext'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='122' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='PyCapsule_GetDestructor' mangled-name='PyCapsule_GetDestructor' filepath='Objects/capsule.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetDestructor'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='110' column='1'/>
      <return type-id='type-id-285'/>
    </function-decl>
    <function-decl name='PyCapsule_GetName' mangled-name='PyCapsule_GetName' filepath='Objects/capsule.c' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetName'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='98' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyCapsule_GetPointer' mangled-name='PyCapsule_GetPointer' filepath='Objects/capsule.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_GetPointer'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/capsule.c' line='80' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/capsule.c' line='80' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='PyCapsule_IsValid' mangled-name='PyCapsule_IsValid' filepath='Objects/capsule.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_IsValid'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2187' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2187' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCapsule_New' mangled-name='PyCapsule_New' filepath='Objects/capsule.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCapsule_New'>
      <parameter type-id='type-id-64' name='pointer' filepath='Objects/capsule.c' line='44' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/capsule.c' line='44' column='1'/>
      <parameter type-id='type-id-285' name='destructor' filepath='Objects/capsule.c' line='44' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/cellobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyCell_Type' type-id='type-id-262' mangled-name='PyCell_Type' visibility='default' filepath='./Include/cellobject.h' line='14' column='1' elf-symbol-id='PyCell_Type'/>
    <function-decl name='PyCell_Set' mangled-name='PyCell_Set' filepath='Objects/cellobject.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_Set'>
      <parameter type-id='type-id-60' name='o' filepath='Objects/abstract.c' line='2201' column='1'/>
      <parameter type-id='type-id-60' name='key' filepath='Objects/abstract.c' line='2201' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCell_Get' mangled-name='PyCell_Get' filepath='Objects/cellobject.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_Get'>
      <parameter type-id='type-id-60' name='input' filepath='Objects/bytearrayobject.c' line='90' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyCell_New' mangled-name='PyCell_New' filepath='Objects/cellobject.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_New'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/classobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyMethod_Type' type-id='type-id-262' mangled-name='PyMethod_Type' visibility='default' filepath='./Include/classobject.h' line='20' column='1' elf-symbol-id='PyMethod_Type'/>
    <var-decl name='PyInstanceMethod_Type' type-id='type-id-262' mangled-name='PyInstanceMethod_Type' visibility='default' filepath='./Include/classobject.h' line='43' column='1' elf-symbol-id='PyInstanceMethod_Type'/>
    <function-decl name='PyInstanceMethod_Function' mangled-name='PyInstanceMethod_Function' filepath='Objects/classobject.c' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInstanceMethod_Function'>
      <parameter type-id='type-id-60' name='input' filepath='Objects/bytearrayobject.c' line='90' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyInstanceMethod_New' mangled-name='PyInstanceMethod_New' filepath='Objects/classobject.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInstanceMethod_New'>
      <parameter type-id='type-id-60' name='iter' filepath='Objects/abstract.c' line='2609' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_PyMethod_DebugMallocStats' mangled-name='_PyMethod_DebugMallocStats' filepath='Objects/classobject.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMethod_DebugMallocStats'>
      <parameter type-id='type-id-212' name='out' filepath='Objects/classobject.c' line='429' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMethod_Fini' mangled-name='PyMethod_Fini' filepath='Objects/classobject.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Fini'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMethod_ClearFreeList' mangled-name='PyMethod_ClearFreeList' filepath='Objects/classobject.c' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_ClearFreeList'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMethod_New' mangled-name='PyMethod_New' filepath='Objects/classobject.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_New'>
      <parameter type-id='type-id-60' name='func' filepath='Objects/classobject.c' line='104' column='1'/>
      <parameter type-id='type-id-60' name='self' filepath='Objects/classobject.c' line='104' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyMethod_Self' mangled-name='PyMethod_Self' filepath='Objects/classobject.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Self'>
      <parameter type-id='type-id-60' name='input' filepath='Objects/bytearrayobject.c' line='90' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyMethod_Function' mangled-name='PyMethod_Function' filepath='Objects/classobject.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Function'>
      <parameter type-id='type-id-60' name='input' filepath='Objects/bytearrayobject.c' line='90' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/codeobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyCode_Type' type-id='type-id-262' mangled-name='PyCode_Type' visibility='default' filepath='./Include/code.h' line='116' column='1' elf-symbol-id='PyCode_Type'/>
    <function-decl name='_PyCode_SetExtra' mangled-name='_PyCode_SetExtra' filepath='Objects/codeobject.c' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_SetExtra'>
      <parameter type-id='type-id-60' name='code' filepath='Objects/codeobject.c' line='1054' column='1'/>
      <parameter type-id='type-id-39' name='index' filepath='Objects/codeobject.c' line='1054' column='1'/>
      <parameter type-id='type-id-64' name='extra' filepath='Objects/codeobject.c' line='1054' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyCode_GetExtra' mangled-name='_PyCode_GetExtra' filepath='Objects/codeobject.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_GetExtra'>
      <parameter type-id='type-id-60' name='code' filepath='Objects/codeobject.c' line='1033' column='1'/>
      <parameter type-id='type-id-39' name='index' filepath='Objects/codeobject.c' line='1033' column='1'/>
      <parameter type-id='type-id-257' name='extra' filepath='Objects/codeobject.c' line='1033' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1408' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-286' visibility='default' filepath='./Include/code.h' line='23' column='1' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-113' visibility='default' filepath='./Include/code.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='co_argcount' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='co_posonlyargcount' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='co_kwonlyargcount' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='co_nlocals' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='co_stacksize' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='co_flags' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='co_firstlineno' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='co_code' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='co_consts' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='co_names' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='co_varnames' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='co_freevars' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='co_cellvars' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='co_cell2arg' type-id='type-id-160' visibility='default' filepath='./Include/code.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='co_filename' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='co_name' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='co_lnotab' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='co_zombieframe' type-id='type-id-64' visibility='default' filepath='./Include/code.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='co_weakreflist' type-id='type-id-60' visibility='default' filepath='./Include/code.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='co_extra' type-id='type-id-64' visibility='default' filepath='./Include/code.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='co_opcache_map' type-id='type-id-288' visibility='default' filepath='./Include/code.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='co_opcache' type-id='type-id-289' visibility='default' filepath='./Include/code.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='co_opcache_flag' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='co_opcache_size' type-id='type-id-290' visibility='default' filepath='./Include/code.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-290'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-288'/>
    <class-decl name='_PyOpcache' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_code.h' line='13' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='type-id-292' visibility='default' filepath='./Include/internal/pycore_code.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='optimized' type-id='type-id-1' visibility='default' filepath='./Include/internal/pycore_code.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_code.h' line='14' column='1' id='type-id-292'>
      <data-member access='private'>
        <var-decl name='lg' type-id='type-id-293' visibility='default' filepath='./Include/internal/pycore_code.h' line='15' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-293' visibility='default' filepath='./Include/internal/pycore_code.h' line='7' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_code.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='globals_ver' type-id='type-id-65' visibility='default' filepath='./Include/internal/pycore_code.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='builtins_ver' type-id='type-id-65' visibility='default' filepath='./Include/internal/pycore_code.h' line='10' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyOpcache_LoadGlobal' type-id='type-id-294' filepath='./Include/internal/pycore_code.h' line='11' column='1' id='type-id-293'/>
    <typedef-decl name='_PyOpcache' type-id='type-id-291' filepath='./Include/code.h' line='20' column='1' id='type-id-295'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' id='type-id-289'/>
    <typedef-decl name='PyCodeObject' type-id='type-id-287' filepath='./Include/code.h' line='69' column='1' id='type-id-286'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-296'/>
    <class-decl name='_addr_pair' size-in-bits='64' is-struct='yes' visibility='default' filepath='./Include/code.h' line='143' column='1' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ap_lower' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ap_upper' type-id='type-id-7' visibility='default' filepath='./Include/code.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyAddrPair' type-id='type-id-297' filepath='./Include/code.h' line='146' column='1' id='type-id-298'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-299'/>
    <function-decl name='_PyCode_CheckLineNumber' mangled-name='_PyCode_CheckLineNumber' filepath='Objects/codeobject.c' line='981' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_CheckLineNumber'>
      <parameter type-id='type-id-296' name='co' filepath='Objects/codeobject.c' line='981' column='1'/>
      <parameter type-id='type-id-7' name='lasti' filepath='Objects/codeobject.c' line='981' column='1'/>
      <parameter type-id='type-id-299' name='bounds' filepath='Objects/codeobject.c' line='981' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCode_Addr2Line' mangled-name='PyCode_Addr2Line' filepath='Objects/codeobject.c' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_Addr2Line'>
      <parameter type-id='type-id-296' name='co' filepath='Objects/codeobject.c' line='962' column='1'/>
      <parameter type-id='type-id-7' name='addrq' filepath='Objects/codeobject.c' line='962' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyCode_ConstantKey' mangled-name='_PyCode_ConstantKey' filepath='Objects/codeobject.c' line='678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_ConstantKey'>
      <parameter type-id='type-id-60' name='op' filepath='Objects/codeobject.c' line='678' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyCode_NewEmpty' mangled-name='PyCode_NewEmpty' filepath='Objects/codeobject.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_NewEmpty'>
      <parameter type-id='type-id-3' name='filename' filepath='Objects/codeobject.c' line='303' column='1'/>
      <parameter type-id='type-id-3' name='funcname' filepath='Objects/codeobject.c' line='303' column='1'/>
      <parameter type-id='type-id-7' name='firstlineno' filepath='Objects/codeobject.c' line='303' column='1'/>
      <return type-id='type-id-296'/>
    </function-decl>
    <function-decl name='_PyCode_InitOpcache' mangled-name='_PyCode_InitOpcache' filepath='Objects/codeobject.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_InitOpcache'>
      <parameter type-id='type-id-296' name='co' filepath='Objects/codeobject.c' line='260' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCode_New' mangled-name='PyCode_New' filepath='Objects/codeobject.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_New'>
      <parameter type-id='type-id-7' name='argcount' filepath='Objects/codeobject.c' line='246' column='1'/>
      <parameter type-id='type-id-7' name='kwonlyargcount' filepath='Objects/codeobject.c' line='246' column='1'/>
      <parameter type-id='type-id-7' name='nlocals' filepath='Objects/codeobject.c' line='247' column='1'/>
      <parameter type-id='type-id-7' name='stacksize' filepath='Objects/codeobject.c' line='247' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Objects/codeobject.c' line='247' column='1'/>
      <parameter type-id='type-id-60' name='code' filepath='Objects/codeobject.c' line='248' column='1'/>
      <parameter type-id='type-id-60' name='consts' filepath='Objects/codeobject.c' line='248' column='1'/>
      <parameter type-id='type-id-60' name='names' filepath='Objects/codeobject.c' line='248' column='1'/>
      <parameter type-id='type-id-60' name='varnames' filepath='Objects/codeobject.c' line='249' column='1'/>
      <parameter type-id='type-id-60' name='freevars' filepath='Objects/codeobject.c' line='249' column='1'/>
      <parameter type-id='type-id-60' name='cellvars' filepath='Objects/codeobject.c' line='249' column='1'/>
      <parameter type-id='type-id-60' name='filename' filepath='Objects/codeobject.c' line='250' column='1'/>
      <parameter type-id='type-id-60' name='name' filepath='Objects/codeobject.c' line='250' column='1'/>
      <parameter type-id='type-id-7' name='firstlineno' filepath='Objects/codeobject.c' line='250' column='1'/>
      <parameter type-id='type-id-60' name='lnotab' filepath='Objects/codeobject.c' line='251' column='1'/>
      <return type-id='type-id-296'/>
    </function-decl>
    <function-decl name='PyCode_NewWithPosOnlyArgs' mangled-name='PyCode_NewWithPosOnlyArgs' filepath='Objects/codeobject.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_NewWithPosOnlyArgs'>
      <parameter type-id='type-id-7' name='argcount' filepath='Objects/codeobject.c' line='106' column='1'/>
      <parameter type-id='type-id-7' name='posonlyargcount' filepath='Objects/codeobject.c' line='106' column='1'/>
      <parameter type-id='type-id-7' name='kwonlyargcount' filepath='Objects/codeobject.c' line='106' column='1'/>
      <parameter type-id='type-id-7' name='nlocals' filepath='Objects/codeobject.c' line='107' column='1'/>
      <parameter type-id='type-id-7' name='stacksize' filepath='Objects/codeobject.c' line='107' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='Objects/codeobject.c' line='107' column='1'/>
      <parameter type-id='type-id-60' name='code' filepath='Objects/codeobject.c' line='108' column='1'/>
      <parameter type-id='type-id-60' name='consts' filepath='Objects/codeobject.c' line='108' column='1'/>
      <parameter type-id='type-id-60' name='names' filepath='Objects/codeobject.c' line='108' column='1'/>
      <parameter type-id='type-id-60' name='varnames' filepath='Objects/codeobject.c' line='109' column='1'/>
      <parameter type-id='type-id-60' name='freevars' filepath='Objects/codeobject.c' line='109' column='1'/>
      <parameter type-id='type-id-60' name='cellvars' filepath='Objects/codeobject.c' line='109' column='1'/>
      <parameter type-id='type-id-60' name='filename' filepath='Objects/codeobject.c' line='110' column='1'/>
      <parameter type-id='type-id-60' name='name' filepath='Objects/codeobject.c' line='110' column='1'/>
      <parameter type-id='type-id-7' name='firstlineno' filepath='Objects/codeobject.c' line='110' column='1'/>
      <parameter type-id='type-id-60' name='lnotab' filepath='Objects/codeobject.c' line='111' column='1'/>
      <return type-id='type-id-296'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/complexobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyComplex_Type' type-id='type-id-262' mangled-name='PyComplex_Type' visibility='default' filepath='./Include/complexobject.h' line='39' column='1' elf-symbol-id='PyComplex_Type'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-300' visibility='default' filepath='./Include/complexobject.h' line='10' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='real' type-id='type-id-302' visibility='default' filepath='./Include/complexobject.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imag' type-id='type-id-302' visibility='default' filepath='./Include/complexobject.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-302'/>
    <typedef-decl name='Py_complex' type-id='type-id-301' filepath='./Include/complexobject.h' line='13' column='1' id='type-id-300'/>
    <function-decl name='PyComplex_AsCComplex' mangled-name='PyComplex_AsCComplex' filepath='Objects/complexobject.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_AsCComplex'>
      <parameter type-id='type-id-60' name='op' filepath='Objects/complexobject.c' line='318' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='PyComplex_ImagAsDouble' mangled-name='PyComplex_ImagAsDouble' filepath='Objects/complexobject.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_ImagAsDouble'>
      <parameter type-id='type-id-60' name='op' filepath='Objects/complexobject.c' line='273' column='1'/>
      <return type-id='type-id-302'/>
    </function-decl>
    <function-decl name='PyComplex_RealAsDouble' mangled-name='PyComplex_RealAsDouble' filepath='Objects/complexobject.c' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_RealAsDouble'>
      <parameter type-id='type-id-60' name='op' filepath='Objects/complexobject.c' line='273' column='1'/>
      <return type-id='type-id-302'/>
    </function-decl>
    <function-decl name='PyComplex_FromDoubles' mangled-name='PyComplex_FromDoubles' filepath='Objects/complexobject.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_FromDoubles'>
      <parameter type-id='type-id-302' name='real' filepath='Objects/complexobject.c' line='253' column='1'/>
      <parameter type-id='type-id-302' name='imag' filepath='Objects/complexobject.c' line='253' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PyComplex_FromCComplex' mangled-name='PyComplex_FromCComplex' filepath='Objects/complexobject.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_FromCComplex'>
      <parameter type-id='type-id-300' name='cval' filepath='Objects/complexobject.c' line='230' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_c_abs' mangled-name='_Py_c_abs' filepath='Objects/complexobject.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_abs'>
      <parameter type-id='type-id-300' name='z' filepath='Objects/complexobject.c' line='187' column='1'/>
      <return type-id='type-id-302'/>
    </function-decl>
    <function-decl name='_Py_c_pow' mangled-name='_Py_c_pow' filepath='Objects/complexobject.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_pow'>
      <parameter type-id='type-id-300' name='a' filepath='Objects/complexobject.c' line='124' column='1'/>
      <parameter type-id='type-id-300' name='b' filepath='Objects/complexobject.c' line='124' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='_Py_c_quot' mangled-name='_Py_c_quot' filepath='Objects/complexobject.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_quot'>
      <parameter type-id='type-id-300' name='a' filepath='Objects/complexobject.c' line='63' column='1'/>
      <parameter type-id='type-id-300' name='b' filepath='Objects/complexobject.c' line='63' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='_Py_c_prod' mangled-name='_Py_c_prod' filepath='Objects/complexobject.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_prod'>
      <parameter type-id='type-id-300' name='a' filepath='Objects/complexobject.c' line='50' column='1'/>
      <parameter type-id='type-id-300' name='b' filepath='Objects/complexobject.c' line='50' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='_Py_c_neg' mangled-name='_Py_c_neg' filepath='Objects/complexobject.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_neg'>
      <parameter type-id='type-id-300' name='a' filepath='Objects/complexobject.c' line='41' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='_Py_c_diff' mangled-name='_Py_c_diff' filepath='Objects/complexobject.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_diff'>
      <parameter type-id='type-id-300' name='a' filepath='Objects/complexobject.c' line='50' column='1'/>
      <parameter type-id='type-id-300' name='b' filepath='Objects/complexobject.c' line='50' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
    <function-decl name='_Py_c_sum' mangled-name='_Py_c_sum' filepath='Objects/complexobject.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_sum'>
      <parameter type-id='type-id-300' name='a' filepath='Objects/complexobject.c' line='50' column='1'/>
      <parameter type-id='type-id-300' name='b' filepath='Objects/complexobject.c' line='50' column='1'/>
      <return type-id='type-id-300'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/descrobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyMethodDescr_Type' type-id='type-id-262' mangled-name='PyMethodDescr_Type' visibility='default' filepath='./Include/descrobject.h' line='79' column='1' elf-symbol-id='PyMethodDescr_Type'/>
    <var-decl name='PyClassMethodDescr_Type' type-id='type-id-262' mangled-name='PyClassMethodDescr_Type' visibility='default' filepath='./Include/descrobject.h' line='76' column='1' elf-symbol-id='PyClassMethodDescr_Type'/>
    <var-decl name='PyMemberDescr_Type' type-id='type-id-262' mangled-name='PyMemberDescr_Type' visibility='default' filepath='./Include/descrobject.h' line='78' column='1' elf-symbol-id='PyMemberDescr_Type'/>
    <var-decl name='PyGetSetDescr_Type' type-id='type-id-262' mangled-name='PyGetSetDescr_Type' visibility='default' filepath='./Include/descrobject.h' line='77' column='1' elf-symbol-id='PyGetSetDescr_Type'/>
    <var-decl name='PyWrapperDescr_Type' type-id='type-id-262' mangled-name='PyWrapperDescr_Type' visibility='default' filepath='./Include/descrobject.h' line='80' column='1' elf-symbol-id='PyWrapperDescr_Type'/>
    <var-decl name='_PyMethodWrapper_Type' type-id='type-id-262' mangled-name='_PyMethodWrapper_Type' visibility='default' filepath='./Include/descrobject.h' line='83' column='1' elf-symbol-id='_PyMethodWrapper_Type'/>
    <var-decl name='PyDictProxy_Type' type-id='type-id-262' mangled-name='PyDictProxy_Type' visibility='default' filepath='./Include/descrobject.h' line='81' column='1' elf-symbol-id='PyDictProxy_Type'/>
    <var-decl name='PyProperty_Type' type-id='type-id-262' mangled-name='PyProperty_Type' visibility='default' filepath='./Include/descrobject.h' line='103' column='1' elf-symbol-id='PyProperty_Type'/>
    <function-decl name='PyWrapper_New' mangled-name='PyWrapper_New' filepath='Objects/descrobject.c' line='1355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyWrapper_New'>
      <parameter type-id='type-id-60' name='d' filepath='Objects/descrobject.c' line='1355' column='1'/>
      <parameter type-id='type-id-60' name='self' filepath='Objects/descrobject.c' line='1355' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
