<abi-corpus path='libpython3.10.so' soname='libpython3.10.so.1.0'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAIter_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_Parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_UnpackTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ValidateKeywordArguments' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_PyParser_TokenNames' size='520' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyRuntime' size='672' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PySet_Dummy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_CallableProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_ProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_RefType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_EllipsisObject' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_FalseStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HashSecret' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NoneStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NotImplementedStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-3'/>
    </function-decl>
    <type-decl name='void' id='type-id-4'/>
    <function-decl name='PyOS_snprintf' mangled-name='PyOS_snprintf' filepath='./Include/pyerrors.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/token.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-5'/>

    <array-type-def dimensions='1' type-id='type-id-5' size-in-bits='infinite' id='type-id-6'>
      <subrange length='infinite' id='type-id-7'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-6' const='yes' id='type-id-8'/>
    <var-decl name='_PyParser_TokenNames' type-id='type-id-8' mangled-name='_PyParser_TokenNames' visibility='default' filepath='./Include/token.h' line='88' column='1' elf-symbol-id='_PyParser_TokenNames'/>
    <type-decl name='int' size-in-bits='32' id='type-id-9'/>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='Parser/token.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_ThreeChars'>
      <parameter type-id='type-id-9' name='c1' filepath='Parser/token.c' line='194' column='1'/>
      <parameter type-id='type-id-9' name='c2' filepath='Parser/token.c' line='194' column='1'/>
      <parameter type-id='type-id-9' name='c3' filepath='Parser/token.c' line='194' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='Parser/token.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_TwoChars'>
      <parameter type-id='type-id-9' name='c1' filepath='Parser/token.c' line='110' column='1'/>
      <parameter type-id='type-id-9' name='c2' filepath='Parser/token.c' line='110' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='Parser/token.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_OneChar'>
      <parameter type-id='type-id-9' name='c1' filepath='Parser/token.c' line='79' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/pegen.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_PyAST_Name' mangled-name='_PyAST_Name' filepath='./Include/internal/pycore_ast.h' line='775' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_expr_seq_new' mangled-name='_Py_asdl_expr_seq_new' filepath='./Include/internal/pycore_ast.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Call' mangled-name='_PyAST_Call' filepath='./Include/internal/pycore_ast.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Dealloc' mangled-name='_Py_Dealloc' filepath='./Include/object.h' line='447' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArena_AddPyObject' mangled-name='_PyArena_AddPyObject' filepath='./Include/internal/pycore_pyarena.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeUTF8' mangled-name='PyUnicode_DecodeUTF8' filepath='./Include/unicodeobject.h' line='454' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_TypeIgnore' mangled-name='_PyAST_TypeIgnore' filepath='./Include/internal/pycore_ast.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_type_ignore_seq_new' mangled-name='_Py_asdl_type_ignore_seq_new' filepath='./Include/internal/pycore_ast.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Module' mangled-name='_PyAST_Module' filepath='./Include/internal/pycore_ast.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_ConcatFstring' mangled-name='_PyPegen_FstringParser_ConcatFstring' filepath='Parser/string_parser.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_parsestr' mangled-name='_PyPegen_parsestr' filepath='Parser/string_parser.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_ConcatAndDel' mangled-name='_PyPegen_FstringParser_ConcatAndDel' filepath='Parser/string_parser.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='./Include/bytesobject.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_Init' mangled-name='_PyPegen_FstringParser_Init' filepath='Parser/string_parser.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Constant' mangled-name='_PyAST_Constant' filepath='./Include/internal/pycore_ast.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_Dealloc' mangled-name='_PyPegen_FstringParser_Dealloc' filepath='Parser/string_parser.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Occurred' mangled-name='PyErr_Occurred' filepath='./Include/pyerrors.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_Finish' mangled-name='_PyPegen_FstringParser_Finish' filepath='Parser/string_parser.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_keyword_seq_new' mangled-name='_Py_asdl_keyword_seq_new' filepath='./Include/internal/pycore_ast.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArena_Malloc' mangled-name='_PyArena_Malloc' filepath='./Include/internal/pycore_pyarena.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_ClassDef' mangled-name='_PyAST_ClassDef' filepath='./Include/internal/pycore_ast.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_FunctionDef' mangled-name='_PyAST_FunctionDef' filepath='./Include/internal/pycore_ast.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_AsyncFunctionDef' mangled-name='_PyAST_AsyncFunctionDef' filepath='./Include/internal/pycore_ast.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_arg_seq_new' mangled-name='_Py_asdl_arg_seq_new' filepath='./Include/internal/pycore_ast.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_arguments' mangled-name='_PyAST_arguments' filepath='./Include/internal/pycore_ast.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_generic_seq_new' mangled-name='_Py_asdl_generic_seq_new' filepath='./Include/internal/pycore_asdl.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='./Include/bytesobject.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_arg' mangled-name='_PyAST_arg' filepath='./Include/internal/pycore_ast.h' line='798' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_pattern_seq_new' mangled-name='_Py_asdl_pattern_seq_new' filepath='./Include/internal/pycore_ast.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_List' mangled-name='_PyAST_List' filepath='./Include/internal/pycore_ast.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Tuple' mangled-name='_PyAST_Tuple' filepath='./Include/internal/pycore_ast.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Attribute' mangled-name='_PyAST_Attribute' filepath='./Include/internal/pycore_ast.h' line='766' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Subscript' mangled-name='_PyAST_Subscript' filepath='./Include/internal/pycore_ast.h' line='769' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Starred' mangled-name='_PyAST_Starred' filepath='./Include/internal/pycore_ast.h' line='772' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_int_seq_new' mangled-name='_Py_asdl_int_seq_new' filepath='./Include/internal/pycore_asdl.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_identifier_seq_new' mangled-name='_Py_asdl_identifier_seq_new' filepath='./Include/internal/pycore_asdl.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_InternFromString' mangled-name='PyUnicode_InternFromString' filepath='./Include/unicodeobject.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_alias' mangled-name='_PyAST_alias' filepath='./Include/internal/pycore_ast.h' line='804' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_Ready' mangled-name='_PyUnicode_Ready' filepath='./Include/cpython/unicodeobject.h' line='472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsUTF8' mangled-name='PyUnicode_AsUTF8' filepath='./Include/cpython/unicodeobject.h' line='742' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='./Include/bytesobject.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_InternInPlace' mangled-name='PyUnicode_InternInPlace' filepath='./Include/unicodeobject.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromString' mangled-name='PyTokenizer_FromString' filepath='Parser/tokenizer.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_Free' mangled-name='PyTokenizer_Free' filepath='Parser/tokenizer.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromUTF8' mangled-name='PyTokenizer_FromUTF8' filepath='Parser/tokenizer.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromFile' mangled-name='PyTokenizer_FromFile' filepath='Parser/tokenizer.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_CompareWithASCIIString' mangled-name='PyUnicode_CompareWithASCIIString' filepath='./Include/unicodeobject.h' line='996' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_ExceptionMatches' mangled-name='PyErr_ExceptionMatches' filepath='./Include/pyerrors.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Malloc' mangled-name='PyMem_Malloc' filepath='./Include/pymem.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Calloc' mangled-name='PyMem_Calloc' filepath='./Include/pymem.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Free' mangled-name='PyMem_Free' filepath='./Include/pymem.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_NoMemory' mangled-name='PyErr_NoMemory' filepath='./Include/pyerrors.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_strtol' mangled-name='PyOS_strtol' filepath='./Include/longobject.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromLong' mangled-name='PyLong_FromLong' filepath='./Include/longobject.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_strtoul' mangled-name='PyOS_strtoul' filepath='./Include/longobject.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_string_to_double' mangled-name='PyOS_string_to_double' filepath='./Include/pystrtod.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyComplex_FromCComplex' mangled-name='PyComplex_FromCComplex' filepath='./Include/complexobject.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromString' mangled-name='PyLong_FromString' filepath='./Include/longobject.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyFloat_FromDouble' mangled-name='PyFloat_FromDouble' filepath='./Include/floatobject.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='./Include/bytesobject.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Realloc' mangled-name='PyMem_Realloc' filepath='./Include/pymem.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_Get' mangled-name='PyTokenizer_Get' filepath='Parser/tokenizer.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetNone' mangled-name='PyErr_SetNone' filepath='./Include/pyerrors.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromFormatV' mangled-name='PyUnicode_FromFormatV' filepath='./Include/unicodeobject.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromStringAndSize' mangled-name='PyUnicode_FromStringAndSize' filepath='./Include/unicodeobject.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='Py_BuildValue' mangled-name='Py_BuildValue' filepath='./Include/modsupport.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTuple_Pack' mangled-name='PyTuple_Pack' filepath='./Include/tupleobject.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetObject' mangled-name='PyErr_SetObject' filepath='./Include/pyerrors.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_ProgramDecodedTextObject' mangled-name='_PyErr_ProgramDecodedTextObject' filepath='./Include/cpython/pyerrors.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Fetch' mangled-name='PyErr_Fetch' filepath='./Include/pyerrors.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Str' mangled-name='PyObject_Str' filepath='./Include/object.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Clear' mangled-name='PyErr_Clear' filepath='./Include/pyerrors.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Format' mangled-name='PyErr_Format' filepath='./Include/pyerrors.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyImport_ImportModuleNoBlock' mangled-name='PyImport_ImportModuleNoBlock' filepath='./Include/import.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetAttrString' mangled-name='PyObject_GetAttrString' filepath='./Include/object.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_MakeTpCall' mangled-name='_PyObject_MakeTpCall' filepath='./Include/cpython/abstract.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_CheckFunctionResult' mangled-name='_Py_CheckFunctionResult' filepath='./Include/cpython/abstract.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThreadState_Get' mangled-name='PyThreadState_Get' filepath='./Include/pystate.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyType_Name' mangled-name='_PyType_Name' filepath='./Include/cpython/object.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Restore' mangled-name='PyErr_Restore' filepath='./Include/pyerrors.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_parse' mangled-name='_PyPegen_parse' filepath='Parser/pegen.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/parser.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_PyPegen_expect_token' mangled-name='_PyPegen_expect_token' filepath='Parser/pegen.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_singleton_seq' mangled-name='_PyPegen_singleton_seq' filepath='Parser/pegen.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_insert_memo' mangled-name='_PyPegen_insert_memo' filepath='Parser/pegen.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_insert_in_front' mangled-name='_PyPegen_seq_insert_in_front' filepath='Parser/pegen.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_append_to_end' mangled-name='_PyPegen_seq_append_to_end' filepath='Parser/pegen.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_FunctionType' mangled-name='_PyAST_FunctionType' filepath='./Include/internal/pycore_ast.h' line='632' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_make_module' mangled-name='_PyPegen_make_module' filepath='Parser/pegen.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_function_def_decorators' mangled-name='_PyPegen_function_def_decorators' filepath='Parser/pegen.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_lookahead' mangled-name='_PyPegen_lookahead' filepath='Parser/pegen.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_lookahead_with_int' mangled-name='_PyPegen_lookahead_with_int' filepath='Parser/pegen.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_class_def_decorators' mangled-name='_PyPegen_class_def_decorators' filepath='Parser/pegen.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_last_nonnwhitespace_token' mangled-name='_PyPegen_get_last_nonnwhitespace_token' filepath='Parser/pegen.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_While' mangled-name='_PyAST_While' filepath='./Include/internal/pycore_ast.h' line='670' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_raise_error' mangled-name='_PyPegen_raise_error' filepath='Parser/pegen.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_fill_token' mangled-name='_PyPegen_fill_token' filepath='Parser/pegen.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Match' mangled-name='_PyAST_Match' filepath='./Include/internal/pycore_ast.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_expect_soft_keyword' mangled-name='_PyPegen_expect_soft_keyword' filepath='Parser/pegen.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Pass' mangled-name='_PyAST_Pass' filepath='./Include/internal/pycore_ast.h' line='705' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_interactive_exit' mangled-name='_PyPegen_interactive_exit' filepath='Parser/pegen.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Interactive' mangled-name='_PyAST_Interactive' filepath='./Include/internal/pycore_ast.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Expression' mangled-name='_PyAST_Expression' filepath='./Include/internal/pycore_ast.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_dummy_name' mangled-name='_PyPegen_dummy_name' filepath='Parser/pegen.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_IfExp' mangled-name='_PyAST_IfExp' filepath='./Include/internal/pycore_ast.h' line='726' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_check_legacy_stmt' mangled-name='_PyPegen_check_legacy_stmt' filepath='Parser/pegen.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_name_token' mangled-name='_PyPegen_name_token' filepath='Parser/pegen.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_is_memoized' mangled-name='_PyPegen_is_memoized' filepath='Parser/pegen.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_string_token' mangled-name='_PyPegen_string_token' filepath='Parser/pegen.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_soft_keyword_token' mangled-name='_PyPegen_soft_keyword_token' filepath='Parser/pegen.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_comprehension' mangled-name='_PyAST_comprehension' filepath='./Include/internal/pycore_ast.h' line='787' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_set_expr_context' mangled-name='_PyPegen_set_expr_context' filepath='Parser/pegen.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_NamedExpr' mangled-name='_PyAST_NamedExpr' filepath='./Include/internal/pycore_ast.h' line='714' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_expr_name' mangled-name='_PyPegen_get_expr_name' filepath='Parser/pegen.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_key_pattern_pair' mangled-name='_PyPegen_key_pattern_pair' filepath='Parser/pegen.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchAs' mangled-name='_PyAST_MatchAs' filepath='./Include/internal/pycore_ast.h' line='829' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_lookahead_with_name' mangled-name='_PyPegen_lookahead_with_name' filepath='Parser/pegen.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_match_case' mangled-name='_PyAST_match_case' filepath='./Include/internal/pycore_ast.h' line='809' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_invalid_target' mangled-name='_PyPegen_get_invalid_target' filepath='Parser/pegen.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_last_item' mangled-name='_PyPegen_seq_last_item' filepath='Parser/pegen.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_update_memo' mangled-name='_PyPegen_update_memo' filepath='Parser/pegen.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_keyword' mangled-name='_PyAST_keyword' filepath='./Include/internal/pycore_ast.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_keyword_or_starred' mangled-name='_PyPegen_keyword_or_starred' filepath='Parser/pegen.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_join_sequences' mangled-name='_PyPegen_join_sequences' filepath='Parser/pegen.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_collect_call_seqs' mangled-name='_PyPegen_collect_call_seqs' filepath='Parser/pegen.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_delete_starred_exprs' mangled-name='_PyPegen_seq_delete_starred_exprs' filepath='Parser/pegen.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_extract_starred_exprs' mangled-name='_PyPegen_seq_extract_starred_exprs' filepath='Parser/pegen.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_nonparen_genexp_in_call' mangled-name='_PyPegen_nonparen_genexp_in_call' filepath='Parser/pegen.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_arguments_parsing_error' mangled-name='_PyPegen_arguments_parsing_error' filepath='Parser/pegen.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_YieldFrom' mangled-name='_PyAST_YieldFrom' filepath='./Include/internal/pycore_ast.h' line='750' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Yield' mangled-name='_PyAST_Yield' filepath='./Include/internal/pycore_ast.h' line='748' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_key_value_pair' mangled-name='_PyPegen_key_value_pair' filepath='Parser/pegen.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_GeneratorExp' mangled-name='_PyAST_GeneratorExp' filepath='./Include/internal/pycore_ast.h' line='743' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_concatenate_strings' mangled-name='_PyPegen_concatenate_strings' filepath='Parser/pegen.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_number_token' mangled-name='_PyPegen_number_token' filepath='Parser/pegen.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_ListComp' mangled-name='_PyAST_ListComp' filepath='./Include/internal/pycore_ast.h' line='734' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_SetComp' mangled-name='_PyAST_SetComp' filepath='./Include/internal/pycore_ast.h' line='737' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_values' mangled-name='_PyPegen_get_values' filepath='Parser/pegen.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_keys' mangled-name='_PyPegen_get_keys' filepath='Parser/pegen.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Dict' mangled-name='_PyAST_Dict' filepath='./Include/internal/pycore_ast.h' line='729' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Set' mangled-name='_PyAST_Set' filepath='./Include/internal/pycore_ast.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_DictComp' mangled-name='_PyAST_DictComp' filepath='./Include/internal/pycore_ast.h' line='740' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Slice' mangled-name='_PyAST_Slice' filepath='./Include/internal/pycore_ast.h' line='784' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Await' mangled-name='_PyAST_Await' filepath='./Include/internal/pycore_ast.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_UnaryOp' mangled-name='_PyAST_UnaryOp' filepath='./Include/internal/pycore_ast.h' line='720' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_BinOp' mangled-name='_PyAST_BinOp' filepath='./Include/internal/pycore_ast.h' line='717' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_cmpop_expr_pair' mangled-name='_PyPegen_cmpop_expr_pair' filepath='Parser/pegen.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_check_barry_as_flufl' mangled-name='_PyPegen_check_barry_as_flufl' filepath='Parser/pegen.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_exprs' mangled-name='_PyPegen_get_exprs' filepath='Parser/pegen.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_cmpops' mangled-name='_PyPegen_get_cmpops' filepath='Parser/pegen.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Compare' mangled-name='_PyAST_Compare' filepath='./Include/internal/pycore_ast.h' line='752' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_BoolOp' mangled-name='_PyAST_BoolOp' filepath='./Include/internal/pycore_ast.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_name_default_pair' mangled-name='_PyPegen_name_default_pair' filepath='Parser/pegen.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_star_etc' mangled-name='_PyPegen_star_etc' filepath='Parser/pegen.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_slash_with_default' mangled-name='_PyPegen_slash_with_default' filepath='Parser/pegen.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Lambda' mangled-name='_PyAST_Lambda' filepath='./Include/internal/pycore_ast.h' line='723' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_empty_arguments' mangled-name='_PyPegen_empty_arguments' filepath='Parser/pegen.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_make_arguments' mangled-name='_PyPegen_make_arguments' filepath='Parser/pegen.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_expect_forced_token' mangled-name='_PyPegen_expect_forced_token' filepath='Parser/pegen.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_add_type_comment_to_arg' mangled-name='_PyPegen_add_type_comment_to_arg' filepath='Parser/pegen.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_new_type_comment' mangled-name='_PyPegen_new_type_comment' filepath='Parser/pegen.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_patterns' mangled-name='_PyPegen_get_patterns' filepath='Parser/pegen.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_pattern_keys' mangled-name='_PyPegen_get_pattern_keys' filepath='Parser/pegen.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_map_names_to_ids' mangled-name='_PyPegen_map_names_to_ids' filepath='Parser/pegen.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchClass' mangled-name='_PyAST_MatchClass' filepath='./Include/internal/pycore_ast.h' line='823' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_first_item' mangled-name='_PyPegen_seq_first_item' filepath='Parser/pegen.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchMapping' mangled-name='_PyAST_MatchMapping' filepath='./Include/internal/pycore_ast.h' line='819' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchStar' mangled-name='_PyAST_MatchStar' filepath='./Include/internal/pycore_ast.h' line='827' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_lookahead_with_string' mangled-name='_PyPegen_lookahead_with_string' filepath='Parser/pegen.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_ensure_real' mangled-name='_PyPegen_ensure_real' filepath='Parser/pegen.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_ensure_imaginary' mangled-name='_PyPegen_ensure_imaginary' filepath='Parser/pegen.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchOr' mangled-name='_PyAST_MatchOr' filepath='./Include/internal/pycore_ast.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchValue' mangled-name='_PyAST_MatchValue' filepath='./Include/internal/pycore_ast.h' line='811' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchSingleton' mangled-name='_PyAST_MatchSingleton' filepath='./Include/internal/pycore_ast.h' line='813' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_MatchSequence' mangled-name='_PyAST_MatchSequence' filepath='./Include/internal/pycore_ast.h' line='816' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Try' mangled-name='_PyAST_Try' filepath='./Include/internal/pycore_ast.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_ExceptHandler' mangled-name='_PyAST_ExceptHandler' filepath='./Include/internal/pycore_ast.h' line='790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_withitem' mangled-name='_PyAST_withitem' filepath='./Include/internal/pycore_ast.h' line='807' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_With' mangled-name='_PyAST_With' filepath='./Include/internal/pycore_ast.h' line='676' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_AsyncWith' mangled-name='_PyAST_AsyncWith' filepath='./Include/internal/pycore_ast.h' line='679' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_For' mangled-name='_PyAST_For' filepath='./Include/internal/pycore_ast.h' line='662' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_AsyncFor' mangled-name='_PyAST_AsyncFor' filepath='./Include/internal/pycore_ast.h' line='666' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_If' mangled-name='_PyAST_If' filepath='./Include/internal/pycore_ast.h' line='673' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_join_names_with_dot' mangled-name='_PyPegen_join_names_with_dot' filepath='Parser/pegen.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_alias_for_star' mangled-name='_PyPegen_alias_for_star' filepath='Parser/pegen.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_count_dots' mangled-name='_PyPegen_seq_count_dots' filepath='Parser/pegen.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_ImportFrom' mangled-name='_PyAST_ImportFrom' filepath='./Include/internal/pycore_ast.h' line='695' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_augoperator' mangled-name='_PyPegen_augoperator' filepath='Parser/pegen.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_AnnAssign' mangled-name='_PyAST_AnnAssign' filepath='./Include/internal/pycore_ast.h' line='659' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Assign' mangled-name='_PyAST_Assign' filepath='./Include/internal/pycore_ast.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_AugAssign' mangled-name='_PyAST_AugAssign' filepath='./Include/internal/pycore_ast.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Expr' mangled-name='_PyAST_Expr' filepath='./Include/internal/pycore_ast.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Break' mangled-name='_PyAST_Break' filepath='./Include/internal/pycore_ast.h' line='707' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Continue' mangled-name='_PyAST_Continue' filepath='./Include/internal/pycore_ast.h' line='709' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Return' mangled-name='_PyAST_Return' filepath='./Include/internal/pycore_ast.h' line='649' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Raise' mangled-name='_PyAST_Raise' filepath='./Include/internal/pycore_ast.h' line='685' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Import' mangled-name='_PyAST_Import' filepath='./Include/internal/pycore_ast.h' line='693' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Delete' mangled-name='_PyAST_Delete' filepath='./Include/internal/pycore_ast.h' line='651' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Assert' mangled-name='_PyAST_Assert' filepath='./Include/internal/pycore_ast.h' line='691' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Global' mangled-name='_PyAST_Global' filepath='./Include/internal/pycore_ast.h' line='698' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_Nonlocal' mangled-name='_PyAST_Nonlocal' filepath='./Include/internal/pycore_ast.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_flatten' mangled-name='_PyPegen_seq_flatten' filepath='Parser/pegen.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_raise_error_known_location' mangled-name='_PyPegen_raise_error_known_location' filepath='Parser/pegen.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/string_parser.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_PyAST_JoinedStr' mangled-name='_PyAST_JoinedStr' filepath='./Include/internal/pycore_ast.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeUTF8Stateful' mangled-name='PyUnicode_DecodeUTF8Stateful' filepath='./Include/unicodeobject.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AppendAndDel' mangled-name='PyUnicode_AppendAndDel' filepath='./Include/unicodeobject.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_Parser_New' mangled-name='_PyPegen_Parser_New' filepath='Parser/pegen.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser' mangled-name='_PyPegen_run_parser' filepath='Parser/pegen.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_Parser_Free' mangled-name='_PyPegen_Parser_Free' filepath='Parser/pegen.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAST_FormattedValue' mangled-name='_PyAST_FormattedValue' filepath='./Include/internal/pycore_ast.h' line='758' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='./Include/cpython/bytesobject.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_BadInternalCall' mangled-name='_PyErr_BadInternalCall' filepath='./Include/pyerrors.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetString' mangled-name='PyErr_SetString' filepath='./Include/pyerrors.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin___sprintf_chk' mangled-name='__sprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_DecodeUnicodeEscapeInternal' mangled-name='_PyUnicode_DecodeUnicodeEscapeInternal' filepath='./Include/cpython/unicodeobject.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromFormat' mangled-name='PyUnicode_FromFormat' filepath='./Include/unicodeobject.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_WarnExplicitObject' mangled-name='PyErr_WarnExplicitObject' filepath='./Include/warnings.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_new_identifier' mangled-name='_PyPegen_new_identifier' filepath='Parser/pegen.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/peg_api.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='PySys_Audit' mangled-name='PySys_Audit' filepath='./Include/cpython/sysmodule.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser_from_file_pointer' mangled-name='_PyPegen_run_parser_from_file_pointer' filepath='Parser/pegen.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser_from_string' mangled-name='_PyPegen_run_parser_from_string' filepath='Parser/pegen.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/myreadline.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_ts' size-in-bits='2240' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='60' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-11' visibility='default' filepath='./Include/cpython/pystate.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-11' visibility='default' filepath='./Include/cpython/pystate.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-12' visibility='default' filepath='./Include/cpython/pystate.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-13' visibility='default' filepath='./Include/cpython/pystate.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='recursion_headroom' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cframe' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-17' visibility='default' filepath='./Include/cpython/pystate.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-18' visibility='default' filepath='./Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-19' visibility='default' filepath='./Include/cpython/pystate.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-20' visibility='default' filepath='./Include/cpython/pystate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-21' visibility='default' filepath='./Include/cpython/pystate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='async_gen_firstiter' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='async_gen_finalizer' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='context' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='context_ver' type-id='type-id-22' visibility='default' filepath='./Include/cpython/pystate.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='id' type-id='type-id-22' visibility='default' filepath='./Include/cpython/pystate.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='root_cframe' type-id='type-id-23' visibility='default' filepath='./Include/cpython/pystate.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-11'/>
    <class-decl name='_is' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-24'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-24' filepath='./Include/pystate.h' line='22' column='1' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-12'/>
    <class-decl name='_frame' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-26'/>
    <typedef-decl name='PyFrameObject' type-id='type-id-26' filepath='./Include/pyframe.h' line='12' column='1' id='type-id-27'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-13'/>
    <class-decl name='_cframe' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='30' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_tracing' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='previous' type-id='type-id-29' visibility='default' filepath='./Include/cpython/pystate.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-29'/>
    <typedef-decl name='CFrame' type-id='type-id-28' filepath='./Include/cpython/pystate.h' line='43' column='1' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-14'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/object.h' line='105' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-31' visibility='default' filepath='./Include/object.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-32' visibility='default' filepath='./Include/object.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-33'/>
    <typedef-decl name='__ssize_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-34'/>
    <typedef-decl name='ssize_t' type-id='type-id-34' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-35'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-35' filepath='./Include/pyport.h' line='107' column='1' id='type-id-31'/>
    <class-decl name='_typeobject' size-in-bits='3264' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='191' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-37' visibility='default' filepath='./Include/cpython/object.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-38' visibility='default' filepath='./Include/cpython/object.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-39' visibility='default' filepath='./Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-40' visibility='default' filepath='./Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-41' visibility='default' filepath='./Include/cpython/object.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-42' visibility='default' filepath='./Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-43' visibility='default' filepath='./Include/cpython/object.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-44' visibility='default' filepath='./Include/cpython/object.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-45' visibility='default' filepath='./Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-46' visibility='default' filepath='./Include/cpython/object.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-47' visibility='default' filepath='./Include/cpython/object.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-42' visibility='default' filepath='./Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-48' visibility='default' filepath='./Include/cpython/object.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-49' visibility='default' filepath='./Include/cpython/object.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-50' visibility='default' filepath='./Include/cpython/object.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-19' visibility='default' filepath='./Include/cpython/object.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-51' visibility='default' filepath='./Include/cpython/object.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-52' visibility='default' filepath='./Include/cpython/object.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-53' visibility='default' filepath='./Include/cpython/object.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-54' visibility='default' filepath='./Include/cpython/object.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-55' visibility='default' filepath='./Include/cpython/object.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-56' visibility='default' filepath='./Include/cpython/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-57' visibility='default' filepath='./Include/cpython/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-58' visibility='default' filepath='./Include/cpython/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-59' visibility='default' filepath='./Include/cpython/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-60' visibility='default' filepath='./Include/cpython/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-61' visibility='default' filepath='./Include/cpython/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-62' visibility='default' filepath='./Include/cpython/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-63' visibility='default' filepath='./Include/cpython/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-64' visibility='default' filepath='./Include/cpython/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-65' visibility='default' filepath='./Include/cpython/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-52' visibility='default' filepath='./Include/cpython/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-38' visibility='default' filepath='./Include/cpython/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-66' visibility='default' filepath='./Include/cpython/object.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-38' visibility='default' filepath='./Include/cpython/object.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-67' visibility='default' filepath='./Include/cpython/object.h' line='272' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-37' visibility='default' filepath='./Include/object.h' line='115' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-69' visibility='default' filepath='./Include/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-31' visibility='default' filepath='./Include/object.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyObject' type-id='type-id-30' filepath='./Include/object.h' line='109' column='1' id='type-id-69'/>
    <typedef-decl name='PyVarObject' type-id='type-id-68' filepath='./Include/object.h' line='118' column='1' id='type-id-37'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-71'/>
    <typedef-decl name='destructor' type-id='type-id-71' filepath='./Include/object.h' line='201' column='1' id='type-id-38'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='getattrfunc' type-id='type-id-74' filepath='./Include/object.h' line='202' column='1' id='type-id-39'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <typedef-decl name='setattrfunc' type-id='type-id-76' filepath='./Include/object.h' line='204' column='1' id='type-id-40'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='./Include/cpython/object.h' line='173' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='am_send' type-id='type-id-80' visibility='default' filepath='./Include/cpython/object.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <typedef-decl name='unaryfunc' type-id='type-id-82' filepath='./Include/object.h' line='184' column='1' id='type-id-79'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-83'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='./Include/object.h' line='635' column='1' id='type-id-84'>
      <underlying-type type-id='type-id-83'/>
      <enumerator name='PYGEN_RETURN' value='0'/>
      <enumerator name='PYGEN_ERROR' value='-1'/>
      <enumerator name='PYGEN_NEXT' value='1'/>
    </enum-decl>
    <typedef-decl name='PySendResult' type-id='type-id-84' filepath='./Include/object.h' line='639' column='1' id='type-id-85'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <typedef-decl name='sendfunc' type-id='type-id-88' filepath='./Include/cpython/object.h' line='171' column='1' id='type-id-80'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-78' filepath='./Include/cpython/object.h' line='178' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-41'/>
    <typedef-decl name='reprfunc' type-id='type-id-82' filepath='./Include/object.h' line='206' column='1' id='type-id-42'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='104' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-47' visibility='default' filepath='./Include/cpython/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-52' visibility='default' filepath='./Include/cpython/object.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-21' visibility='default' filepath='./Include/cpython/object.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-47' visibility='default' filepath='./Include/cpython/object.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <typedef-decl name='binaryfunc' type-id='type-id-93' filepath='./Include/object.h' line='185' column='1' id='type-id-91'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-95'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-95' filepath='./Include/object.h' line='186' column='1' id='type-id-47'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <typedef-decl name='inquiry' type-id='type-id-97' filepath='./Include/object.h' line='187' column='1' id='type-id-52'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-21'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-90' filepath='./Include/cpython/object.h' line='149' column='1' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-43'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-98' visibility='default' filepath='./Include/cpython/object.h' line='151' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-21' visibility='default' filepath='./Include/cpython/object.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-102' visibility='default' filepath='./Include/cpython/object.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-21' visibility='default' filepath='./Include/cpython/object.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-103' visibility='default' filepath='./Include/cpython/object.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <typedef-decl name='lenfunc' type-id='type-id-105' filepath='./Include/object.h' line='188' column='1' id='type-id-100'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-107' filepath='./Include/object.h' line='189' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-109' filepath='./Include/object.h' line='191' column='1' id='type-id-102'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-111'/>
    <typedef-decl name='objobjproc' type-id='type-id-111' filepath='./Include/object.h' line='195' column='1' id='type-id-103'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-99' filepath='./Include/cpython/object.h' line='163' column='1' id='type-id-98'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-44'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-112' visibility='default' filepath='./Include/cpython/object.h' line='165' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-114' visibility='default' filepath='./Include/cpython/object.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='objobjargproc' type-id='type-id-116' filepath='./Include/object.h' line='193' column='1' id='type-id-114'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-113' filepath='./Include/cpython/object.h' line='169' column='1' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-45'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-31' filepath='./Include/pyport.h' line='116' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <typedef-decl name='hashfunc' type-id='type-id-119' filepath='./Include/object.h' line='207' column='1' id='type-id-46'/>
    <typedef-decl name='getattrofunc' type-id='type-id-93' filepath='./Include/object.h' line='203' column='1' id='type-id-48'/>
    <typedef-decl name='setattrofunc' type-id='type-id-116' filepath='./Include/object.h' line='205' column='1' id='type-id-49'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='./Include/cpython/object.h' line='180' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-123' visibility='default' filepath='./Include/cpython/object.h' line='182' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bufferinfo' size-in-bits='640' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='49' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-21' visibility='default' filepath='./Include/cpython/object.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-9' visibility='default' filepath='./Include/cpython/object.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-9' visibility='default' filepath='./Include/cpython/object.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-72' visibility='default' filepath='./Include/cpython/object.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-125' visibility='default' filepath='./Include/cpython/object.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-125' visibility='default' filepath='./Include/cpython/object.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-125' visibility='default' filepath='./Include/cpython/object.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-21' visibility='default' filepath='./Include/cpython/object.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-125'/>
    <typedef-decl name='Py_buffer' type-id='type-id-124' filepath='./Include/cpython/object.h' line='62' column='1' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-129'/>
    <typedef-decl name='getbufferproc' type-id='type-id-129' filepath='./Include/cpython/object.h' line='64' column='1' id='type-id-122'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-131' filepath='./Include/cpython/object.h' line='65' column='1' id='type-id-123'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-121' filepath='./Include/cpython/object.h' line='183' column='1' id='type-id-120'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-50'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <typedef-decl name='visitproc' type-id='type-id-133' filepath='./Include/object.h' line='196' column='1' id='type-id-134'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-136'/>
    <typedef-decl name='traverseproc' type-id='type-id-136' filepath='./Include/object.h' line='197' column='1' id='type-id-51'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-138' filepath='./Include/object.h' line='208' column='1' id='type-id-53'/>
    <typedef-decl name='getiterfunc' type-id='type-id-82' filepath='./Include/object.h' line='209' column='1' id='type-id-54'/>
    <typedef-decl name='iternextfunc' type-id='type-id-82' filepath='./Include/object.h' line='210' column='1' id='type-id-55'/>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/methodobject.h' line='35' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-140' visibility='default' filepath='./Include/methodobject.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-9' visibility='default' filepath='./Include/methodobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCFunction' type-id='type-id-93' filepath='./Include/methodobject.h' line='19' column='1' id='type-id-140'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-56'/>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-57'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/descrobject.h' line='11' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-143' visibility='default' filepath='./Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-144' visibility='default' filepath='./Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-21' visibility='default' filepath='./Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <typedef-decl name='getter' type-id='type-id-146' filepath='./Include/descrobject.h' line='8' column='1' id='type-id-143'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
    <typedef-decl name='setter' type-id='type-id-148' filepath='./Include/descrobject.h' line='9' column='1' id='type-id-144'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-59'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-95' filepath='./Include/object.h' line='211' column='1' id='type-id-60'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-116' filepath='./Include/object.h' line='212' column='1' id='type-id-61'/>
    <typedef-decl name='initproc' type-id='type-id-116' filepath='./Include/object.h' line='213' column='1' id='type-id-62'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-36' filepath='./Include/object.h' line='66' column='1' id='type-id-149'/>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' id='type-id-32'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <typedef-decl name='allocfunc' type-id='type-id-151' filepath='./Include/object.h' line='215' column='1' id='type-id-63'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <typedef-decl name='newfunc' type-id='type-id-153' filepath='./Include/object.h' line='214' column='1' id='type-id-64'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-20'/>
    <typedef-decl name='freefunc' type-id='type-id-20' filepath='./Include/object.h' line='200' column='1' id='type-id-65'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-66'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-155'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <typedef-decl name='size_t' type-id='type-id-19' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-157'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-159'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-159' filepath='./Include/cpython/object.h' line='67' column='1' id='type-id-67'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-161' filepath='./Include/cpython/pystate.h' line='13' column='1' id='type-id-15'/>
    <class-decl name='_err_stackitem' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='45' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_type' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exc_value' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exc_traceback' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='previous_item' type-id='type-id-163' visibility='default' filepath='./Include/cpython/pystate.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-162' filepath='./Include/cpython/pystate.h' line='56' column='1' id='type-id-17'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-18'/>
    <typedef-decl name='__uint64_t' type-id='type-id-19' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-164'/>
    <typedef-decl name='uint64_t' type-id='type-id-164' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-22'/>
    <typedef-decl name='PyThreadState' type-id='type-id-10' filepath='./Include/pystate.h' line='20' column='1' id='type-id-165'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <var-decl name='_PyOS_ReadlineTState' type-id='type-id-166' mangled-name='_PyOS_ReadlineTState' visibility='default' filepath='./Include/cpython/pythonrun.h' line='120' column='1' elf-symbol-id='_PyOS_ReadlineTState'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-168'/>
    <var-decl name='PyOS_InputHook' type-id='type-id-168' mangled-name='PyOS_InputHook' visibility='default' filepath='./Include/pythonrun.h' line='18' column='1' elf-symbol-id='PyOS_InputHook'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-72' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-170' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-171' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-172' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-173' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-174' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-175' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-176' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-177' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-178' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-179' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-171' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-157' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-9' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-180' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='__off_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-172'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-173'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-174'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-175'>
      <subrange length='1' type-id='type-id-19' id='type-id-182'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-183'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-176'/>
    <typedef-decl name='__off64_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-177'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-178'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-179'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-180'>
      <subrange length='20' type-id='type-id-19' id='type-id-186'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-169' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <var-decl name='PyOS_ReadlineFunctionPointer' type-id='type-id-190' mangled-name='PyOS_ReadlineFunctionPointer' visibility='default' filepath='./Include/cpython/pythonrun.h' line='121' column='1' elf-symbol-id='PyOS_ReadlineFunctionPointer'/>
    <function-decl name='PyOS_Readline' mangled-name='PyOS_Readline' filepath='Parser/myreadline.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_Readline'>
      <parameter type-id='type-id-188' name='sys_stdin' filepath='Parser/myreadline.c' line='354' column='1'/>
      <parameter type-id='type-id-188' name='sys_stdout' filepath='Parser/myreadline.c' line='354' column='1'/>
      <parameter type-id='type-id-3' name='prompt' filepath='Parser/myreadline.c' line='354' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='PyEval_SaveThread' mangled-name='PyEval_SaveThread' filepath='./Include/ceval.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThread_acquire_lock' mangled-name='PyThread_acquire_lock' filepath='./Include/pythread.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyEval_RestoreThread' mangled-name='PyEval_RestoreThread' filepath='./Include/ceval.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThread_release_lock' mangled-name='PyThread_release_lock' filepath='./Include/pythread.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_RawFree' mangled-name='PyMem_RawFree' filepath='./Include/cpython/pymem.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThread_allocate_lock' mangled-name='PyThread_allocate_lock' filepath='./Include/pythread.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__fgets_alias' mangled-name='fgets' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='./Include/pyerrors.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='clearerr' mangled-name='clearerr' filepath='/usr/include/stdio.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' filepath='/usr/include/stdio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyOS_InterruptOccurred' mangled-name='_PyOS_InterruptOccurred' filepath='./Include/internal/pycore_pystate.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_RawRealloc' mangled-name='PyMem_RawRealloc' filepath='./Include/cpython/pymem.h' line='7' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-81'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-158'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-73'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-106'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-145'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-152'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-150'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-189'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-72'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-96'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-160'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-110'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-147'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-75'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-108'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-135'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-87'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-85'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-118'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-117'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-104'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-31'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-70'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-130'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-154'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/tokenizer.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_Py_dup' mangled-name='_Py_dup' filepath='./Include/cpython/fileutils.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fdopen' mangled-name='fdopen' filepath='/usr/include/stdio.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromString' mangled-name='PyUnicode_FromString' filepath='./Include/unicodeobject.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_FatalErrorFunc' mangled-name='_Py_FatalErrorFunc' filepath='./Include/cpython/pyerrors.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_Substring' mangled-name='PyUnicode_Substring' filepath='./Include/unicodeobject.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsUTF8String' mangled-name='PyUnicode_AsUTF8String' filepath='./Include/unicodeobject.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_IsPrintable' mangled-name='_PyUnicode_IsPrintable' filepath='./Include/cpython/unicodeobject.h' line='1149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_ScanIdentifier' mangled-name='_PyUnicode_ScanIdentifier' filepath='./Include/cpython/unicodeobject.h' line='1169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='./Include/token.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='./Include/token.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='./Include/token.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_BuildValue_SizeT' mangled-name='_Py_BuildValue_SizeT' filepath='./Include/modsupport.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_Decode' mangled-name='PyUnicode_Decode' filepath='./Include/unicodeobject.h' line='362' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_Readline' mangled-name='PyOS_Readline' filepath='./Include/cpython/pythonrun.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySys_WriteStderr' mangled-name='PySys_WriteStderr' filepath='./Include/sysmodule.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='Py_UniversalNewlineFgets' mangled-name='Py_UniversalNewlineFgets' filepath='./Include/cpython/fileobject.h' line='5' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsUTF8AndSize' mangled-name='PyUnicode_AsUTF8AndSize' filepath='./Include/unicodeobject.h' line='483' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CallNoArgs' mangled-name='PyObject_CallNoArgs' filepath='./Include/abstract.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getc' mangled-name='getc' filepath='/usr/include/stdio.h' line='486' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='ungetc' mangled-name='ungetc' filepath='/usr/include/stdio.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='ftell' mangled-name='ftell' filepath='/usr/include/stdio.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId_SizeT' mangled-name='_PyObject_CallMethodId_SizeT' filepath='./Include/cpython/abstract.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_GetAttrId' mangled-name='_PyObject_GetAttrId' filepath='./Include/cpython/object.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetFromErrnoWithFilename' mangled-name='PyErr_SetFromErrnoWithFilename' filepath='./Include/pyerrors.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' mangled-name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/abstract.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-72' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='Objects/abstract.c' line='2980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-192' name='array' filepath='Objects/abstract.c' line='2980' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='Objects/abstract.c' line='2921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-16' name='self' filepath='Objects/abstract.c' line='2921' column='1'/>
      <return type-id='type-id-192'/>
    </function-decl>
    <function-decl name='PyIter_Send' mangled-name='PyIter_Send' filepath='Objects/abstract.c' line='2887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Send'>
      <parameter type-id='type-id-16' name='iter' filepath='Objects/abstract.c' line='2887' column='1'/>
      <parameter type-id='type-id-16' name='arg' filepath='Objects/abstract.c' line='2887' column='1'/>
      <parameter type-id='type-id-86' name='result' filepath='Objects/abstract.c' line='2887' column='1'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='PyAIter_Check' mangled-name='PyAIter_Check' filepath='Objects/abstract.c' line='2855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyAIter_Check'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='2855' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='Objects/abstract.c' line='2847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='2855' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_GetAIter' mangled-name='PyObject_GetAIter' filepath='Objects/abstract.c' line='2827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetAIter'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2827' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='Objects/abstract.c' line='2794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-16' name='derived' filepath='Objects/abstract.c' line='2794' column='1'/>
      <parameter type-id='type-id-16' name='cls' filepath='Objects/abstract.c' line='2794' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='Objects/abstract.c' line='2788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-16' name='derived' filepath='Objects/abstract.c' line='2794' column='1'/>
      <parameter type-id='type-id-16' name='cls' filepath='Objects/abstract.c' line='2794' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='Objects/abstract.c' line='2780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-16' name='derived' filepath='Objects/abstract.c' line='2780' column='1'/>
      <parameter type-id='type-id-16' name='cls' filepath='Objects/abstract.c' line='2780' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='Objects/abstract.c' line='2695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-16' name='derived' filepath='Objects/abstract.c' line='2780' column='1'/>
      <parameter type-id='type-id-16' name='cls' filepath='Objects/abstract.c' line='2780' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='Objects/abstract.c' line='2473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2473' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='Objects/abstract.c' line='2459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2473' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='Objects/abstract.c' line='2445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2473' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='Objects/abstract.c' line='2399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2399' column='1'/>
      <parameter type-id='type-id-16' name='key' filepath='Objects/abstract.c' line='2399' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='Objects/abstract.c' line='2385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2385' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2385' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='Objects/abstract.c' line='2366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2366' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2366' column='1'/>
      <parameter type-id='type-id-16' name='value' filepath='Objects/abstract.c' line='2366' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='Objects/abstract.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2349' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2349' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='Objects/abstract.c' line='2342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2342' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='Objects/abstract.c' line='2317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2317' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='Objects/abstract.c' line='2310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2310' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='Objects/abstract.c' line='2302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='2302' column='1'/>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2302' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='Objects/abstract.c' line='2296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='2296' column='1'/>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='2296' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='Objects/abstract.c' line='2272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='2302' column='1'/>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2302' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='Objects/abstract.c' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-16' name='seq' filepath='Objects/abstract.c' line='2187' column='1'/>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='2187' column='1'/>
      <parameter type-id='type-id-9' name='operation' filepath='Objects/abstract.c' line='2187' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='Objects/abstract.c' line='2152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='2152' column='1'/>
      <parameter type-id='type-id-3' name='m' filepath='Objects/abstract.c' line='2152' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='Objects/abstract.c' line='2129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='2129' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='Objects/abstract.c' line='2045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='2045' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='Objects/abstract.c' line='2022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='2022' column='1'/>
      <parameter type-id='type-id-31' name='i1' filepath='Objects/abstract.c' line='2022' column='1'/>
      <parameter type-id='type-id-31' name='i2' filepath='Objects/abstract.c' line='2022' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='Objects/abstract.c' line='1999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1999' column='1'/>
      <parameter type-id='type-id-31' name='i1' filepath='Objects/abstract.c' line='1999' column='1'/>
      <parameter type-id='type-id-31' name='i2' filepath='Objects/abstract.c' line='1999' column='1'/>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1999' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='Objects/abstract.c' line='1966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1966' column='1'/>
      <parameter type-id='type-id-31' name='i' filepath='Objects/abstract.c' line='1966' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='Objects/abstract.c' line='1933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1933' column='1'/>
      <parameter type-id='type-id-31' name='i' filepath='Objects/abstract.c' line='1933' column='1'/>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1933' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='Objects/abstract.c' line='1911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1911' column='1'/>
      <parameter type-id='type-id-31' name='i1' filepath='Objects/abstract.c' line='1911' column='1'/>
      <parameter type-id='type-id-31' name='i2' filepath='Objects/abstract.c' line='1911' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='Objects/abstract.c' line='1881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1881' column='1'/>
      <parameter type-id='type-id-31' name='i' filepath='Objects/abstract.c' line='1881' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='Objects/abstract.c' line='1847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1847' column='1'/>
      <parameter type-id='type-id-31' name='count' filepath='Objects/abstract.c' line='1847' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='Objects/abstract.c' line='1818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1818' column='1'/>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1818' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='Objects/abstract.c' line='1787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1787' column='1'/>
      <parameter type-id='type-id-31' name='count' filepath='Objects/abstract.c' line='1787' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='Objects/abstract.c' line='1761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1761' column='1'/>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1761' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='Objects/abstract.c' line='1754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2342' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='Objects/abstract.c' line='1730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2317' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='Objects/abstract.c' line='1721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1721' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='Objects/abstract.c' line='1702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-16' name='n' filepath='Objects/abstract.c' line='1702' column='1'/>
      <parameter type-id='type-id-9' name='base' filepath='Objects/abstract.c' line='1702' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='Objects/abstract.c' line='1641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1641' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='Objects/abstract.c' line='1529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1529' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='Objects/abstract.c' line='1478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-16' name='item' filepath='Objects/abstract.c' line='1478' column='1'/>
      <parameter type-id='type-id-16' name='err' filepath='Objects/abstract.c' line='1478' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='Objects/abstract.c' line='1466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-16' name='item' filepath='Objects/abstract.c' line='1466' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyNumber_Index' mangled-name='_PyNumber_Index' filepath='Objects/abstract.c' line='1419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNumber_Index'>
      <parameter type-id='type-id-16' name='item' filepath='Objects/abstract.c' line='1419' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='Objects/abstract.c' line='1407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check'>
      <parameter type-id='type-id-16' name='s' filepath='Objects/abstract.c' line='1721' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='Objects/abstract.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1389' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='Objects/abstract.c' line='1372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1389' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='Objects/abstract.c' line='1355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1389' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='Objects/abstract.c' line='1338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='1389' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='Objects/abstract.c' line='1328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1328' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1328' column='1'/>
      <parameter type-id='type-id-16' name='z' filepath='Objects/abstract.c' line='1328' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='Objects/abstract.c' line='1321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='Objects/abstract.c' line='1314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='Objects/abstract.c' line='1285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1285' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1285' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='Objects/abstract.c' line='1262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1285' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1285' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='Objects/abstract.c' line='1255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='Objects/abstract.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='Objects/abstract.c' line='1244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='Objects/abstract.c' line='1243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='Objects/abstract.c' line='1242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1328' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1328' column='1'/>
      <parameter type-id='type-id-16' name='z' filepath='Objects/abstract.c' line='1328' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='1138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='1132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='1126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='1107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1285' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1285' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='1069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1069' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1069' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='1066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='1065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='1064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='1063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='1061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='1060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='830' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='830' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='767' column='1'/>
      <parameter type-id='type-id-16' name='format_spec' filepath='Objects/abstract.c' line='767' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-127' name='view' filepath='Objects/abstract.c' line='752' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-127' name='view' filepath='Objects/abstract.c' line='713' column='1'/>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='713' column='1'/>
      <parameter type-id='type-id-21' name='buf' filepath='Objects/abstract.c' line='713' column='1'/>
      <parameter type-id='type-id-31' name='len' filepath='Objects/abstract.c' line='713' column='1'/>
      <parameter type-id='type-id-9' name='readonly' filepath='Objects/abstract.c' line='714' column='1'/>
      <parameter type-id='type-id-9' name='flags' filepath='Objects/abstract.c' line='714' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-9' name='nd' filepath='Objects/abstract.c' line='689' column='1'/>
      <parameter type-id='type-id-125' name='shape' filepath='Objects/abstract.c' line='689' column='1'/>
      <parameter type-id='type-id-125' name='strides' filepath='Objects/abstract.c' line='690' column='1'/>
      <parameter type-id='type-id-9' name='itemsize' filepath='Objects/abstract.c' line='690' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='Objects/abstract.c' line='691' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-16' name='dest' filepath='Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-16' name='src' filepath='Objects/abstract.c' line='618' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-127' name='view' filepath='Objects/abstract.c' line='567' column='1'/>
      <parameter type-id='type-id-21' name='buf' filepath='Objects/abstract.c' line='567' column='1'/>
      <parameter type-id='type-id-31' name='len' filepath='Objects/abstract.c' line='567' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='Objects/abstract.c' line='567' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_SizeFromFormat' mangled-name='PyBuffer_SizeFromFormat' filepath='Objects/abstract.c' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_SizeFromFormat'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/abstract.c' line='525' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <qualified-type-def type-id='type-id-31' const='yes' id='type-id-193'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-194'/>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='Objects/abstract.c' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-9' name='nd' filepath='Objects/abstract.c' line='509' column='1'/>
      <parameter type-id='type-id-125' name='index' filepath='Objects/abstract.c' line='509' column='1'/>
      <parameter type-id='type-id-194' name='shape' filepath='Objects/abstract.c' line='509' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='Objects/abstract.c' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-9' name='nd' filepath='Objects/abstract.c' line='509' column='1'/>
      <parameter type-id='type-id-125' name='index' filepath='Objects/abstract.c' line='509' column='1'/>
      <parameter type-id='type-id-194' name='shape' filepath='Objects/abstract.c' line='509' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-127' name='view' filepath='Objects/abstract.c' line='477' column='1'/>
      <parameter type-id='type-id-125' name='indices' filepath='Objects/abstract.c' line='477' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='378' column='1'/>
      <parameter type-id='type-id-127' name='view' filepath='Objects/abstract.c' line='378' column='1'/>
      <parameter type-id='type-id-9' name='flags' filepath='Objects/abstract.c' line='378' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-195'/>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='349' column='1'/>
      <parameter type-id='type-id-195' name='buffer' filepath='Objects/abstract.c' line='350' column='1'/>
      <parameter type-id='type-id-125' name='buffer_len' filepath='Objects/abstract.c' line='351' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='Objects/abstract.c' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='342' column='1'/>
      <parameter type-id='type-id-195' name='buffer' filepath='Objects/abstract.c' line='343' column='1'/>
      <parameter type-id='type-id-125' name='buffer_len' filepath='Objects/abstract.c' line='344' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-196'/>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='335' column='1'/>
      <parameter type-id='type-id-196' name='buffer' filepath='Objects/abstract.c' line='336' column='1'/>
      <parameter type-id='type-id-125' name='buffer_len' filepath='Objects/abstract.c' line='337' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='300' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='Objects/abstract.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckBuffer'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/abstract.c' line='2855' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='269' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='269' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='235' column='1'/>
      <parameter type-id='type-id-16' name='key' filepath='Objects/abstract.c' line='235' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='201' column='1'/>
      <parameter type-id='type-id-16' name='key' filepath='Objects/abstract.c' line='201' column='1'/>
      <parameter type-id='type-id-16' name='value' filepath='Objects/abstract.c' line='201' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='150' column='1'/>
      <parameter type-id='type-id-16' name='key' filepath='Objects/abstract.c' line='150' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='Objects/abstract.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2310' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2342' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='Objects/abstract.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='53' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='39' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <qualified-type-def type-id='type-id-126' const='yes' id='type-id-197'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-198'/>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-198' name='view' filepath='Objects/abstract.c' line='461' column='1'/>
      <parameter type-id='type-id-1' name='order' filepath='Objects/abstract.c' line='461' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='91' column='1'/>
      <parameter type-id='type-id-31' name='defaultvalue' filepath='Objects/abstract.c' line='91' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='Objects/abstract.c' line='2801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-16' name='o' filepath='Objects/abstract.c' line='2801' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='Objects/abstract.c' line='2871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-16' name='iter' filepath='Objects/abstract.c' line='2871' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='Objects/abstract.c' line='2281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-16' name='seq' filepath='Objects/abstract.c' line='2281' column='1'/>
      <parameter type-id='type-id-16' name='ob' filepath='Objects/abstract.c' line='2281' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyUnicode_FromId' mangled-name='_PyUnicode_FromId' filepath='./Include/cpython/unicodeobject.h' line='1160' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_VectorcallMethod' mangled-name='PyObject_VectorcallMethod' filepath='./Include/cpython/abstract.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyGen_FetchStopIterationValue' mangled-name='_PyGen_FetchStopIterationValue' filepath='./Include/genobject.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_LookupAttrId' mangled-name='_PyObject_LookupAttrId' filepath='./Include/cpython/object.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_SetString' mangled-name='_PyErr_SetString' filepath='./Include/internal/pycore_pyerrors.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyType_IsSubtype' mangled-name='PyType_IsSubtype' filepath='./Include/object.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_CheckRecursiveCall' mangled-name='_Py_CheckRecursiveCall' filepath='./Include/internal/pycore_ceval.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_IsTrue' mangled-name='PyObject_IsTrue' filepath='./Include/object.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_LookupSpecial' mangled-name='_PyObject_LookupSpecial' filepath='./Include/cpython/object.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_ExceptionMatches' mangled-name='_PyErr_ExceptionMatches' filepath='./Include/internal/pycore_pyerrors.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_Format' mangled-name='_PyErr_Format' filepath='./Include/internal/pycore_pyerrors.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyDict_Values' mangled-name='PyDict_Values' filepath='./Include/dictobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyDict_Items' mangled-name='PyDict_Items' filepath='./Include/dictobject.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyDict_Keys' mangled-name='PyDict_Keys' filepath='./Include/dictobject.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_RichCompareBool' mangled-name='PyObject_RichCompareBool' filepath='./Include/object.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_New' mangled-name='PyList_New' filepath='./Include/listobject.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyList_Extend' mangled-name='_PyList_Extend' filepath='./Include/cpython/listobject.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyTuple_Resize' mangled-name='_PyTuple_Resize' filepath='./Include/cpython/tupleobject.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTuple_New' mangled-name='PyTuple_New' filepath='./Include/tupleobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_AsTuple' mangled-name='PyList_AsTuple' filepath='./Include/listobject.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PySlice_FromIndices' mangled-name='_PySlice_FromIndices' filepath='./Include/sliceobject.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromSsize_t' mangled-name='PyLong_FromSsize_t' filepath='./Include/longobject.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_Format' mangled-name='_PyLong_Format' filepath='./Include/longobject.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_WarnFormat' mangled-name='PyErr_WarnFormat' filepath='./Include/warnings.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_AsDouble' mangled-name='PyLong_AsDouble' filepath='./Include/longobject.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyFloat_FromString' mangled-name='PyFloat_FromString' filepath='./Include/floatobject.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_Copy' mangled-name='_PyLong_Copy' filepath='./Include/longintrepr.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_FromBytes' mangled-name='_PyLong_FromBytes' filepath='./Include/longobject.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromUnicodeObject' mangled-name='PyLong_FromUnicodeObject' filepath='./Include/longobject.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_AsSsize_t' mangled-name='PyLong_AsSsize_t' filepath='./Include/longobject.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_GivenExceptionMatches' mangled-name='PyErr_GivenExceptionMatches' filepath='./Include/pyerrors.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_Clear' mangled-name='_PyErr_Clear' filepath='./Include/internal/pycore_pyerrors.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_Sign' mangled-name='_PyLong_Sign' filepath='./Include/longobject.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_New' mangled-name='PyUnicode_New' filepath='./Include/cpython/unicodeobject.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyImport_ImportModule' mangled-name='PyImport_ImportModule' filepath='./Include/import.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='./Include/abstract.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='Py_GenericAlias' mangled-name='Py_GenericAlias' filepath='./Include/genericaliasobject.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySeqIter_New' mangled-name='PySeqIter_New' filepath='./Include/iterobject.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/accu.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-199' visibility='default' filepath='./Include/internal/pycore_accu.h' line='24' column='1' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_accu.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_accu.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyAccu' type-id='type-id-200' filepath='./Include/internal/pycore_accu.h' line='27' column='1' id='type-id-199'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-201'/>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-201' name='acc' filepath='Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-201' name='acc' filepath='Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-201' name='acc' filepath='Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-16' name='unicode' filepath='Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-201' name='acc' filepath='Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-201' name='acc' filepath='Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyUnicode_Join' mangled-name='PyUnicode_Join' filepath='./Include/unicodeobject.h' line='922' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_SetSlice' mangled-name='PyList_SetSlice' filepath='./Include/listobject.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_Append' mangled-name='PyList_Append' filepath='./Include/listobject.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/boolobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyBool_Type' type-id='type-id-149' mangled-name='PyBool_Type' visibility='default' filepath='./Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/longintrepr.h' line='85' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-37' visibility='default' filepath='./Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-203' visibility='default' filepath='./Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-66' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-204'/>
    <typedef-decl name='uint32_t' type-id='type-id-204' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-205'/>
    <typedef-decl name='digit' type-id='type-id-205' filepath='./Include/longintrepr.h' line='45' column='1' id='type-id-206'/>

    <array-type-def dimensions='1' type-id='type-id-206' size-in-bits='32' id='type-id-203'>
      <subrange length='1' type-id='type-id-19' id='type-id-182'/>

    </array-type-def>
    <var-decl name='_Py_FalseStruct' type-id='type-id-202' mangled-name='_Py_FalseStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-202' mangled-name='_Py_TrueStruct' visibility='default' filepath='./Include/boolobject.h' line='19' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-33' name='ok' filepath='Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyArg_NoKwnames' mangled-name='_PyArg_NoKwnames' filepath='./Include/modsupport.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_CheckPositional' mangled-name='_PyArg_CheckPositional' filepath='./Include/modsupport.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_NoKeywords' mangled-name='_PyArg_NoKeywords' filepath='./Include/modsupport.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyArg_UnpackTuple' mangled-name='PyArg_UnpackTuple' filepath='./Include/modsupport.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/src' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='infinite' id='type-id-207'>
      <subrange length='infinite' id='type-id-7'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-207' const='yes' id='type-id-208'/>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='42' column='1'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='43' column='1'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='44' column='1'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='45' column='1'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='46' column='1'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='47' column='1'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='48' column='1'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='49' column='1'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='50' column='1'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='51' column='1'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='52' column='1'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='53' column='1'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='54' column='1'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='62' column='1'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='56' column='1'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='57' column='1'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='58' column='1'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='59' column='1'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='55' column='1'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='60' column='1'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-208' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='61' column='1'/>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='./Include/cpython/abstract.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='./Include/cpython/abstract.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_ParseTuple_SizeT' mangled-name='_PyArg_ParseTuple_SizeT' filepath='./Include/modsupport.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyEval_SliceIndex' mangled-name='_PyEval_SliceIndex' filepath='./Include/cpython/ceval.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='./Include/boolobject.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memchr' mangled-name='memchr' filepath='/usr/include/string.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='./Include/abstract.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='./Include/cpython/abstract.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memrchr' mangled-name='memrchr' filepath='/usr/include/string.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/src' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-209'>
      <subrange length='infinite' id='type-id-7'/>

    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-209' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='./Include/cpython/bytearrayobject.h' line='20' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-149' mangled-name='PyByteArray_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='22' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-149' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='23' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-16' name='a' filepath='Objects/bytearrayobject.c' line='247' column='1'/>
      <parameter type-id='type-id-16' name='b' filepath='Objects/bytearrayobject.c' line='247' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-16' name='self' filepath='Objects/bytearrayobject.c' line='168' column='1'/>
      <parameter type-id='type-id-31' name='requested_size' filepath='Objects/bytearrayobject.c' line='168' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='Objects/bytearrayobject.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-16' name='self' filepath='Objects/bytearrayobject.c' line='159' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-16' name='self' filepath='Objects/bytearrayobject.c' line='150' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='Objects/bytearrayobject.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-3' name='bytes' filepath='Objects/bytearrayobject.c' line='106' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='Objects/bytearrayobject.c' line='106' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-16' name='input' filepath='Objects/bytearrayobject.c' line='80' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='./Include/objimpl.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_endswith' mangled-name='_Py_bytes_endswith' filepath='./Include/internal/pycore_bytes_methods.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_startswith' mangled-name='_Py_bytes_startswith' filepath='./Include/internal/pycore_bytes_methods.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_contains' mangled-name='_Py_bytes_contains' filepath='./Include/internal/pycore_bytes_methods.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_rindex' mangled-name='_Py_bytes_rindex' filepath='./Include/internal/pycore_bytes_methods.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_rfind' mangled-name='_Py_bytes_rfind' filepath='./Include/internal/pycore_bytes_methods.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_index' mangled-name='_Py_bytes_index' filepath='./Include/internal/pycore_bytes_methods.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_count' mangled-name='_Py_bytes_count' filepath='./Include/internal/pycore_bytes_methods.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_find' mangled-name='_Py_bytes_find' filepath='./Include/internal/pycore_bytes_methods.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyNumber_Index' mangled-name='_PyNumber_Index' filepath='./Include/cpython/abstract.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_BadArgument' mangled-name='_PyArg_BadArgument' filepath='./Include/modsupport.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_UnpackKeywords' mangled-name='_PyArg_UnpackKeywords' filepath='./Include/modsupport.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_AsInt' mangled-name='_PyLong_AsInt' filepath='./Include/longobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_swapcase' mangled-name='_Py_bytes_swapcase' filepath='./Include/internal/pycore_bytes_methods.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' mangled-name='_Py_bytes_capitalize' filepath='./Include/internal/pycore_bytes_methods.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' mangled-name='_Py_bytes_title' filepath='./Include/internal/pycore_bytes_methods.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' mangled-name='_Py_bytes_upper' filepath='./Include/internal/pycore_bytes_methods.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' mangled-name='_Py_bytes_lower' filepath='./Include/internal/pycore_bytes_methods.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' mangled-name='_Py_bytes_istitle' filepath='./Include/internal/pycore_bytes_methods.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' mangled-name='_Py_bytes_isupper' filepath='./Include/internal/pycore_bytes_methods.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' mangled-name='_Py_bytes_islower' filepath='./Include/internal/pycore_bytes_methods.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' mangled-name='_Py_bytes_isdigit' filepath='./Include/internal/pycore_bytes_methods.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isascii' mangled-name='_Py_bytes_isascii' filepath='./Include/internal/pycore_bytes_methods.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' mangled-name='_Py_bytes_isalnum' filepath='./Include/internal/pycore_bytes_methods.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' mangled-name='_Py_bytes_isalpha' filepath='./Include/internal/pycore_bytes_methods.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' mangled-name='_Py_bytes_isspace' filepath='./Include/internal/pycore_bytes_methods.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='./Include/abstract.h' line='715' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Print' mangled-name='PyErr_Print' filepath='./Include/pythonrun.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Free' mangled-name='PyObject_Free' filepath='./Include/objimpl.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_GetConfig' mangled-name='_Py_GetConfig' filepath='./Include/cpython/pystate.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_WarnEx' mangled-name='PyErr_WarnEx' filepath='./Include/warnings.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Malloc' mangled-name='PyObject_Malloc' filepath='./Include/objimpl.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_AsLongAndOverflow' mangled-name='PyLong_AsLongAndOverflow' filepath='./Include/longobject.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='./Include/abstract.h' line='417' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySlice_Unpack' mangled-name='PySlice_Unpack' filepath='./Include/sliceobject.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySlice_AdjustIndices' mangled-name='PySlice_AdjustIndices' filepath='./Include/sliceobject.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Realloc' mangled-name='PyObject_Realloc' filepath='./Include/objimpl.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_New' mangled-name='_PyObject_New' filepath='./Include/objimpl.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_ToContiguous' mangled-name='PyBuffer_ToContiguous' filepath='./Include/cpython/abstract.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeLatin1' mangled-name='PyUnicode_DecodeLatin1' filepath='./Include/unicodeobject.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_strhex_with_sep' mangled-name='_Py_strhex_with_sep' filepath='./Include/pystrhex.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromEncodedObject' mangled-name='PyUnicode_FromEncodedObject' filepath='./Include/unicodeobject.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_GetDefaultEncoding' mangled-name='PyUnicode_GetDefaultEncoding' filepath='./Include/unicodeobject.h' line='355' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_Reverse' mangled-name='PyList_Reverse' filepath='./Include/listobject.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='./Include/cpython/abstract.h' line='304' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_maketrans' mangled-name='_Py_bytes_maketrans' filepath='./Include/internal/pycore_bytes_methods.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsEncodedString' mangled-name='PyUnicode_AsEncodedString' filepath='./Include/unicodeobject.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='./Include/abstract.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='./Include/objimpl.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='./Include/cpython/abstract.h' line='321' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='./Include/cpython/bytesobject.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyEval_GetBuiltinId' mangled-name='_PyEval_GetBuiltinId' filepath='./Include/cpython/ceval.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='./Include/cpython/bytesobject.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='./Include/cpython/abstract.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='./Include/abstract.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytesobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyBytes_Type' type-id='type-id-149' mangled-name='PyBytes_Type' visibility='default' filepath='./Include/bytesobject.h' line='27' column='1' elf-symbol-id='PyBytes_Type'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-149' mangled-name='PyBytesIter_Type' visibility='default' filepath='./Include/bytesobject.h' line='28' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <class-decl name='__anonymous_struct__' size-in-bits='4416' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-210' visibility='default' filepath='./Include/cpython/bytesobject.h' line='44' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-16' visibility='default' filepath='./Include/cpython/bytesobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-31' visibility='default' filepath='./Include/cpython/bytesobject.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='min_size' type-id='type-id-31' visibility='default' filepath='./Include/cpython/bytesobject.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_bytearray' type-id='type-id-9' visibility='default' filepath='./Include/cpython/bytesobject.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='overallocate' type-id='type-id-9' visibility='default' filepath='./Include/cpython/bytesobject.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='use_small_buffer' type-id='type-id-9' visibility='default' filepath='./Include/cpython/bytesobject.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='small_buffer' type-id='type-id-212' visibility='default' filepath='./Include/cpython/bytesobject.h' line='64' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='4096' id='type-id-212'>
      <subrange length='512' type-id='type-id-19' id='type-id-213'/>

    </array-type-def>
    <typedef-decl name='_PyBytesWriter' type-id='type-id-211' filepath='./Include/cpython/bytesobject.h' line='65' column='1' id='type-id-210'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-214'/>
    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='Objects/bytesobject.c' line='3504' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3504' column='1'/>
      <parameter type-id='type-id-21' name='ptr' filepath='Objects/bytesobject.c' line='3504' column='1'/>
      <parameter type-id='type-id-21' name='bytes' filepath='Objects/bytesobject.c' line='3505' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='Objects/bytesobject.c' line='3505' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='Objects/bytesobject.c' line='3460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3460' column='1'/>
      <parameter type-id='type-id-21' name='str' filepath='Objects/bytesobject.c' line='3460' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='Objects/bytesobject.c' line='3430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3430' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='Objects/bytesobject.c' line='3430' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='Objects/bytesobject.c' line='3330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3330' column='1'/>
      <parameter type-id='type-id-21' name='str' filepath='Objects/bytesobject.c' line='3330' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='Objects/bytesobject.c' line='3330' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='Objects/bytesobject.c' line='3260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3260' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='Objects/bytesobject.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3249' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='Objects/bytesobject.c' line='3010' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
      <parameter type-id='type-id-86' name='pv' filepath='Objects/bytesobject.c' line='3010' column='1'/>
      <parameter type-id='type-id-31' name='newsize' filepath='Objects/bytesobject.c' line='3010' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='Objects/bytesobject.c' line='2988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
      <parameter type-id='type-id-86' name='pv' filepath='Objects/bytesobject.c' line='2988' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/bytesobject.c' line='2988' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='Objects/bytesobject.c' line='2359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FromHex'>
      <parameter type-id='type-id-16' name='string' filepath='Objects/bytesobject.c' line='2359' column='1'/>
      <parameter type-id='type-id-9' name='use_bytearray' filepath='Objects/bytesobject.c' line='2359' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='Objects/bytesobject.c' line='1840' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
      <parameter type-id='type-id-16' name='v' filepath='Objects/abstract.c' line='1321' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/abstract.c' line='1321' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='Objects/bytesobject.c' line='1292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/bytesobject.c' line='1292' column='1'/>
      <parameter type-id='type-id-9' name='smartquotes' filepath='Objects/bytesobject.c' line='1292' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-215'/>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='Objects/bytesobject.c' line='1246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/bytesobject.c' line='1246' column='1'/>
      <parameter type-id='type-id-215' name='s' filepath='Objects/bytesobject.c' line='1247' column='1'/>
      <parameter type-id='type-id-125' name='len' filepath='Objects/bytesobject.c' line='1248' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='Objects/bytesobject.c' line='1235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsString'>
      <parameter type-id='type-id-16' name='op' filepath='Objects/bytesobject.c' line='1235' column='1'/>
      <return type-id='type-id-72'/>
    </function-decl>
    <function-decl name='PyBytes_Size' mangled-name='PyBytes_Size' filepath='Objects/bytesobject.c' line='1224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Size'>
      <parameter type-id='type-id-16' name='op' filepath='Objects/bytesobject.c' line='1224' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytesobject.c' line='1198' column='1'/>
      <parameter type-id='type-id-31' name='len' filepath='Objects/bytesobject.c' line='1199' column='1'/>
      <parameter type-id='type-id-3' name='errors' filepath='Objects/bytesobject.c' line='1200' column='1'/>
      <parameter type-id='type-id-31' name='_unused_unicode' filepath='Objects/bytesobject.c' line='1201' column='1'/>
      <parameter type-id='type-id-3' name='_unused_recode_encoding' filepath='Objects/bytesobject.c' line='1202' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_DecodeEscape'>
      <parameter type-id='type-id-3' name='s' filepath='Objects/bytesobject.c' line='1090' column='1'/>
      <parameter type-id='type-id-31' name='len' filepath='Objects/bytesobject.c' line='1091' column='1'/>
      <parameter type-id='type-id-3' name='errors' filepath='Objects/bytesobject.c' line='1092' column='1'/>
      <parameter type-id='type-id-196' name='first_invalid_escape' filepath='Objects/bytesobject.c' line='1093' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='Objects/bytesobject.c' line='610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FormatEx'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/bytesobject.c' line='610' column='1'/>
      <parameter type-id='type-id-31' name='format_len' filepath='Objects/bytesobject.c' line='610' column='1'/>
      <parameter type-id='type-id-16' name='args' filepath='Objects/bytesobject.c' line='611' column='1'/>
      <parameter type-id='type-id-9' name='use_bytearray' filepath='Objects/bytesobject.c' line='611' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormat' mangled-name='PyBytes_FromFormat' filepath='Objects/bytesobject.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormat'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/bytesobject.c' line='410' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-21' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-21' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <function-decl name='PyBytes_FromFormatV' mangled-name='PyBytes_FromFormatV' filepath='Objects/bytesobject.c' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormatV'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/bytesobject.c' line='219' column='1'/>
      <parameter type-id='type-id-217' name='vargs' filepath='Objects/bytesobject.c' line='219' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBytes_FromString' mangled-name='PyBytes_FromString' filepath='Objects/bytesobject.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromString'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytesobject.c' line='176' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='Objects/bytesobject.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromStringAndSize'>
      <parameter type-id='type-id-3' name='str' filepath='Objects/bytesobject.c' line='139' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='Objects/bytesobject.c' line='139' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBytes_Concat' mangled-name='PyBytes_Concat' filepath='Objects/bytesobject.c' line='2939' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Concat'>
      <parameter type-id='type-id-86' name='pv' filepath='Objects/bytesobject.c' line='2939' column='1'/>
      <parameter type-id='type-id-16' name='w' filepath='Objects/bytesobject.c' line='2939' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='Objects/bytesobject.c' line='3400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare'>
      <parameter type-id='type-id-214' name='writer' filepath='Objects/bytesobject.c' line='3400' column='1'/>
      <parameter type-id='type-id-21' name='str' filepath='Objects/bytesobject.c' line='3400' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='Objects/bytesobject.c' line='3400' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='Objects/bytesobject.c' line='2818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
      <parameter type-id='type-id-16' name='x' filepath='Objects/bytesobject.c' line='2818' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='./Include/bytearrayobject.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='./Include/bytearrayobject.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_NewReference' mangled-name='_Py_NewReference' filepath='./Include/cpython/object.h' line='5' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_HashBytes' mangled-name='_Py_HashBytes' filepath='./Include/pyhash.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_BadArgument' mangled-name='PyErr_BadArgument' filepath='./Include/pyerrors.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='./Include/abstract.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_FormatBytesWriter' mangled-name='_PyLong_FormatBytesWriter' filepath='./Include/longobject.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTuple_GetItem' mangled-name='PyTuple_GetItem' filepath='./Include/tupleobject.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_FormatLong' mangled-name='_PyUnicode_FormatLong' filepath='./Include/cpython/unicodeobject.h' line='1157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='./Include/abstract.h' line='538' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_ASCII' mangled-name='PyObject_ASCII' filepath='./Include/object.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyFloat_AsDouble' mangled-name='PyFloat_AsDouble' filepath='./Include/floatobject.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_double_to_string' mangled-name='PyOS_double_to_string' filepath='./Include/pystrtod.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin___memmove_chk' mangled-name='__memmove_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Calloc' mangled-name='PyObject_Calloc' filepath='./Include/objimpl.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/call.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_PyStack_AsDict' mangled-name='_PyStack_AsDict' filepath='Objects/call.c' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsDict'>
      <parameter type-id='type-id-156' name='values' filepath='Objects/call.c' line='851' column='1'/>
      <parameter type-id='type-id-16' name='kwnames' filepath='Objects/call.c' line='851' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='Objects/call.c' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs'>
      <parameter type-id='type-id-16' name='callable' filepath='Objects/call.c' line='834' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <class-decl name='_Py_Identifier' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='37' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='string' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='type-id-31' visibility='default' filepath='./Include/cpython/object.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <function-decl name='_PyObject_CallMethodIdObjArgs' mangled-name='_PyObject_CallMethodIdObjArgs' filepath='Objects/call.c' line='803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodIdObjArgs'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='803' column='1'/>
      <parameter type-id='type-id-219' name='name' filepath='Objects/call.c' line='804' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='Objects/call.c' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='778' column='1'/>
      <parameter type-id='type-id-16' name='name' filepath='Objects/call.c' line='778' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_VectorcallMethod' mangled-name='PyObject_VectorcallMethod' filepath='Objects/call.c' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_VectorcallMethod'>
      <parameter type-id='type-id-16' name='name' filepath='Objects/call.c' line='744' column='1'/>
      <parameter type-id='type-id-156' name='args' filepath='Objects/call.c' line='744' column='1'/>
      <parameter type-id='type-id-157' name='nargsf' filepath='Objects/call.c' line='745' column='1'/>
      <parameter type-id='type-id-16' name='kwnames' filepath='Objects/call.c' line='745' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='_Py_Identifier' type-id='type-id-218' filepath='./Include/cpython/object.h' line='42' column='1' id='type-id-220'/>
    <function-decl name='_PyObject_CallMethodId_SizeT' mangled-name='_PyObject_CallMethodId_SizeT' filepath='Objects/call.c' line='660' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId_SizeT'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='660' column='1'/>
      <parameter type-id='type-id-219' name='name' filepath='Objects/call.c' line='660' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='661' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='Objects/call.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='636' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/call.c' line='636' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='637' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId' mangled-name='_PyObject_CallMethodId' filepath='Objects/call.c' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='660' column='1'/>
      <parameter type-id='type-id-219' name='name' filepath='Objects/call.c' line='660' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='661' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyEval_CallMethod' mangled-name='PyEval_CallMethod' filepath='Objects/call.c' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallMethod'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='636' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/call.c' line='636' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='637' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CallMethod' mangled-name='PyObject_CallMethod' filepath='Objects/call.c' line='562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethod'>
      <parameter type-id='type-id-16' name='obj' filepath='Objects/call.c' line='636' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='Objects/call.c' line='636' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='637' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_CallFunction_SizeT' mangled-name='_PyObject_CallFunction_SizeT' filepath='Objects/call.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallFunction_SizeT'>
      <parameter type-id='type-id-16' name='callable' filepath='Objects/call.c' line='533' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='533' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyEval_CallFunction' mangled-name='PyEval_CallFunction' filepath='Objects/call.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallFunction'>
      <parameter type-id='type-id-16' name='callable' filepath='Objects/call.c' line='533' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='533' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CallFunction' mangled-name='PyObject_CallFunction' filepath='Objects/call.c' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunction'>
      <parameter type-id='type-id-16' name='callable' filepath='Objects/call.c' line='533' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='Objects/call.c' line='533' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <class-decl name='_ts' size-in-bits='2240' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='60' column='1' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-11' visibility='default' filepath='./Include/cpython/pystate.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-11' visibility='default' filepath='./Include/cpython/pystate.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-222' visibility='default' filepath='./Include/cpython/pystate.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-223' visibility='default' filepath='./Include/cpython/pystate.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='recursion_headroom' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cframe' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-17' visibility='default' filepath='./Include/cpython/pystate.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-18' visibility='default' filepath='./Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-19' visibility='default' filepath='./Include/cpython/pystate.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-20' visibility='default' filepath='./Include/cpython/pystate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-21' visibility='default' filepath='./Include/cpython/pystate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-9' visibility='default' filepath='./Include/cpython/pystate.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='async_gen_firstiter' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='async_gen_finalizer' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='context' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='context_ver' type-id='type-id-22' visibility='default' filepath='./Include/cpython/pystate.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='id' type-id='type-id-22' visibility='default' filepath='./Include/cpython/pystate.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='root_cframe' type-id='type-id-23' visibility='default' filepath='./Include/cpython/pystate.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_is' size-in-bits='908224' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='220' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-225' visibility='default' filepath='./Include/internal/pycore_interp.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_head' type-id='type-id-11' visibility='default' filepath='./Include/internal/pycore_interp.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='runtime' type-id='type-id-226' visibility='default' filepath='./Include/internal/pycore_interp.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='type-id-227' visibility='default' filepath='./Include/internal/pycore_interp.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='id_refcount' type-id='type-id-227' visibility='default' filepath='./Include/internal/pycore_interp.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='requires_idref' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_interp.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='id_mutex' type-id='type-id-228' visibility='default' filepath='./Include/internal/pycore_interp.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='finalizing' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_interp.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ceval' type-id='type-id-229' visibility='default' filepath='./Include/internal/pycore_interp.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='gc' type-id='type-id-230' visibility='default' filepath='./Include/internal/pycore_interp.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='modules' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='modules_by_index' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='sysdict' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='builtins' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='importlib' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='num_threads' type-id='type-id-33' visibility='default' filepath='./Include/internal/pycore_interp.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='pythread_stacksize' type-id='type-id-157' visibility='default' filepath='./Include/internal/pycore_interp.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='codec_search_path' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='codec_search_cache' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='codec_error_registry' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='codecs_initialized' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_interp.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='config' type-id='type-id-231' visibility='default' filepath='./Include/internal/pycore_interp.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10688'>
        <var-decl name='dlopenflags' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_interp.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10752'>
        <var-decl name='dict' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='builtins_copy' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10880'>
        <var-decl name='import_func' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='eval_frame' type-id='type-id-232' visibility='default' filepath='./Include/internal/pycore_interp.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11008'>
        <var-decl name='co_extra_user_count' type-id='type-id-31' visibility='default' filepath='./Include/internal/pycore_interp.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11072'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-233' visibility='default' filepath='./Include/internal/pycore_interp.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27392'>
        <var-decl name='before_forkers' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27456'>
        <var-decl name='after_forkers_parent' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27520'>
        <var-decl name='after_forkers_child' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27584'>
        <var-decl name='tstate_next_unique_id' type-id='type-id-22' visibility='default' filepath='./Include/internal/pycore_interp.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27648'>
        <var-decl name='warnings' type-id='type-id-234' visibility='default' filepath='./Include/internal/pycore_interp.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='atexit' type-id='type-id-235' visibility='default' filepath='./Include/internal/pycore_interp.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28032'>
        <var-decl name='audit_hooks' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28096'>
        <var-decl name='small_ints' type-id='type-id-236' visibility='default' filepath='./Include/internal/pycore_interp.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44864'>
        <var-decl name='bytes' type-id='type-id-237' visibility='default' filepath='./Include/internal/pycore_interp.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61312'>
        <var-decl name='unicode' type-id='type-id-238' visibility='default' filepath='./Include/internal/pycore_interp.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78208'>
        <var-decl name='float_state' type-id='type-id-239' visibility='default' filepath='./Include/internal/pycore_interp.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78336'>
        <var-decl name='slice_cache' type-id='type-id-240' visibility='default' filepath='./Include/internal/pycore_interp.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78400'>
        <var-decl name='tuple' type-id='type-id-241' visibility='default' filepath='./Include/internal/pycore_interp.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80320'>
        <var-decl name='list' type-id='type-id-242' visibility='default' filepath='./Include/internal/pycore_interp.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85504'>
        <var-decl name='dict_state' type-id='type-id-243' visibility='default' filepath='./Include/internal/pycore_interp.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='95872'>
        <var-decl name='frame' type-id='type-id-244' visibility='default' filepath='./Include/internal/pycore_interp.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96000'>
        <var-decl name='async_gen' type-id='type-id-245' visibility='default' filepath='./Include/internal/pycore_interp.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106368'>
        <var-decl name='context' type-id='type-id-246' visibility='default' filepath='./Include/internal/pycore_interp.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106496'>
        <var-decl name='exc_state' type-id='type-id-247' visibility='default' filepath='./Include/internal/pycore_interp.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106688'>
        <var-decl name='ast' type-id='type-id-248' visibility='default' filepath='./Include/internal/pycore_interp.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='121728'>
        <var-decl name='type_cache' type-id='type-id-249' visibility='default' filepath='./Include/internal/pycore_interp.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='908160'>
        <var-decl name='int_max_str_digits' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_interp.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-225'/>
    <class-decl name='pyruntimestate' size-in-bits='5376' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='61' column='1' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='preinitializing' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='preinitialized' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='core_initialized' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='initialized' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_finalizing' type-id='type-id-251' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='interpreters' type-id='type-id-252' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='xidregistry' type-id='type-id-253' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='main_thread' type-id='type-id-19' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='exitfuncs' type-id='type-id-254' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='nexitfuncs' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='ceval' type-id='type-id-255' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='gilstate' type-id='type-id-256' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='preconfig' type-id='type-id-257' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='open_code_hook' type-id='type-id-258' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='open_code_userdata' type-id='type-id-21' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='audit_hook_head' type-id='type-id-259' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='unicode_ids' type-id='type-id-260' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_address' size-in-bits='64' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='45' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-262' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='atomic_uintptr_t' size-in-bits='64' id='type-id-262'/>
    <typedef-decl name='_Py_atomic_address' type-id='type-id-261' filepath='./Include/internal/pycore_atomic.h' line='47' column='1' id='type-id-251'/>
    <class-decl name='pyinterpreters' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='81' column='1' id='type-id-252'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-228' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-222' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='main' type-id='type-id-222' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_id' type-id='type-id-227' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-21' filepath='./Include/pythread.h' line='5' column='1' id='type-id-228'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-224' filepath='./Include/pystate.h' line='22' column='1' id='type-id-263'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-222'/>
    <typedef-decl name='__int64_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-264'/>
    <typedef-decl name='int64_t' type-id='type-id-264' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-227'/>
    <class-decl name='_xidregistry' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='96' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-228' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-265' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xidregitem' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='328' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cls' type-id='type-id-32' visibility='default' filepath='./Include/internal/pycore_interp.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='getdata' type-id='type-id-267' visibility='default' filepath='./Include/internal/pycore_interp.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-265' visibility='default' filepath='./Include/internal/pycore_interp.h' line='331' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xid' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='255' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-21' visibility='default' filepath='./Include/cpython/pystate.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-227' visibility='default' filepath='./Include/cpython/pystate.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='new_object' type-id='type-id-269' visibility='default' filepath='./Include/cpython/pystate.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='free' type-id='type-id-20' visibility='default' filepath='./Include/cpython/pystate.h' line='291' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <typedef-decl name='crossinterpdatafunc' type-id='type-id-273' filepath='./Include/cpython/pystate.h' line='302' column='1' id='type-id-267'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-265'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>

    <array-type-def dimensions='1' type-id='type-id-275' size-in-bits='2048' id='type-id-254'>
      <subrange length='32' type-id='type-id-19' id='type-id-276'/>

    </array-type-def>
    <class-decl name='_ceval_runtime_state' size-in-bits='1728' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='16' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signals_pending' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gil' type-id='type-id-278' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_int' size-in-bits='32' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='49' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-280' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='atomic_int' size-in-bits='32' id='type-id-280'/>
