<abi-corpus path='libpython3.9.so' soname='libpython3.9.so.1.0'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_AddPyObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_Free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_Malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_New' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_PyRuntime' size='656' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PySet_Dummy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_CallableProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_ProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_RefType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_CheckRecursionLimit' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_EllipsisObject' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_FalseStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HashSecret' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NoneStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NotImplementedStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_Py_gitversion' mangled-name='_Py_gitversion' filepath='./Modules/getbuildinfo.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitversion'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-3'/>
    </function-decl>
    <type-decl name='void' id='type-id-4'/>
    <function-decl name='PyOS_snprintf' mangled-name='PyOS_snprintf' filepath='./Include/pyerrors.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/acceler.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='PyObject_Free' mangled-name='PyObject_Free' filepath='./Include/objimpl.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__printf_chk' mangled-name='__printf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyGrammar_FindDFA' mangled-name='PyGrammar_FindDFA' filepath='./Include/grammar.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Malloc' mangled-name='PyObject_Malloc' filepath='./Include/objimpl.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' filepath='/usr/include/stdlib.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/grammar1.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_Py_FatalErrorFunc' mangled-name='_Py_FatalErrorFunc' filepath='./Include/cpython/pyerrors.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/listnode.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_node' size-in-bits='384' is-struct='yes' visibility='default' filepath='./Include/node.h' line='10' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_type' type-id='type-id-6' visibility='default' filepath='./Include/node.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_str' type-id='type-id-7' visibility='default' filepath='./Include/node.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='n_lineno' type-id='type-id-8' visibility='default' filepath='./Include/node.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='n_col_offset' type-id='type-id-8' visibility='default' filepath='./Include/node.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n_nchildren' type-id='type-id-8' visibility='default' filepath='./Include/node.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_child' type-id='type-id-9' visibility='default' filepath='./Include/node.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_end_lineno' type-id='type-id-8' visibility='default' filepath='./Include/node.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='n_end_col_offset' type-id='type-id-8' visibility='default' filepath='./Include/node.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-6'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-7'/>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-9'/>
    <typedef-decl name='node' type-id='type-id-5' filepath='./Include/node.h' line='19' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-11'/>
    <function-decl name='PyNode_ListTree' mangled-name='PyNode_ListTree' filepath='Parser/listnode.c' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_ListTree'>
      <parameter type-id='type-id-11' name='n' filepath='Parser/listnode.c' line='15' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/node.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='type-id-12'/>
    <typedef-decl name='__ssize_t' type-id='type-id-12' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-13'/>
    <typedef-decl name='ssize_t' type-id='type-id-13' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-14'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-14' filepath='./Include/pyport.h' line='105' column='1' id='type-id-15'/>
    <function-decl name='_PyNode_SizeOf' mangled-name='_PyNode_SizeOf' filepath='Parser/node.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNode_SizeOf'>
      <parameter type-id='type-id-11' name='n' filepath='Parser/node.c' line='155' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyNode_Free' mangled-name='PyNode_Free' filepath='Parser/node.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_Free'>
      <parameter type-id='type-id-11' name='n' filepath='Parser/node.c' line='146' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNode_AddChild' mangled-name='PyNode_AddChild' filepath='Parser/node.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_AddChild'>
      <parameter type-id='type-id-11' name='n1' filepath='Parser/node.c' line='96' column='1'/>
      <parameter type-id='type-id-8' name='type' filepath='Parser/node.c' line='96' column='1'/>
      <parameter type-id='type-id-7' name='str' filepath='Parser/node.c' line='96' column='1'/>
      <parameter type-id='type-id-8' name='lineno' filepath='Parser/node.c' line='96' column='1'/>
      <parameter type-id='type-id-8' name='col_offset' filepath='Parser/node.c' line='96' column='1'/>
      <parameter type-id='type-id-8' name='end_lineno' filepath='Parser/node.c' line='97' column='1'/>
      <parameter type-id='type-id-8' name='end_col_offset' filepath='Parser/node.c' line='97' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNode_New' mangled-name='PyNode_New' filepath='Parser/node.c' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_New'>
      <parameter type-id='type-id-8' name='type' filepath='Parser/node.c' line='8' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Realloc' mangled-name='PyObject_Realloc' filepath='./Include/objimpl.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/parser.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='PyNode_AddChild' mangled-name='PyNode_AddChild' filepath='./Include/node.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNode_Free' mangled-name='PyNode_Free' filepath='./Include/node.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Free' mangled-name='PyMem_Free' filepath='./Include/pymem.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Malloc' mangled-name='PyMem_Malloc' filepath='./Include/pymem.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNode_New' mangled-name='PyNode_New' filepath='./Include/node.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyGrammar_AddAccelerators' mangled-name='PyGrammar_AddAccelerators' filepath='Parser/parser.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/token.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-16'/>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='infinite' id='type-id-17'>
      <subrange length='infinite' id='type-id-18'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-19'/>
    <var-decl name='_PyParser_TokenNames' type-id='type-id-19' mangled-name='_PyParser_TokenNames' visibility='default' filepath='./Include/token.h' line='87' column='1' elf-symbol-id='_PyParser_TokenNames'/>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='Parser/token.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_ThreeChars'>
      <parameter type-id='type-id-8' name='c1' filepath='Parser/token.c' line='193' column='1'/>
      <parameter type-id='type-id-8' name='c2' filepath='Parser/token.c' line='193' column='1'/>
      <parameter type-id='type-id-8' name='c3' filepath='Parser/token.c' line='193' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='Parser/token.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_TwoChars'>
      <parameter type-id='type-id-8' name='c1' filepath='Parser/token.c' line='109' column='1'/>
      <parameter type-id='type-id-8' name='c2' filepath='Parser/token.c' line='109' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='Parser/token.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_OneChar'>
      <parameter type-id='type-id-8' name='c1' filepath='Parser/token.c' line='78' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/pegen/pegen.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_Py_asdl_seq_new' mangled-name='_Py_asdl_seq_new' filepath='./Include/asdl.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Name' mangled-name='_Py_Name' filepath='./Include/Python-ast.h' line='645' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Call' mangled-name='_Py_Call' filepath='./Include/Python-ast.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Dealloc' mangled-name='_Py_Dealloc' filepath='./Include/object.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyArena_AddPyObject' mangled-name='PyArena_AddPyObject' filepath='./Include/pyarena.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeUTF8' mangled-name='PyUnicode_DecodeUTF8' filepath='./Include/unicodeobject.h' line='451' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_TypeIgnore' mangled-name='_Py_TypeIgnore' filepath='./Include/Python-ast.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Module' mangled-name='_Py_Module' filepath='./Include/Python-ast.h' line='461' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_ConcatFstring' mangled-name='_PyPegen_FstringParser_ConcatFstring' filepath='Parser/pegen/parse_string.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_parsestr' mangled-name='_PyPegen_parsestr' filepath='Parser/pegen/parse_string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_ConcatAndDel' mangled-name='_PyPegen_FstringParser_ConcatAndDel' filepath='Parser/pegen/parse_string.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='./Include/bytesobject.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_Init' mangled-name='_PyPegen_FstringParser_Init' filepath='Parser/pegen/parse_string.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Constant' mangled-name='_Py_Constant' filepath='./Include/Python-ast.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_Dealloc' mangled-name='_PyPegen_FstringParser_Dealloc' filepath='Parser/pegen/parse_string.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Occurred' mangled-name='PyErr_Occurred' filepath='./Include/pyerrors.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_FstringParser_Finish' mangled-name='_PyPegen_FstringParser_Finish' filepath='Parser/pegen/parse_string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyArena_Malloc' mangled-name='PyArena_Malloc' filepath='./Include/pyarena.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_ClassDef' mangled-name='_Py_ClassDef' filepath='./Include/Python-ast.h' line='480' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_FunctionDef' mangled-name='_Py_FunctionDef' filepath='./Include/Python-ast.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_AsyncFunctionDef' mangled-name='_Py_AsyncFunctionDef' filepath='./Include/Python-ast.h' line='474' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_arguments' mangled-name='_Py_arguments' filepath='./Include/Python-ast.h' line='669' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='./Include/bytesobject.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_arg' mangled-name='_Py_arg' filepath='./Include/Python-ast.h' line='674' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_List' mangled-name='_Py_List' filepath='./Include/Python-ast.h' line='649' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Tuple' mangled-name='_Py_Tuple' filepath='./Include/Python-ast.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Attribute' mangled-name='_Py_Attribute' filepath='./Include/Python-ast.h' line='633' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Subscript' mangled-name='_Py_Subscript' filepath='./Include/Python-ast.h' line='637' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Starred' mangled-name='_Py_Starred' filepath='./Include/Python-ast.h' line='641' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_asdl_int_seq_new' mangled-name='_Py_asdl_int_seq_new' filepath='./Include/asdl.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_InternFromString' mangled-name='PyUnicode_InternFromString' filepath='./Include/unicodeobject.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_alias' mangled-name='_Py_alias' filepath='./Include/Python-ast.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_Ready' mangled-name='_PyUnicode_Ready' filepath='./Include/cpython/unicodeobject.h' line='472' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsUTF8' mangled-name='PyUnicode_AsUTF8' filepath='./Include/cpython/unicodeobject.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='./Include/bytesobject.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_InternInPlace' mangled-name='PyUnicode_InternInPlace' filepath='./Include/unicodeobject.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromUTF8' mangled-name='PyTokenizer_FromUTF8' filepath='Parser/pegen/../tokenizer.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_Free' mangled-name='PyTokenizer_Free' filepath='Parser/pegen/../tokenizer.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromString' mangled-name='PyTokenizer_FromString' filepath='Parser/pegen/../tokenizer.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromFile' mangled-name='PyTokenizer_FromFile' filepath='Parser/pegen/../tokenizer.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetFromErrnoWithFilename' mangled-name='PyErr_SetFromErrnoWithFilename' filepath='./Include/pyerrors.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Calloc' mangled-name='PyMem_Calloc' filepath='./Include/cpython/pymem.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_NoMemory' mangled-name='PyErr_NoMemory' filepath='./Include/pyerrors.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_strtol' mangled-name='PyOS_strtol' filepath='./Include/longobject.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromLong' mangled-name='PyLong_FromLong' filepath='./Include/longobject.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_strtoul' mangled-name='PyOS_strtoul' filepath='./Include/longobject.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_string_to_double' mangled-name='PyOS_string_to_double' filepath='./Include/pystrtod.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyComplex_FromCComplex' mangled-name='PyComplex_FromCComplex' filepath='./Include/complexobject.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromString' mangled-name='PyLong_FromString' filepath='./Include/longobject.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyFloat_FromDouble' mangled-name='PyFloat_FromDouble' filepath='./Include/floatobject.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_SetItem' mangled-name='PyList_SetItem' filepath='./Include/listobject.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_New' mangled-name='PyList_New' filepath='./Include/listobject.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_Realloc' mangled-name='PyMem_Realloc' filepath='./Include/pymem.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_Get' mangled-name='PyTokenizer_Get' filepath='Parser/pegen/../tokenizer.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strtok' mangled-name='strtok' filepath='/usr/include/string.h' line='336' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetNone' mangled-name='PyErr_SetNone' filepath='./Include/pyerrors.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_RawMalloc' mangled-name='PyMem_RawMalloc' filepath='./Include/cpython/pymem.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromFormatV' mangled-name='PyUnicode_FromFormatV' filepath='./Include/unicodeobject.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='Py_BuildValue' mangled-name='Py_BuildValue' filepath='./Include/modsupport.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTuple_Pack' mangled-name='PyTuple_Pack' filepath='./Include/tupleobject.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetObject' mangled-name='PyErr_SetObject' filepath='./Include/pyerrors.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_RawFree' mangled-name='PyMem_RawFree' filepath='./Include/cpython/pymem.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_ProgramTextObject' mangled-name='PyErr_ProgramTextObject' filepath='./Include/cpython/pyerrors.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_ExceptionMatches' mangled-name='PyErr_ExceptionMatches' filepath='./Include/pyerrors.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Fetch' mangled-name='PyErr_Fetch' filepath='./Include/pyerrors.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Str' mangled-name='PyObject_Str' filepath='./Include/object.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Clear' mangled-name='PyErr_Clear' filepath='./Include/pyerrors.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Format' mangled-name='PyErr_Format' filepath='./Include/pyerrors.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyImport_ImportModuleNoBlock' mangled-name='PyImport_ImportModuleNoBlock' filepath='./Include/import.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetAttrString' mangled-name='PyObject_GetAttrString' filepath='./Include/object.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_MakeTpCall' mangled-name='_PyObject_MakeTpCall' filepath='./Include/cpython/abstract.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_CheckFunctionResult' mangled-name='_Py_CheckFunctionResult' filepath='./Include/cpython/abstract.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThreadState_Get' mangled-name='PyThreadState_Get' filepath='./Include/pystate.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyType_Name' mangled-name='_PyType_Name' filepath='./Include/cpython/object.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_parse' mangled-name='_PyPegen_parse' filepath='Parser/pegen/pegen.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/pegen/parse.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_PyPegen_expect_token' mangled-name='_PyPegen_expect_token' filepath='Parser/pegen/pegen.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_singleton_seq' mangled-name='_PyPegen_singleton_seq' filepath='Parser/pegen/pegen.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_insert_memo' mangled-name='_PyPegen_insert_memo' filepath='Parser/pegen/pegen.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_insert_in_front' mangled-name='_PyPegen_seq_insert_in_front' filepath='Parser/pegen/pegen.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_append_to_end' mangled-name='_PyPegen_seq_append_to_end' filepath='Parser/pegen/pegen.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_FunctionType' mangled-name='_Py_FunctionType' filepath='./Include/Python-ast.h' line='467' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_make_module' mangled-name='_PyPegen_make_module' filepath='Parser/pegen/pegen.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_function_def_decorators' mangled-name='_PyPegen_function_def_decorators' filepath='Parser/pegen/pegen.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_lookahead' mangled-name='_PyPegen_lookahead' filepath='Parser/pegen/pegen.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_If' mangled-name='_Py_If' filepath='./Include/Python-ast.h' line='515' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_last_nonnwhitespace_token' mangled-name='_PyPegen_get_last_nonnwhitespace_token' filepath='Parser/pegen/pegen.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_fill_token' mangled-name='_PyPegen_fill_token' filepath='Parser/pegen/pegen.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_lookahead_with_int' mangled-name='_PyPegen_lookahead_with_int' filepath='Parser/pegen/pegen.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_class_def_decorators' mangled-name='_PyPegen_class_def_decorators' filepath='Parser/pegen/pegen.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_new_type_comment' mangled-name='_PyPegen_new_type_comment' filepath='Parser/pegen/pegen.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_For' mangled-name='_Py_For' filepath='./Include/Python-ast.h' line='503' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_raise_error' mangled-name='_PyPegen_raise_error' filepath='Parser/pegen/pegen.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_AsyncFor' mangled-name='_Py_AsyncFor' filepath='./Include/Python-ast.h' line='507' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_While' mangled-name='_Py_While' filepath='./Include/Python-ast.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Pass' mangled-name='_Py_Pass' filepath='./Include/Python-ast.h' line='553' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_interactive_exit' mangled-name='_PyPegen_interactive_exit' filepath='Parser/pegen/pegen.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Interactive' mangled-name='_Py_Interactive' filepath='./Include/Python-ast.h' line='463' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Expression' mangled-name='_Py_Expression' filepath='./Include/Python-ast.h' line='465' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_name_token' mangled-name='_PyPegen_name_token' filepath='Parser/pegen/pegen.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_dummy_name' mangled-name='_PyPegen_dummy_name' filepath='Parser/pegen/pegen.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_comprehension' mangled-name='_Py_comprehension' filepath='./Include/Python-ast.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_set_expr_context' mangled-name='_PyPegen_set_expr_context' filepath='Parser/pegen/pegen.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_NamedExpr' mangled-name='_Py_NamedExpr' filepath='./Include/Python-ast.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_expr_name' mangled-name='_PyPegen_get_expr_name' filepath='Parser/pegen/pegen.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_invalid_target' mangled-name='_PyPegen_get_invalid_target' filepath='Parser/pegen/pegen.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_update_memo' mangled-name='_PyPegen_update_memo' filepath='Parser/pegen/pegen.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_is_memoized' mangled-name='_PyPegen_is_memoized' filepath='Parser/pegen/pegen.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_keyword' mangled-name='_Py_keyword' filepath='./Include/Python-ast.h' line='678' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_keyword_or_starred' mangled-name='_PyPegen_keyword_or_starred' filepath='Parser/pegen/pegen.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_join_sequences' mangled-name='_PyPegen_join_sequences' filepath='Parser/pegen/pegen.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_collect_call_seqs' mangled-name='_PyPegen_collect_call_seqs' filepath='Parser/pegen/pegen.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_delete_starred_exprs' mangled-name='_PyPegen_seq_delete_starred_exprs' filepath='Parser/pegen/pegen.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_extract_starred_exprs' mangled-name='_PyPegen_seq_extract_starred_exprs' filepath='Parser/pegen/pegen.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_nonparen_genexp_in_call' mangled-name='_PyPegen_nonparen_genexp_in_call' filepath='Parser/pegen/pegen.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_arguments_parsing_error' mangled-name='_PyPegen_arguments_parsing_error' filepath='Parser/pegen/pegen.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_YieldFrom' mangled-name='_Py_YieldFrom' filepath='./Include/Python-ast.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Yield' mangled-name='_Py_Yield' filepath='./Include/Python-ast.h' line='609' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_key_value_pair' mangled-name='_PyPegen_key_value_pair' filepath='Parser/pegen/pegen.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_GeneratorExp' mangled-name='_Py_GeneratorExp' filepath='./Include/Python-ast.h' line='602' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_string_token' mangled-name='_PyPegen_string_token' filepath='Parser/pegen/pegen.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_concatenate_strings' mangled-name='_PyPegen_concatenate_strings' filepath='Parser/pegen/pegen.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_number_token' mangled-name='_PyPegen_number_token' filepath='Parser/pegen/pegen.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_ListComp' mangled-name='_Py_ListComp' filepath='./Include/Python-ast.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_SetComp' mangled-name='_Py_SetComp' filepath='./Include/Python-ast.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_values' mangled-name='_PyPegen_get_values' filepath='Parser/pegen/pegen.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_keys' mangled-name='_PyPegen_get_keys' filepath='Parser/pegen/pegen.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Dict' mangled-name='_Py_Dict' filepath='./Include/Python-ast.h' line='583' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Set' mangled-name='_Py_Set' filepath='./Include/Python-ast.h' line='587' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_DictComp' mangled-name='_Py_DictComp' filepath='./Include/Python-ast.h' line='598' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Slice' mangled-name='_Py_Slice' filepath='./Include/Python-ast.h' line='657' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Await' mangled-name='_Py_Await' filepath='./Include/Python-ast.h' line='606' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_UnaryOp' mangled-name='_Py_UnaryOp' filepath='./Include/Python-ast.h' line='573' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_BinOp' mangled-name='_Py_BinOp' filepath='./Include/Python-ast.h' line='569' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_cmpop_expr_pair' mangled-name='_PyPegen_cmpop_expr_pair' filepath='Parser/pegen/pegen.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_check_barry_as_flufl' mangled-name='_PyPegen_check_barry_as_flufl' filepath='Parser/pegen/pegen.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_exprs' mangled-name='_PyPegen_get_exprs' filepath='Parser/pegen/pegen.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_get_cmpops' mangled-name='_PyPegen_get_cmpops' filepath='Parser/pegen/pegen.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Compare' mangled-name='_Py_Compare' filepath='./Include/Python-ast.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_BoolOp' mangled-name='_Py_BoolOp' filepath='./Include/Python-ast.h' line='562' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_name_default_pair' mangled-name='_PyPegen_name_default_pair' filepath='Parser/pegen/pegen.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_star_etc' mangled-name='_PyPegen_star_etc' filepath='Parser/pegen/pegen.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_slash_with_default' mangled-name='_PyPegen_slash_with_default' filepath='Parser/pegen/pegen.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_IfExp' mangled-name='_Py_IfExp' filepath='./Include/Python-ast.h' line='579' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_make_arguments' mangled-name='_PyPegen_make_arguments' filepath='Parser/pegen/pegen.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Lambda' mangled-name='_Py_Lambda' filepath='./Include/Python-ast.h' line='576' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_empty_arguments' mangled-name='_PyPegen_empty_arguments' filepath='Parser/pegen/pegen.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_add_type_comment_to_arg' mangled-name='_PyPegen_add_type_comment_to_arg' filepath='Parser/pegen/pegen.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Try' mangled-name='_Py_Try' filepath='./Include/Python-ast.h' line='530' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_ExceptHandler' mangled-name='_Py_ExceptHandler' filepath='./Include/Python-ast.h' line='664' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_withitem' mangled-name='_Py_withitem' filepath='./Include/Python-ast.h' line='684' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_With' mangled-name='_Py_With' filepath='./Include/Python-ast.h' line='519' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_AsyncWith' mangled-name='_Py_AsyncWith' filepath='./Include/Python-ast.h' line='523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_join_names_with_dot' mangled-name='_PyPegen_join_names_with_dot' filepath='Parser/pegen/pegen.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_alias_for_star' mangled-name='_PyPegen_alias_for_star' filepath='Parser/pegen/pegen.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_count_dots' mangled-name='_PyPegen_seq_count_dots' filepath='Parser/pegen/pegen.h' line='240' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_ImportFrom' mangled-name='_Py_ImportFrom' filepath='./Include/Python-ast.h' line='540' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_augoperator' mangled-name='_PyPegen_augoperator' filepath='Parser/pegen/pegen.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_AnnAssign' mangled-name='_Py_AnnAssign' filepath='./Include/Python-ast.h' line='499' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Assign' mangled-name='_Py_Assign' filepath='./Include/Python-ast.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_AugAssign' mangled-name='_Py_AugAssign' filepath='./Include/Python-ast.h' line='495' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Expr' mangled-name='_Py_Expr' filepath='./Include/Python-ast.h' line='550' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Break' mangled-name='_Py_Break' filepath='./Include/Python-ast.h' line='556' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Continue' mangled-name='_Py_Continue' filepath='./Include/Python-ast.h' line='559' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Return' mangled-name='_Py_Return' filepath='./Include/Python-ast.h' line='485' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Raise' mangled-name='_Py_Raise' filepath='./Include/Python-ast.h' line='527' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Import' mangled-name='_Py_Import' filepath='./Include/Python-ast.h' line='537' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Delete' mangled-name='_Py_Delete' filepath='./Include/Python-ast.h' line='488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Assert' mangled-name='_Py_Assert' filepath='./Include/Python-ast.h' line='534' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_map_names_to_ids' mangled-name='_PyPegen_map_names_to_ids' filepath='Parser/pegen/pegen.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Global' mangled-name='_Py_Global' filepath='./Include/Python-ast.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_Nonlocal' mangled-name='_Py_Nonlocal' filepath='./Include/Python-ast.h' line='547' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_seq_flatten' mangled-name='_PyPegen_seq_flatten' filepath='Parser/pegen/pegen.h' line='238' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_raise_error_known_location' mangled-name='_PyPegen_raise_error_known_location' filepath='Parser/pegen/pegen.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/pegen/parse_string.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_Py_JoinedStr' mangled-name='_Py_JoinedStr' filepath='./Include/Python-ast.h' line='627' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromStringAndSize' mangled-name='PyUnicode_FromStringAndSize' filepath='./Include/unicodeobject.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeUTF8Stateful' mangled-name='PyUnicode_DecodeUTF8Stateful' filepath='./Include/unicodeobject.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AppendAndDel' mangled-name='PyUnicode_AppendAndDel' filepath='./Include/unicodeobject.h' line='815' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_Parser_New' mangled-name='_PyPegen_Parser_New' filepath='Parser/pegen/pegen.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser' mangled-name='_PyPegen_run_parser' filepath='Parser/pegen/pegen.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_Parser_Free' mangled-name='_PyPegen_Parser_Free' filepath='Parser/pegen/pegen.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_FormattedValue' mangled-name='_Py_FormattedValue' filepath='./Include/Python-ast.h' line='623' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='./Include/cpython/bytesobject.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyErr_BadInternalCall' mangled-name='_PyErr_BadInternalCall' filepath='./Include/pyerrors.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_SetString' mangled-name='PyErr_SetString' filepath='./Include/pyerrors.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin___sprintf_chk' mangled-name='__sprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_DecodeUnicodeEscapeInternal' mangled-name='_PyUnicode_DecodeUnicodeEscapeInternal' filepath='./Include/cpython/unicodeobject.h' line='869' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromFormat' mangled-name='PyUnicode_FromFormat' filepath='./Include/unicodeobject.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_WarnExplicitObject' mangled-name='PyErr_WarnExplicitObject' filepath='./Include/warnings.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_new_identifier' mangled-name='_PyPegen_new_identifier' filepath='Parser/pegen/pegen.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/pegen/peg_api.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_mod' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/Python-ast.h' line='52' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-21' visibility='default' filepath='./Include/Python-ast.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='v' type-id='type-id-22' visibility='default' filepath='./Include/Python-ast.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-23'/>
    <enum-decl name='_mod_kind' filepath='./Include/Python-ast.h' line='50' column='1' id='type-id-21'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='Module_kind' value='1'/>
      <enumerator name='Interactive_kind' value='2'/>
      <enumerator name='Expression_kind' value='3'/>
      <enumerator name='FunctionType_kind' value='4'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='54' column='1' id='type-id-22'>
      <data-member access='private'>
        <var-decl name='Module' type-id='type-id-24' visibility='default' filepath='./Include/Python-ast.h' line='58' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Interactive' type-id='type-id-25' visibility='default' filepath='./Include/Python-ast.h' line='62' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Expression' type-id='type-id-26' visibility='default' filepath='./Include/Python-ast.h' line='66' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='FunctionType' type-id='type-id-27' visibility='default' filepath='./Include/Python-ast.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='55' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='body' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type_ignores' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-29' visibility='default' filepath='./Include/asdl.h' line='18' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-15' visibility='default' filepath='./Include/asdl.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='elements' type-id='type-id-31' visibility='default' filepath='./Include/asdl.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-32'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-33'/>

    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='64' id='type-id-31'>
      <subrange length='1' type-id='type-id-33' id='type-id-34'/>

    </array-type-def>
    <typedef-decl name='asdl_seq' type-id='type-id-30' filepath='./Include/asdl.h' line='21' column='1' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-28'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='60' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='body' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='64' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='body' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_expr' size-in-bits='384' is-struct='yes' visibility='default' filepath='./Include/Python-ast.h' line='234' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-37' visibility='default' filepath='./Include/Python-ast.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='v' type-id='type-id-38' visibility='default' filepath='./Include/Python-ast.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lineno' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='col_offset' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='end_lineno' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='end_col_offset' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='380' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='_expr_kind' filepath='./Include/Python-ast.h' line='226' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='BoolOp_kind' value='1'/>
      <enumerator name='NamedExpr_kind' value='2'/>
      <enumerator name='BinOp_kind' value='3'/>
      <enumerator name='UnaryOp_kind' value='4'/>
      <enumerator name='Lambda_kind' value='5'/>
      <enumerator name='IfExp_kind' value='6'/>
      <enumerator name='Dict_kind' value='7'/>
      <enumerator name='Set_kind' value='8'/>
      <enumerator name='ListComp_kind' value='9'/>
      <enumerator name='SetComp_kind' value='10'/>
      <enumerator name='DictComp_kind' value='11'/>
      <enumerator name='GeneratorExp_kind' value='12'/>
      <enumerator name='Await_kind' value='13'/>
      <enumerator name='Yield_kind' value='14'/>
      <enumerator name='YieldFrom_kind' value='15'/>
      <enumerator name='Compare_kind' value='16'/>
      <enumerator name='Call_kind' value='17'/>
      <enumerator name='FormattedValue_kind' value='18'/>
      <enumerator name='JoinedStr_kind' value='19'/>
      <enumerator name='Constant_kind' value='20'/>
      <enumerator name='Attribute_kind' value='21'/>
      <enumerator name='Subscript_kind' value='22'/>
      <enumerator name='Starred_kind' value='23'/>
      <enumerator name='Name_kind' value='24'/>
      <enumerator name='List_kind' value='25'/>
      <enumerator name='Tuple_kind' value='26'/>
      <enumerator name='Slice_kind' value='27'/>
    </enum-decl>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='236' column='1' id='type-id-38'>
      <data-member access='private'>
        <var-decl name='BoolOp' type-id='type-id-39' visibility='default' filepath='./Include/Python-ast.h' line='240' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='NamedExpr' type-id='type-id-40' visibility='default' filepath='./Include/Python-ast.h' line='245' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='BinOp' type-id='type-id-41' visibility='default' filepath='./Include/Python-ast.h' line='251' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='UnaryOp' type-id='type-id-42' visibility='default' filepath='./Include/Python-ast.h' line='256' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Lambda' type-id='type-id-43' visibility='default' filepath='./Include/Python-ast.h' line='261' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='IfExp' type-id='type-id-44' visibility='default' filepath='./Include/Python-ast.h' line='267' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Dict' type-id='type-id-45' visibility='default' filepath='./Include/Python-ast.h' line='272' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Set' type-id='type-id-46' visibility='default' filepath='./Include/Python-ast.h' line='276' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='ListComp' type-id='type-id-47' visibility='default' filepath='./Include/Python-ast.h' line='281' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='SetComp' type-id='type-id-47' visibility='default' filepath='./Include/Python-ast.h' line='286' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='DictComp' type-id='type-id-48' visibility='default' filepath='./Include/Python-ast.h' line='292' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='GeneratorExp' type-id='type-id-47' visibility='default' filepath='./Include/Python-ast.h' line='297' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Await' type-id='type-id-49' visibility='default' filepath='./Include/Python-ast.h' line='301' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Yield' type-id='type-id-49' visibility='default' filepath='./Include/Python-ast.h' line='305' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='YieldFrom' type-id='type-id-49' visibility='default' filepath='./Include/Python-ast.h' line='309' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Compare' type-id='type-id-50' visibility='default' filepath='./Include/Python-ast.h' line='315' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Call' type-id='type-id-51' visibility='default' filepath='./Include/Python-ast.h' line='321' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='FormattedValue' type-id='type-id-52' visibility='default' filepath='./Include/Python-ast.h' line='327' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='JoinedStr' type-id='type-id-53' visibility='default' filepath='./Include/Python-ast.h' line='331' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Constant' type-id='type-id-54' visibility='default' filepath='./Include/Python-ast.h' line='336' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Attribute' type-id='type-id-55' visibility='default' filepath='./Include/Python-ast.h' line='342' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Subscript' type-id='type-id-56' visibility='default' filepath='./Include/Python-ast.h' line='348' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Starred' type-id='type-id-57' visibility='default' filepath='./Include/Python-ast.h' line='353' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Name' type-id='type-id-58' visibility='default' filepath='./Include/Python-ast.h' line='358' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='List' type-id='type-id-59' visibility='default' filepath='./Include/Python-ast.h' line='363' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Tuple' type-id='type-id-59' visibility='default' filepath='./Include/Python-ast.h' line='368' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='Slice' type-id='type-id-60' visibility='default' filepath='./Include/Python-ast.h' line='374' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='237' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-61' visibility='default' filepath='./Include/Python-ast.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='values' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='_boolop' filepath='./Include/Python-ast.h' line='22' column='1' id='type-id-62'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='And' value='1'/>
      <enumerator name='Or' value='2'/>
    </enum-decl>
    <typedef-decl name='boolop_ty' type-id='type-id-62' filepath='./Include/Python-ast.h' line='22' column='1' id='type-id-61'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='242' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='target' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='244' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-63'/>
    <typedef-decl name='expr_ty' type-id='type-id-63' filepath='./Include/Python-ast.h' line='18' column='1' id='type-id-35'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='247' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='op' type-id='type-id-64' visibility='default' filepath='./Include/Python-ast.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='right' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='_operator' filepath='./Include/Python-ast.h' line='24' column='1' id='type-id-65'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='Add' value='1'/>
      <enumerator name='Sub' value='2'/>
      <enumerator name='Mult' value='3'/>
      <enumerator name='MatMult' value='4'/>
      <enumerator name='Div' value='5'/>
      <enumerator name='Mod' value='6'/>
      <enumerator name='Pow' value='7'/>
      <enumerator name='LShift' value='8'/>
      <enumerator name='RShift' value='9'/>
      <enumerator name='BitOr' value='10'/>
      <enumerator name='BitXor' value='11'/>
      <enumerator name='BitAnd' value='12'/>
      <enumerator name='FloorDiv' value='13'/>
    </enum-decl>
    <typedef-decl name='operator_ty' type-id='type-id-65' filepath='./Include/Python-ast.h' line='26' column='1' id='type-id-64'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='253' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-66' visibility='default' filepath='./Include/Python-ast.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='operand' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='_unaryop' filepath='./Include/Python-ast.h' line='28' column='1' id='type-id-67'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='Invert' value='1'/>
      <enumerator name='Not' value='2'/>
      <enumerator name='UAdd' value='3'/>
      <enumerator name='USub' value='4'/>
    </enum-decl>
    <typedef-decl name='unaryop_ty' type-id='type-id-67' filepath='./Include/Python-ast.h' line='28' column='1' id='type-id-66'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='258' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='args' type-id='type-id-68' visibility='default' filepath='./Include/Python-ast.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='body' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='260' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_arguments' size-in-bits='448' is-struct='yes' visibility='default' filepath='./Include/Python-ast.h' line='407' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='posonlyargs' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vararg' type-id='type-id-70' visibility='default' filepath='./Include/Python-ast.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='kwonlyargs' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='kw_defaults' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='kwarg' type-id='type-id-70' visibility='default' filepath='./Include/Python-ast.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='defaults' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_arg' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/Python-ast.h' line='417' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arg' type-id='type-id-72' visibility='default' filepath='./Include/Python-ast.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='annotation' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='type_comment' type-id='type-id-73' visibility='default' filepath='./Include/Python-ast.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lineno' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='col_offset' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='end_lineno' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='end_col_offset' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='424' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/object.h' line='105' column='1' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-15' visibility='default' filepath='./Include/object.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-75' visibility='default' filepath='./Include/object.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' size-in-bits='3264' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='193' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-80' visibility='default' filepath='./Include/cpython/object.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-81' visibility='default' filepath='./Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-83' visibility='default' filepath='./Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-84' visibility='default' filepath='./Include/cpython/object.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-85' visibility='default' filepath='./Include/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-86' visibility='default' filepath='./Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-88' visibility='default' filepath='./Include/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-90' visibility='default' filepath='./Include/cpython/object.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-33' visibility='default' filepath='./Include/cpython/object.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-93' visibility='default' filepath='./Include/cpython/object.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-94' visibility='default' filepath='./Include/cpython/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-95' visibility='default' filepath='./Include/cpython/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-96' visibility='default' filepath='./Include/cpython/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-97' visibility='default' filepath='./Include/cpython/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-98' visibility='default' filepath='./Include/cpython/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-99' visibility='default' filepath='./Include/cpython/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-102' visibility='default' filepath='./Include/cpython/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-103' visibility='default' filepath='./Include/cpython/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-104' visibility='default' filepath='./Include/cpython/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-105' visibility='default' filepath='./Include/cpython/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-106' visibility='default' filepath='./Include/cpython/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-107' visibility='default' filepath='./Include/cpython/object.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-108' visibility='default' filepath='./Include/cpython/object.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='./Include/object.h' line='115' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-110' visibility='default' filepath='./Include/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-15' visibility='default' filepath='./Include/object.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyObject' type-id='type-id-74' filepath='./Include/object.h' line='109' column='1' id='type-id-110'/>
    <typedef-decl name='PyVarObject' type-id='type-id-109' filepath='./Include/object.h' line='118' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <typedef-decl name='destructor' type-id='type-id-112' filepath='./Include/object.h' line='180' column='1' id='type-id-78'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <typedef-decl name='getattrfunc' type-id='type-id-114' filepath='./Include/object.h' line='181' column='1' id='type-id-79'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <typedef-decl name='setattrfunc' type-id='type-id-116' filepath='./Include/object.h' line='183' column='1' id='type-id-80'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-117' visibility='default' filepath='./Include/cpython/object.h' line='178' column='1' id='type-id-118'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-121'/>
    <typedef-decl name='unaryfunc' type-id='type-id-121' filepath='./Include/object.h' line='163' column='1' id='type-id-119'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-118' filepath='./Include/cpython/object.h' line='182' column='1' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='reprfunc' type-id='type-id-121' filepath='./Include/object.h' line='185' column='1' id='type-id-82'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='111' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-32' visibility='default' filepath='./Include/cpython/object.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-119' visibility='default' filepath='./Include/cpython/object.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <typedef-decl name='binaryfunc' type-id='type-id-126' filepath='./Include/object.h' line='164' column='1' id='type-id-124'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-128' filepath='./Include/object.h' line='165' column='1' id='type-id-87'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='inquiry' type-id='type-id-130' filepath='./Include/object.h' line='166' column='1' id='type-id-92'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-123' filepath='./Include/cpython/object.h' line='156' column='1' id='type-id-122'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-83'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='./Include/cpython/object.h' line='158' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-134' visibility='default' filepath='./Include/cpython/object.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-134' visibility='default' filepath='./Include/cpython/object.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-32' visibility='default' filepath='./Include/cpython/object.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-135' visibility='default' filepath='./Include/cpython/object.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-32' visibility='default' filepath='./Include/cpython/object.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-136' visibility='default' filepath='./Include/cpython/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-134' visibility='default' filepath='./Include/cpython/object.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <typedef-decl name='lenfunc' type-id='type-id-138' filepath='./Include/object.h' line='167' column='1' id='type-id-133'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-140' filepath='./Include/object.h' line='168' column='1' id='type-id-134'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-142' filepath='./Include/object.h' line='170' column='1' id='type-id-135'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <typedef-decl name='objobjproc' type-id='type-id-144' filepath='./Include/object.h' line='174' column='1' id='type-id-136'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-132' filepath='./Include/cpython/object.h' line='170' column='1' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-84'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-145' visibility='default' filepath='./Include/cpython/object.h' line='172' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-124' visibility='default' filepath='./Include/cpython/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-147' visibility='default' filepath='./Include/cpython/object.h' line='175' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <typedef-decl name='objobjargproc' type-id='type-id-149' filepath='./Include/object.h' line='172' column='1' id='type-id-147'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-146' filepath='./Include/cpython/object.h' line='176' column='1' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-85'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-15' filepath='./Include/pyport.h' line='114' column='1' id='type-id-150'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <typedef-decl name='hashfunc' type-id='type-id-152' filepath='./Include/object.h' line='186' column='1' id='type-id-86'/>
    <typedef-decl name='getattrofunc' type-id='type-id-126' filepath='./Include/object.h' line='182' column='1' id='type-id-88'/>
    <typedef-decl name='setattrofunc' type-id='type-id-149' filepath='./Include/object.h' line='184' column='1' id='type-id-89'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-153' visibility='default' filepath='./Include/cpython/object.h' line='184' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-155' visibility='default' filepath='./Include/cpython/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-156' visibility='default' filepath='./Include/cpython/object.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bufferinfo' size-in-bits='640' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='56' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-32' visibility='default' filepath='./Include/cpython/object.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-15' visibility='default' filepath='./Include/cpython/object.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-8' visibility='default' filepath='./Include/cpython/object.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-8' visibility='default' filepath='./Include/cpython/object.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-7' visibility='default' filepath='./Include/cpython/object.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-158' visibility='default' filepath='./Include/cpython/object.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-158' visibility='default' filepath='./Include/cpython/object.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-158' visibility='default' filepath='./Include/cpython/object.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-32' visibility='default' filepath='./Include/cpython/object.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-158'/>
    <typedef-decl name='Py_buffer' type-id='type-id-157' filepath='./Include/cpython/object.h' line='69' column='1' id='type-id-159'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-162'/>
    <typedef-decl name='getbufferproc' type-id='type-id-162' filepath='./Include/cpython/object.h' line='71' column='1' id='type-id-155'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-164'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-164' filepath='./Include/cpython/object.h' line='72' column='1' id='type-id-156'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-154' filepath='./Include/cpython/object.h' line='187' column='1' id='type-id-153'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <typedef-decl name='visitproc' type-id='type-id-166' filepath='./Include/object.h' line='175' column='1' id='type-id-167'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <typedef-decl name='traverseproc' type-id='type-id-169' filepath='./Include/object.h' line='176' column='1' id='type-id-91'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-171' filepath='./Include/object.h' line='187' column='1' id='type-id-93'/>
    <typedef-decl name='getiterfunc' type-id='type-id-121' filepath='./Include/object.h' line='188' column='1' id='type-id-94'/>
    <typedef-decl name='iternextfunc' type-id='type-id-121' filepath='./Include/object.h' line='189' column='1' id='type-id-95'/>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/methodobject.h' line='35' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-173' visibility='default' filepath='./Include/methodobject.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-8' visibility='default' filepath='./Include/methodobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCFunction' type-id='type-id-126' filepath='./Include/methodobject.h' line='19' column='1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-96'/>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-97'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/descrobject.h' line='11' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-176' visibility='default' filepath='./Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-177' visibility='default' filepath='./Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-32' visibility='default' filepath='./Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-179'/>
    <typedef-decl name='getter' type-id='type-id-179' filepath='./Include/descrobject.h' line='8' column='1' id='type-id-176'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <typedef-decl name='setter' type-id='type-id-181' filepath='./Include/descrobject.h' line='9' column='1' id='type-id-177'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-99'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-128' filepath='./Include/object.h' line='190' column='1' id='type-id-101'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-149' filepath='./Include/object.h' line='191' column='1' id='type-id-102'/>
    <typedef-decl name='initproc' type-id='type-id-149' filepath='./Include/object.h' line='192' column='1' id='type-id-103'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-76' filepath='./Include/object.h' line='66' column='1' id='type-id-182'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-184'/>
    <typedef-decl name='allocfunc' type-id='type-id-184' filepath='./Include/object.h' line='194' column='1' id='type-id-104'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <typedef-decl name='newfunc' type-id='type-id-186' filepath='./Include/object.h' line='193' column='1' id='type-id-105'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-188'/>
    <typedef-decl name='freefunc' type-id='type-id-188' filepath='./Include/object.h' line='179' column='1' id='type-id-106'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-107'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-189'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <typedef-decl name='size_t' type-id='type-id-33' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-191'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-193' filepath='./Include/cpython/object.h' line='74' column='1' id='type-id-108'/>
    <typedef-decl name='identifier' type-id='type-id-100' filepath='./Include/asdl.h' line='5' column='1' id='type-id-72'/>
    <typedef-decl name='string' type-id='type-id-100' filepath='./Include/asdl.h' line='6' column='1' id='type-id-73'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-194'/>
    <typedef-decl name='arg_ty' type-id='type-id-194' filepath='./Include/Python-ast.h' line='39' column='1' id='type-id-70'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-195'/>
    <typedef-decl name='arguments_ty' type-id='type-id-195' filepath='./Include/Python-ast.h' line='37' column='1' id='type-id-68'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='263' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='test' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='body' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='orelse' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='269' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keys' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='values' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='274' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elts' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='275' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='278' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elt' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='generators' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='280' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='288' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='generators' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='291' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='299' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='311' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='left' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='type-id-196' visibility='default' filepath='./Include/Python-ast.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='comparators' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='314' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-197' visibility='default' filepath='./Include/asdl.h' line='23' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-15' visibility='default' filepath='./Include/asdl.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='elements' type-id='type-id-199' visibility='default' filepath='./Include/asdl.h' line='25' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='32' id='type-id-199'>
      <subrange length='1' type-id='type-id-33' id='type-id-34'/>

    </array-type-def>
    <typedef-decl name='asdl_int_seq' type-id='type-id-198' filepath='./Include/asdl.h' line='26' column='1' id='type-id-197'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-196'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='317' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keywords' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='323' column='1' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='conversion' type-id='type-id-8' visibility='default' filepath='./Include/Python-ast.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='format_spec' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='329' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='values' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='333' column='1' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-200' visibility='default' filepath='./Include/Python-ast.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='kind' type-id='type-id-73' visibility='default' filepath='./Include/Python-ast.h' line='335' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='constant' type-id='type-id-100' filepath='./Include/asdl.h' line='8' column='1' id='type-id-200'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='338' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attr' type-id='type-id-72' visibility='default' filepath='./Include/Python-ast.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctx' type-id='type-id-201' visibility='default' filepath='./Include/Python-ast.h' line='341' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='_expr_context' filepath='./Include/Python-ast.h' line='20' column='1' id='type-id-202'>
      <underlying-type type-id='type-id-23'/>
      <enumerator name='Load' value='1'/>
      <enumerator name='Store' value='2'/>
      <enumerator name='Del' value='3'/>
    </enum-decl>
    <typedef-decl name='expr_context_ty' type-id='type-id-202' filepath='./Include/Python-ast.h' line='20' column='1' id='type-id-201'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='344' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='slice' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctx' type-id='type-id-201' visibility='default' filepath='./Include/Python-ast.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='350' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='type-id-201' visibility='default' filepath='./Include/Python-ast.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='355' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='type-id-72' visibility='default' filepath='./Include/Python-ast.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='type-id-201' visibility='default' filepath='./Include/Python-ast.h' line='357' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='360' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elts' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='type-id-201' visibility='default' filepath='./Include/Python-ast.h' line='362' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='370' column='1' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lower' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='upper' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='step' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='373' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/Python-ast.h' line='68' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argtypes' type-id='type-id-28' visibility='default' filepath='./Include/Python-ast.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='returns' type-id='type-id-35' visibility='default' filepath='./Include/Python-ast.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-203'/>
    <typedef-decl name='mod_ty' type-id='type-id-203' filepath='./Include/Python-ast.h' line='14' column='1' id='type-id-204'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-206' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-207' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-208' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-209' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-210' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-211' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-212' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-213' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-214' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-215' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-207' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-32' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-191' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-216' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-217'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-207'/>
    <typedef-decl name='__off_t' type-id='type-id-12' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-208'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-209'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-210'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-211'>
      <subrange length='1' type-id='type-id-33' id='type-id-34'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-218'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-212'/>
    <typedef-decl name='__off64_t' type-id='type-id-12' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-213'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-219'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-214'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-215'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-216'>
      <subrange length='20' type-id='type-id-33' id='type-id-221'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-205' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-222'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-223'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-224' visibility='default' filepath='./Include/compile.h' line='37' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cf_flags' type-id='type-id-8' visibility='default' filepath='./Include/compile.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cf_feature_version' type-id='type-id-8' visibility='default' filepath='./Include/compile.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCompilerFlags' type-id='type-id-225' filepath='./Include/compile.h' line='40' column='1' id='type-id-224'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-227'/>
    <class-decl name='_arena' size-in-bits='192' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-228'/>
    <typedef-decl name='PyArena' type-id='type-id-228' filepath='./Include/pyarena.h' line='12' column='1' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-230'/>
    <function-decl name='PyPegen_ASTFromFileObject' mangled-name='PyPegen_ASTFromFileObject' filepath='Parser/pegen/peg_api.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyPegen_ASTFromFileObject'>
      <parameter type-id='type-id-223' name='fp' filepath='Parser/pegen/peg_api.c' line='45' column='1'/>
      <parameter type-id='type-id-100' name='filename_ob' filepath='Parser/pegen/peg_api.c' line='45' column='1'/>
      <parameter type-id='type-id-8' name='mode' filepath='Parser/pegen/peg_api.c' line='45' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/pegen/peg_api.c' line='46' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/pegen/peg_api.c' line='46' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/pegen/peg_api.c' line='46' column='1'/>
      <parameter type-id='type-id-226' name='flags' filepath='Parser/pegen/peg_api.c' line='47' column='1'/>
      <parameter type-id='type-id-227' name='errcode' filepath='Parser/pegen/peg_api.c' line='47' column='1'/>
      <parameter type-id='type-id-230' name='arena' filepath='Parser/pegen/peg_api.c' line='47' column='1'/>
      <return type-id='type-id-204'/>
    </function-decl>
    <function-decl name='PyPegen_ASTFromFilename' mangled-name='PyPegen_ASTFromFilename' filepath='Parser/pegen/peg_api.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyPegen_ASTFromFilename'>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/pegen/peg_api.c' line='32' column='1'/>
      <parameter type-id='type-id-8' name='mode' filepath='Parser/pegen/peg_api.c' line='32' column='1'/>
      <parameter type-id='type-id-226' name='flags' filepath='Parser/pegen/peg_api.c' line='32' column='1'/>
      <parameter type-id='type-id-230' name='arena' filepath='Parser/pegen/peg_api.c' line='32' column='1'/>
      <return type-id='type-id-204'/>
    </function-decl>
    <function-decl name='PyPegen_ASTFromStringObject' mangled-name='PyPegen_ASTFromStringObject' filepath='Parser/pegen/peg_api.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyPegen_ASTFromStringObject'>
      <parameter type-id='type-id-3' name='str' filepath='Parser/pegen/peg_api.c' line='20' column='1'/>
      <parameter type-id='type-id-100' name='filename' filepath='Parser/pegen/peg_api.c' line='20' column='1'/>
      <parameter type-id='type-id-8' name='mode' filepath='Parser/pegen/peg_api.c' line='20' column='1'/>
      <parameter type-id='type-id-226' name='flags' filepath='Parser/pegen/peg_api.c' line='21' column='1'/>
      <parameter type-id='type-id-230' name='arena' filepath='Parser/pegen/peg_api.c' line='21' column='1'/>
      <return type-id='type-id-204'/>
    </function-decl>
    <function-decl name='PyPegen_ASTFromString' mangled-name='PyPegen_ASTFromString' filepath='Parser/pegen/peg_api.c' line='7' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyPegen_ASTFromString'>
      <parameter type-id='type-id-3' name='str' filepath='Parser/pegen/peg_api.c' line='7' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/pegen/peg_api.c' line='7' column='1'/>
      <parameter type-id='type-id-8' name='mode' filepath='Parser/pegen/peg_api.c' line='7' column='1'/>
      <parameter type-id='type-id-226' name='flags' filepath='Parser/pegen/peg_api.c' line='8' column='1'/>
      <parameter type-id='type-id-230' name='arena' filepath='Parser/pegen/peg_api.c' line='8' column='1'/>
      <return type-id='type-id-204'/>
    </function-decl>
    <function-decl name='PySys_Audit' mangled-name='PySys_Audit' filepath='./Include/cpython/sysmodule.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser_from_file_pointer' mangled-name='_PyPegen_run_parser_from_file_pointer' filepath='Parser/pegen/pegen.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromString' mangled-name='PyUnicode_FromString' filepath='./Include/unicodeobject.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser_from_file' mangled-name='_PyPegen_run_parser_from_file' filepath='Parser/pegen/pegen.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyPegen_run_parser_from_string' mangled-name='_PyPegen_run_parser_from_string' filepath='Parser/pegen/pegen.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-120'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-192'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-113'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-178'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-185'>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-183'>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-100'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-148'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-161'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-115'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-141'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-150'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-137'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-111'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-163'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-187'>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/myreadline.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_ts' size-in-bits='2112' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='51' column='1' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-232' visibility='default' filepath='./Include/cpython/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-232' visibility='default' filepath='./Include/cpython/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-233' visibility='default' filepath='./Include/cpython/pystate.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-234' visibility='default' filepath='./Include/cpython/pystate.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='overflowed' type-id='type-id-1' visibility='default' filepath='./Include/cpython/pystate.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='recursion_critical' type-id='type-id-1' visibility='default' filepath='./Include/cpython/pystate.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_tracing' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-235' visibility='default' filepath='./Include/cpython/pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-235' visibility='default' filepath='./Include/cpython/pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-236' visibility='default' filepath='./Include/cpython/pystate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-237' visibility='default' filepath='./Include/cpython/pystate.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-33' visibility='default' filepath='./Include/cpython/pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-188' visibility='default' filepath='./Include/cpython/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-32' visibility='default' filepath='./Include/cpython/pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='async_gen_firstiter' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='async_gen_finalizer' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='context' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='context_ver' type-id='type-id-238' visibility='default' filepath='./Include/cpython/pystate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='id' type-id='type-id-238' visibility='default' filepath='./Include/cpython/pystate.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-232'/>
    <class-decl name='_is' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-239'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-239' filepath='./Include/pystate.h' line='22' column='1' id='type-id-240'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-233'/>
    <class-decl name='_frame' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-241'/>
    <typedef-decl name='PyFrameObject' type-id='type-id-241' filepath='./Include/pyframe.h' line='12' column='1' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-244' filepath='./Include/cpython/pystate.h' line='19' column='1' id='type-id-235'/>
    <class-decl name='_err_stackitem' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='36' column='1' id='type-id-245'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_type' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exc_value' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exc_traceback' type-id='type-id-100' visibility='default' filepath='./Include/cpython/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='previous_item' type-id='type-id-246' visibility='default' filepath='./Include/cpython/pystate.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-245' filepath='./Include/cpython/pystate.h' line='47' column='1' id='type-id-236'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-237'/>
    <typedef-decl name='__uint64_t' type-id='type-id-33' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-247'/>
    <typedef-decl name='uint64_t' type-id='type-id-247' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-238'/>
    <typedef-decl name='PyThreadState' type-id='type-id-231' filepath='./Include/pystate.h' line='20' column='1' id='type-id-248'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-249'/>
    <var-decl name='_PyOS_ReadlineTState' type-id='type-id-249' mangled-name='_PyOS_ReadlineTState' visibility='default' filepath='./Include/pythonrun.h' line='196' column='1' elf-symbol-id='_PyOS_ReadlineTState'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-251'/>
    <var-decl name='PyOS_InputHook' type-id='type-id-251' mangled-name='PyOS_InputHook' visibility='default' filepath='./Include/pythonrun.h' line='193' column='1' elf-symbol-id='PyOS_InputHook'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-253'/>
    <var-decl name='PyOS_ReadlineFunctionPointer' type-id='type-id-253' mangled-name='PyOS_ReadlineFunctionPointer' visibility='default' filepath='./Include/pythonrun.h' line='194' column='1' elf-symbol-id='PyOS_ReadlineFunctionPointer'/>
    <function-decl name='PyOS_Readline' mangled-name='PyOS_Readline' filepath='Parser/myreadline.c' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_Readline'>
      <parameter type-id='type-id-223' name='sys_stdin' filepath='Parser/myreadline.c' line='356' column='1'/>
      <parameter type-id='type-id-223' name='sys_stdout' filepath='Parser/myreadline.c' line='356' column='1'/>
      <parameter type-id='type-id-3' name='prompt' filepath='Parser/myreadline.c' line='356' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyEval_SaveThread' mangled-name='PyEval_SaveThread' filepath='./Include/ceval.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThread_acquire_lock' mangled-name='PyThread_acquire_lock' filepath='./Include/pythread.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='779' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyEval_RestoreThread' mangled-name='PyEval_RestoreThread' filepath='./Include/ceval.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThread_release_lock' mangled-name='PyThread_release_lock' filepath='./Include/pythread.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyThread_allocate_lock' mangled-name='PyThread_allocate_lock' filepath='./Include/pythread.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__fgets_alias' mangled-name='fgets' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='./Include/pyerrors.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='clearerr' mangled-name='clearerr' filepath='/usr/include/stdio.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' filepath='/usr/include/stdio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyOS_InterruptOccurred' mangled-name='_PyOS_InterruptOccurred' filepath='./Include/internal/pycore_pystate.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMem_RawRealloc' mangled-name='PyMem_RawRealloc' filepath='./Include/cpython/pymem.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fflush' mangled-name='fflush' filepath='/usr/include/stdio.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-252'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-250'>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-234'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/parsetok.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-254' visibility='default' filepath='./Include/grammar.h' line='60' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_ndfas' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dfa' type-id='type-id-256' visibility='default' filepath='./Include/grammar.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_ll' type-id='type-id-257' visibility='default' filepath='./Include/grammar.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='g_start' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='g_accel' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-258' visibility='default' filepath='./Include/grammar.h' line='50' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_type' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_name' type-id='type-id-7' visibility='default' filepath='./Include/grammar.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_nstates' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_state' type-id='type-id-260' visibility='default' filepath='./Include/grammar.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_first' type-id='type-id-261' visibility='default' filepath='./Include/grammar.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-262' visibility='default' filepath='./Include/grammar.h' line='37' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_narcs' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_arc' type-id='type-id-264' visibility='default' filepath='./Include/grammar.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_lower' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='s_upper' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_accel' type-id='type-id-227' visibility='default' filepath='./Include/grammar.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='s_accept' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-265' visibility='default' filepath='./Include/grammar.h' line='30' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a_lbl' type-id='type-id-6' visibility='default' filepath='./Include/grammar.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='a_arrow' type-id='type-id-6' visibility='default' filepath='./Include/grammar.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='arc' type-id='type-id-266' filepath='./Include/grammar.h' line='33' column='1' id='type-id-265'/>
    <qualified-type-def type-id='type-id-265' const='yes' id='type-id-267'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-264'/>
    <typedef-decl name='state' type-id='type-id-263' filepath='./Include/grammar.h' line='46' column='1' id='type-id-262'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-260'/>
    <typedef-decl name='bitset' type-id='type-id-7' filepath='./Include/bitset.h' line='11' column='1' id='type-id-261'/>
    <typedef-decl name='dfa' type-id='type-id-259' filepath='./Include/grammar.h' line='56' column='1' id='type-id-258'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-256'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-269' visibility='default' filepath='./Include/grammar.h' line='23' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ll_nlabels' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ll_label' type-id='type-id-271' visibility='default' filepath='./Include/grammar.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-272' visibility='default' filepath='./Include/grammar.h' line='14' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lb_type' type-id='type-id-8' visibility='default' filepath='./Include/grammar.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lb_str' type-id='type-id-3' visibility='default' filepath='./Include/grammar.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='label' type-id='type-id-273' filepath='./Include/grammar.h' line='17' column='1' id='type-id-272'/>
    <qualified-type-def type-id='type-id-272' const='yes' id='type-id-274'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-271'/>
    <typedef-decl name='labellist' type-id='type-id-270' filepath='./Include/grammar.h' line='26' column='1' id='type-id-269'/>
    <qualified-type-def type-id='type-id-269' const='yes' id='type-id-257'/>
    <typedef-decl name='grammar' type-id='type-id-255' filepath='./Include/grammar.h' line='66' column='1' id='type-id-254'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-275'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-276' visibility='default' filepath='./Include/parsetok.h' line='13' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-8' visibility='default' filepath='./Include/parsetok.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='filename' type-id='type-id-100' visibility='default' filepath='./Include/parsetok.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lineno' type-id='type-id-8' visibility='default' filepath='./Include/parsetok.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offset' type-id='type-id-8' visibility='default' filepath='./Include/parsetok.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='text' type-id='type-id-7' visibility='default' filepath='./Include/parsetok.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='token' type-id='type-id-8' visibility='default' filepath='./Include/parsetok.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='expected' type-id='type-id-8' visibility='default' filepath='./Include/parsetok.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='perrdetail' type-id='type-id-277' filepath='./Include/parsetok.h' line='21' column='1' id='type-id-276'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-278'/>
    <function-decl name='PyParser_ParseFileFlagsEx' mangled-name='PyParser_ParseFileFlagsEx' filepath='Parser/parsetok.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileFlagsEx'>
      <parameter type-id='type-id-223' name='fp' filepath='Parser/parsetok.c' line='192' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='192' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/parsetok.c' line='193' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='193' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='193' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='194' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='194' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='195' column='1'/>
      <parameter type-id='type-id-227' name='flags' filepath='Parser/parsetok.c' line='195' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseFileObject' mangled-name='PyParser_ParseFileObject' filepath='Parser/parsetok.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileObject'>
      <parameter type-id='type-id-223' name='fp' filepath='Parser/parsetok.c' line='165' column='1'/>
      <parameter type-id='type-id-100' name='filename' filepath='Parser/parsetok.c' line='165' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/parsetok.c' line='166' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='166' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='166' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='167' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='167' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='168' column='1'/>
      <parameter type-id='type-id-227' name='flags' filepath='Parser/parsetok.c' line='168' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseFileFlags' mangled-name='PyParser_ParseFileFlags' filepath='Parser/parsetok.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileFlags'>
      <parameter type-id='type-id-223' name='fp' filepath='Parser/parsetok.c' line='154' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='154' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='Parser/parsetok.c' line='154' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='155' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='155' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='156' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='156' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='157' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Parser/parsetok.c' line='157' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseFile' mangled-name='PyParser_ParseFile' filepath='Parser/parsetok.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFile'>
      <parameter type-id='type-id-223' name='fp' filepath='Parser/parsetok.c' line='145' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='145' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='145' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='145' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='Parser/parsetok.c' line='146' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='Parser/parsetok.c' line='146' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='147' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlagsFilenameEx' mangled-name='PyParser_ParseStringFlagsFilenameEx' filepath='Parser/parsetok.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlagsFilenameEx'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='124' column='1'/>
      <parameter type-id='type-id-3' name='filename_str' filepath='Parser/parsetok.c' line='124' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='125' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='125' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='126' column='1'/>
      <parameter type-id='type-id-227' name='flags' filepath='Parser/parsetok.c' line='126' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringObject' mangled-name='PyParser_ParseStringObject' filepath='Parser/parsetok.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringObject'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='89' column='1'/>
      <parameter type-id='type-id-100' name='filename' filepath='Parser/parsetok.c' line='89' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='90' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='90' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='91' column='1'/>
      <parameter type-id='type-id-227' name='flags' filepath='Parser/parsetok.c' line='91' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlagsFilename' mangled-name='PyParser_ParseStringFlagsFilename' filepath='Parser/parsetok.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlagsFilename'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='79' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='Parser/parsetok.c' line='79' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='80' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='80' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='81' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Parser/parsetok.c' line='81' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlags' mangled-name='PyParser_ParseStringFlags' filepath='Parser/parsetok.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlags'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='71' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='71' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='71' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='72' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Parser/parsetok.c' line='72' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='PyParser_ParseString' mangled-name='PyParser_ParseString' filepath='Parser/parsetok.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseString'>
      <parameter type-id='type-id-3' name='s' filepath='Parser/parsetok.c' line='65' column='1'/>
      <parameter type-id='type-id-275' name='g' filepath='Parser/parsetok.c' line='65' column='1'/>
      <parameter type-id='type-id-8' name='start' filepath='Parser/parsetok.c' line='65' column='1'/>
      <parameter type-id='type-id-278' name='err_ret' filepath='Parser/parsetok.c' line='65' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='realloc' mangled-name='realloc' filepath='/usr/include/stdlib.h' line='550' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyParser_AddToken' mangled-name='PyParser_AddToken' filepath='Parser/parser.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyParser_New' mangled-name='PyParser_New' filepath='Parser/parser.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyParser_Delete' mangled-name='PyParser_Delete' filepath='Parser/parser.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyNode_FinalizeEndPos' mangled-name='_PyNode_FinalizeEndPos' filepath='./Include/node.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeFSDefault' mangled-name='PyUnicode_DecodeFSDefault' filepath='./Include/unicodeobject.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/tokenizer.c' comp-dir-path='/src' language='LANG_C99'>
    <function-decl name='_Py_dup' mangled-name='_Py_dup' filepath='./Include/cpython/fileutils.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fdopen' mangled-name='fdopen' filepath='/usr/include/stdio.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_Substring' mangled-name='PyUnicode_Substring' filepath='./Include/unicodeobject.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsUTF8String' mangled-name='PyUnicode_AsUTF8String' filepath='./Include/unicodeobject.h' line='464' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_IsPrintable' mangled-name='_PyUnicode_IsPrintable' filepath='./Include/cpython/unicodeobject.h' line='1170' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_ScanIdentifier' mangled-name='_PyUnicode_ScanIdentifier' filepath='./Include/cpython/unicodeobject.h' line='1232' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='./Include/token.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='./Include/token.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='./Include/token.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_BuildValue_SizeT' mangled-name='_Py_BuildValue_SizeT' filepath='./Include/modsupport.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_Decode' mangled-name='PyUnicode_Decode' filepath='./Include/unicodeobject.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyOS_Readline' mangled-name='PyOS_Readline' filepath='./Include/pythonrun.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='./Include/abstract.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySys_WriteStderr' mangled-name='PySys_WriteStderr' filepath='./Include/sysmodule.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='getc' mangled-name='getc' filepath='/usr/include/stdio.h' line='486' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='ungetc' mangled-name='ungetc' filepath='/usr/include/stdio.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='./Include/bytearrayobject.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsUTF8AndSize' mangled-name='PyUnicode_AsUTF8AndSize' filepath='./Include/cpython/unicodeobject.h' line='746' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='./Include/bytearrayobject.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='Py_UniversalNewlineFgets' mangled-name='Py_UniversalNewlineFgets' filepath='./Include/cpython/fileobject.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='ftell' mangled-name='ftell' filepath='/usr/include/stdio.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId_SizeT' mangled-name='_PyObject_CallMethodId_SizeT' filepath='./Include/cpython/abstract.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_GetAttrId' mangled-name='_PyObject_GetAttrId' filepath='./Include/cpython/object.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' mangled-name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/abstract.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-7' const='yes' id='type-id-279'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-280'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='Objects/abstract.c' line='2771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-280' name='array' filepath='Objects/abstract.c' line='2771' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='Objects/abstract.c' line='2712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-100' name='self' filepath='Objects/abstract.c' line='2712' column='1'/>
      <return type-id='type-id-280'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='Objects/abstract.c' line='2677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='2677' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='Objects/abstract.c' line='2643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-100' name='derived' filepath='Objects/abstract.c' line='2643' column='1'/>
      <parameter type-id='type-id-100' name='cls' filepath='Objects/abstract.c' line='2643' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='Objects/abstract.c' line='2637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-100' name='derived' filepath='Objects/abstract.c' line='2643' column='1'/>
      <parameter type-id='type-id-100' name='cls' filepath='Objects/abstract.c' line='2643' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='Objects/abstract.c' line='2629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-100' name='derived' filepath='Objects/abstract.c' line='2629' column='1'/>
      <parameter type-id='type-id-100' name='cls' filepath='Objects/abstract.c' line='2629' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='Objects/abstract.c' line='2546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-100' name='derived' filepath='Objects/abstract.c' line='2629' column='1'/>
      <parameter type-id='type-id-100' name='cls' filepath='Objects/abstract.c' line='2629' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='Objects/abstract.c' line='2333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2333' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='Objects/abstract.c' line='2319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2333' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='Objects/abstract.c' line='2305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2333' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='Objects/abstract.c' line='2260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2260' column='1'/>
      <parameter type-id='type-id-100' name='key' filepath='Objects/abstract.c' line='2260' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='Objects/abstract.c' line='2246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2246' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2246' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='Objects/abstract.c' line='2227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2227' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2227' column='1'/>
      <parameter type-id='type-id-100' name='value' filepath='Objects/abstract.c' line='2227' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='Objects/abstract.c' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2203' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='Objects/abstract.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='2677' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='Objects/abstract.c' line='2161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='2161' column='1'/>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2161' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='Objects/abstract.c' line='2155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='2155' column='1'/>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='2155' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='Objects/abstract.c' line='2133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='2161' column='1'/>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2161' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='Objects/abstract.c' line='2048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-100' name='seq' filepath='Objects/abstract.c' line='2048' column='1'/>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='2048' column='1'/>
      <parameter type-id='type-id-8' name='operation' filepath='Objects/abstract.c' line='2048' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='Objects/abstract.c' line='2015' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='2015' column='1'/>
      <parameter type-id='type-id-3' name='m' filepath='Objects/abstract.c' line='2015' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='Objects/abstract.c' line='1908' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1908' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='Objects/abstract.c' line='1884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-15' name='i1' filepath='Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-15' name='i2' filepath='Objects/abstract.c' line='1884' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='Objects/abstract.c' line='1859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-15' name='i1' filepath='Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-15' name='i2' filepath='Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1859' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='Objects/abstract.c' line='1826' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1826' column='1'/>
      <parameter type-id='type-id-15' name='i' filepath='Objects/abstract.c' line='1826' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='Objects/abstract.c' line='1793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1793' column='1'/>
      <parameter type-id='type-id-15' name='i' filepath='Objects/abstract.c' line='1793' column='1'/>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1793' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='Objects/abstract.c' line='1770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1770' column='1'/>
      <parameter type-id='type-id-15' name='i1' filepath='Objects/abstract.c' line='1770' column='1'/>
      <parameter type-id='type-id-15' name='i2' filepath='Objects/abstract.c' line='1770' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='Objects/abstract.c' line='1740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1740' column='1'/>
      <parameter type-id='type-id-15' name='i' filepath='Objects/abstract.c' line='1740' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='Objects/abstract.c' line='1710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1710' column='1'/>
      <parameter type-id='type-id-15' name='count' filepath='Objects/abstract.c' line='1710' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='Objects/abstract.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1685' column='1'/>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1685' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='Objects/abstract.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1710' column='1'/>
      <parameter type-id='type-id-15' name='count' filepath='Objects/abstract.c' line='1710' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='Objects/abstract.c' line='1630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1685' column='1'/>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1685' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='Objects/abstract.c' line='1623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2203' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='Objects/abstract.c' line='1588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1588' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='Objects/abstract.c' line='1569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-100' name='n' filepath='Objects/abstract.c' line='1569' column='1'/>
      <parameter type-id='type-id-8' name='base' filepath='Objects/abstract.c' line='1569' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='Objects/abstract.c' line='1510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1510' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='Objects/abstract.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1411' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='Objects/abstract.c' line='1366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-100' name='item' filepath='Objects/abstract.c' line='1366' column='1'/>
      <parameter type-id='type-id-100' name='err' filepath='Objects/abstract.c' line='1366' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='Objects/abstract.c' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-100' name='item' filepath='Objects/abstract.c' line='1324' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='Objects/abstract.c' line='1313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1588' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='Objects/abstract.c' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1296' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='Objects/abstract.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1296' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='Objects/abstract.c' line='1264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1296' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='Objects/abstract.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='1296' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='Objects/abstract.c' line='1233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-100' name='z' filepath='Objects/abstract.c' line='1233' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='Objects/abstract.c' line='1226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='Objects/abstract.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='Objects/abstract.c' line='1190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1190' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1190' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='Objects/abstract.c' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1190' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1190' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='Objects/abstract.c' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='Objects/abstract.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='Objects/abstract.c' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='Objects/abstract.c' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='Objects/abstract.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1090' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1090' column='1'/>
      <parameter type-id='type-id-100' name='z' filepath='Objects/abstract.c' line='1090' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='1078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='1072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='1066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='1047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1190' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1190' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='1016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1190' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1190' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='1013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='1010' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='1008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='1007' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-100' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='2677' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='759' column='1'/>
      <parameter type-id='type-id-100' name='format_spec' filepath='Objects/abstract.c' line='759' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-160' name='view' filepath='Objects/abstract.c' line='745' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-160' name='view' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-32' name='buf' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-15' name='len' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-8' name='readonly' filepath='Objects/abstract.c' line='707' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Objects/abstract.c' line='707' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='682' column='1'/>
      <parameter type-id='type-id-158' name='shape' filepath='Objects/abstract.c' line='682' column='1'/>
      <parameter type-id='type-id-158' name='strides' filepath='Objects/abstract.c' line='683' column='1'/>
      <parameter type-id='type-id-8' name='itemsize' filepath='Objects/abstract.c' line='683' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='Objects/abstract.c' line='684' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-100' name='dest' filepath='Objects/abstract.c' line='611' column='1'/>
      <parameter type-id='type-id-100' name='src' filepath='Objects/abstract.c' line='611' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-160' name='view' filepath='Objects/abstract.c' line='560' column='1'/>
      <parameter type-id='type-id-32' name='buf' filepath='Objects/abstract.c' line='560' column='1'/>
      <parameter type-id='type-id-15' name='len' filepath='Objects/abstract.c' line='560' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='Objects/abstract.c' line='560' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_SizeFromFormat' mangled-name='PyBuffer_SizeFromFormat' filepath='Objects/abstract.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_SizeFromFormat'>
      <parameter type-id='type-id-3' name='format' filepath='Objects/abstract.c' line='518' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-281'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='Objects/abstract.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='502' column='1'/>
      <parameter type-id='type-id-158' name='index' filepath='Objects/abstract.c' line='502' column='1'/>
      <parameter type-id='type-id-282' name='shape' filepath='Objects/abstract.c' line='502' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='Objects/abstract.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='502' column='1'/>
      <parameter type-id='type-id-158' name='index' filepath='Objects/abstract.c' line='502' column='1'/>
      <parameter type-id='type-id-282' name='shape' filepath='Objects/abstract.c' line='502' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-160' name='view' filepath='Objects/abstract.c' line='470' column='1'/>
      <parameter type-id='type-id-158' name='indices' filepath='Objects/abstract.c' line='470' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='373' column='1'/>
      <parameter type-id='type-id-160' name='view' filepath='Objects/abstract.c' line='373' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Objects/abstract.c' line='373' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-283'/>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='344' column='1'/>
      <parameter type-id='type-id-283' name='buffer' filepath='Objects/abstract.c' line='345' column='1'/>
      <parameter type-id='type-id-158' name='buffer_len' filepath='Objects/abstract.c' line='346' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='Objects/abstract.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='337' column='1'/>
      <parameter type-id='type-id-283' name='buffer' filepath='Objects/abstract.c' line='338' column='1'/>
      <parameter type-id='type-id-158' name='buffer_len' filepath='Objects/abstract.c' line='339' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-284'/>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='330' column='1'/>
      <parameter type-id='type-id-284' name='buffer' filepath='Objects/abstract.c' line='331' column='1'/>
      <parameter type-id='type-id-158' name='buffer_len' filepath='Objects/abstract.c' line='332' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='295' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='Objects/abstract.c' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckBuffer'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='284' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='264' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='264' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='232' column='1'/>
      <parameter type-id='type-id-100' name='key' filepath='Objects/abstract.c' line='232' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='200' column='1'/>
      <parameter type-id='type-id-100' name='key' filepath='Objects/abstract.c' line='200' column='1'/>
      <parameter type-id='type-id-100' name='value' filepath='Objects/abstract.c' line='200' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='146' column='1'/>
      <parameter type-id='type-id-100' name='key' filepath='Objects/abstract.c' line='146' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='Objects/abstract.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-100' name='obj' filepath='Objects/abstract.c' line='2677' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2203' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='35' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <qualified-type-def type-id='type-id-159' const='yes' id='type-id-285'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-286'/>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-286' name='view' filepath='Objects/abstract.c' line='454' column='1'/>
      <parameter type-id='type-id-1' name='order' filepath='Objects/abstract.c' line='454' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='Objects/abstract.c' line='1597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1597' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='Objects/abstract.c' line='1992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-100' name='v' filepath='Objects/abstract.c' line='1992' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='Objects/abstract.c' line='2176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-100' name='s' filepath='Objects/abstract.c' line='1597' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='Objects/abstract.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='49' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='89' column='1'/>
      <parameter type-id='type-id-15' name='defaultvalue' filepath='Objects/abstract.c' line='89' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='Objects/abstract.c' line='2210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2210' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='Objects/abstract.c' line='2210' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='Objects/abstract.c' line='2650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-100' name='o' filepath='Objects/abstract.c' line='2650' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='Objects/abstract.c' line='2691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-100' name='iter' filepath='Objects/abstract.c' line='2691' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='Objects/abstract.c' line='2142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-100' name='seq' filepath='Objects/abstract.c' line='2142' column='1'/>
      <parameter type-id='type-id-100' name='ob' filepath='Objects/abstract.c' line='2142' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='./Include/bytesobject.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_LookupAttrId' mangled-name='_PyObject_LookupAttrId' filepath='./Include/cpython/object.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyType_IsSubtype' mangled-name='PyType_IsSubtype' filepath='./Include/object.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_CheckRecursiveCall' mangled-name='_Py_CheckRecursiveCall' filepath='./Include/internal/pycore_ceval.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_IsTrue' mangled-name='PyObject_IsTrue' filepath='./Include/object.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_LookupSpecial' mangled-name='_PyObject_LookupSpecial' filepath='./Include/cpython/object.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyUnicode_FromId' mangled-name='_PyUnicode_FromId' filepath='./Include/cpython/unicodeobject.h' line='1226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_VectorcallMethod' mangled-name='PyObject_VectorcallMethod' filepath='./Include/cpython/abstract.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyDict_Values' mangled-name='PyDict_Values' filepath='./Include/dictobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyDict_Items' mangled-name='PyDict_Items' filepath='./Include/dictobject.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyDict_Keys' mangled-name='PyDict_Keys' filepath='./Include/dictobject.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_RichCompareBool' mangled-name='PyObject_RichCompareBool' filepath='./Include/object.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyTuple_Resize' mangled-name='_PyTuple_Resize' filepath='./Include/cpython/tupleobject.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTuple_New' mangled-name='PyTuple_New' filepath='./Include/tupleobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_AsTuple' mangled-name='PyList_AsTuple' filepath='./Include/listobject.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PySlice_FromIndices' mangled-name='_PySlice_FromIndices' filepath='./Include/sliceobject.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromSsize_t' mangled-name='PyLong_FromSsize_t' filepath='./Include/longobject.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_Format' mangled-name='_PyLong_Format' filepath='./Include/longobject.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_WarnFormat' mangled-name='PyErr_WarnFormat' filepath='./Include/warnings.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_AsDouble' mangled-name='PyLong_AsDouble' filepath='./Include/longobject.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyFloat_FromString' mangled-name='PyFloat_FromString' filepath='./Include/floatobject.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_Copy' mangled-name='_PyLong_Copy' filepath='./Include/longintrepr.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_FromNbIndexOrNbInt' mangled-name='_PyLong_FromNbIndexOrNbInt' filepath='./Include/longobject.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_FromBytes' mangled-name='_PyLong_FromBytes' filepath='./Include/longobject.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_FromNbInt' mangled-name='_PyLong_FromNbInt' filepath='./Include/longobject.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_FromUnicodeObject' mangled-name='PyLong_FromUnicodeObject' filepath='./Include/longobject.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_AsSsize_t' mangled-name='PyLong_AsSsize_t' filepath='./Include/longobject.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_GivenExceptionMatches' mangled-name='PyErr_GivenExceptionMatches' filepath='./Include/pyerrors.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_Sign' mangled-name='_PyLong_Sign' filepath='./Include/longobject.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_New' mangled-name='PyUnicode_New' filepath='./Include/cpython/unicodeobject.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyImport_ImportModule' mangled-name='PyImport_ImportModule' filepath='./Include/import.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='./Include/abstract.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='Py_GenericAlias' mangled-name='Py_GenericAlias' filepath='./Include/genericaliasobject.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyList_Extend' mangled-name='_PyList_Extend' filepath='./Include/cpython/listobject.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySeqIter_New' mangled-name='PySeqIter_New' filepath='./Include/iterobject.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/accu.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-287' visibility='default' filepath='./Include/internal/pycore_accu.h' line='24' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-100' visibility='default' filepath='./Include/internal/pycore_accu.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-100' visibility='default' filepath='./Include/internal/pycore_accu.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyAccu' type-id='type-id-288' filepath='./Include/internal/pycore_accu.h' line='27' column='1' id='type-id-287'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-289'/>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-100' name='unicode' filepath='Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyUnicode_Join' mangled-name='PyUnicode_Join' filepath='./Include/unicodeobject.h' line='902' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_SetSlice' mangled-name='PyList_SetSlice' filepath='./Include/listobject.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_Append' mangled-name='PyList_Append' filepath='./Include/listobject.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/boolobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyBool_Type' type-id='type-id-182' mangled-name='PyBool_Type' visibility='default' filepath='./Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/longintrepr.h' line='85' column='1' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-291' visibility='default' filepath='./Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-107' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-292'/>
    <typedef-decl name='uint32_t' type-id='type-id-292' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-293'/>
    <typedef-decl name='digit' type-id='type-id-293' filepath='./Include/longintrepr.h' line='45' column='1' id='type-id-294'/>

    <array-type-def dimensions='1' type-id='type-id-294' size-in-bits='32' id='type-id-291'>
      <subrange length='1' type-id='type-id-33' id='type-id-34'/>

    </array-type-def>
    <var-decl name='_Py_FalseStruct' type-id='type-id-290' mangled-name='_Py_FalseStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-290' mangled-name='_Py_TrueStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-12' name='ok' filepath='Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='_PyArg_NoKeywords' mangled-name='_PyArg_NoKeywords' filepath='./Include/modsupport.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyArg_UnpackTuple' mangled-name='PyArg_UnpackTuple' filepath='./Include/modsupport.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/src' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='infinite' id='type-id-295'>
      <subrange length='infinite' id='type-id-18'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-295' const='yes' id='type-id-296'/>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='42' column='1'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='43' column='1'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='44' column='1'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='45' column='1'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='46' column='1'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='47' column='1'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='48' column='1'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='49' column='1'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='50' column='1'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='51' column='1'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='52' column='1'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='53' column='1'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='54' column='1'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='62' column='1'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='56' column='1'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='57' column='1'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='58' column='1'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='59' column='1'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='55' column='1'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='60' column='1'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-296' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='61' column='1'/>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='./Include/cpython/abstract.h' line='330' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='./Include/cpython/abstract.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_ParseTuple_SizeT' mangled-name='_PyArg_ParseTuple_SizeT' filepath='./Include/modsupport.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyEval_SliceIndex' mangled-name='_PyEval_SliceIndex' filepath='./Include/cpython/ceval.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='./Include/boolobject.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memchr' mangled-name='memchr' filepath='/usr/include/string.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='./Include/abstract.h' line='509' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='./Include/cpython/abstract.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memrchr' mangled-name='memrchr' filepath='/usr/include/string.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/src' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-297'>
      <subrange length='infinite' id='type-id-18'/>

    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-297' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='./Include/cpython/bytearrayobject.h' line='20' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-182' mangled-name='PyByteArray_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='22' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-182' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='23' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-100' name='a' filepath='Objects/bytearrayobject.c' line='255' column='1'/>
      <parameter type-id='type-id-100' name='b' filepath='Objects/bytearrayobject.c' line='255' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-100' name='self' filepath='Objects/bytearrayobject.c' line='176' column='1'/>
      <parameter type-id='type-id-15' name='requested_size' filepath='Objects/bytearrayobject.c' line='176' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='Objects/bytearrayobject.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-100' name='self' filepath='Objects/bytearrayobject.c' line='167' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-100' name='self' filepath='Objects/bytearrayobject.c' line='158' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='Objects/bytearrayobject.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-3' name='bytes' filepath='Objects/bytearrayobject.c' line='114' column='1'/>
      <parameter type-id='type-id-15' name='size' filepath='Objects/bytearrayobject.c' line='114' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-100' name='input' filepath='Objects/bytearrayobject.c' line='88' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='./Include/objimpl.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_endswith' mangled-name='_Py_bytes_endswith' filepath='./Include/internal/pycore_bytes_methods.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_startswith' mangled-name='_Py_bytes_startswith' filepath='./Include/internal/pycore_bytes_methods.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_contains' mangled-name='_Py_bytes_contains' filepath='./Include/internal/pycore_bytes_methods.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_rindex' mangled-name='_Py_bytes_rindex' filepath='./Include/internal/pycore_bytes_methods.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_rfind' mangled-name='_Py_bytes_rfind' filepath='./Include/internal/pycore_bytes_methods.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_index' mangled-name='_Py_bytes_index' filepath='./Include/internal/pycore_bytes_methods.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_count' mangled-name='_Py_bytes_count' filepath='./Include/internal/pycore_bytes_methods.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_find' mangled-name='_Py_bytes_find' filepath='./Include/internal/pycore_bytes_methods.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='./Include/abstract.h' line='501' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_UnpackKeywords' mangled-name='_PyArg_UnpackKeywords' filepath='./Include/modsupport.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyLong_AsInt' mangled-name='_PyLong_AsInt' filepath='./Include/longobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_swapcase' mangled-name='_Py_bytes_swapcase' filepath='./Include/internal/pycore_bytes_methods.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' mangled-name='_Py_bytes_capitalize' filepath='./Include/internal/pycore_bytes_methods.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' mangled-name='_Py_bytes_title' filepath='./Include/internal/pycore_bytes_methods.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' mangled-name='_Py_bytes_upper' filepath='./Include/internal/pycore_bytes_methods.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' mangled-name='_Py_bytes_lower' filepath='./Include/internal/pycore_bytes_methods.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' mangled-name='_Py_bytes_istitle' filepath='./Include/internal/pycore_bytes_methods.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' mangled-name='_Py_bytes_isupper' filepath='./Include/internal/pycore_bytes_methods.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' mangled-name='_Py_bytes_islower' filepath='./Include/internal/pycore_bytes_methods.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' mangled-name='_Py_bytes_isdigit' filepath='./Include/internal/pycore_bytes_methods.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isascii' mangled-name='_Py_bytes_isascii' filepath='./Include/internal/pycore_bytes_methods.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' mangled-name='_Py_bytes_isalnum' filepath='./Include/internal/pycore_bytes_methods.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' mangled-name='_Py_bytes_isalpha' filepath='./Include/internal/pycore_bytes_methods.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' mangled-name='_Py_bytes_isspace' filepath='./Include/internal/pycore_bytes_methods.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='./Include/abstract.h' line='692' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_Print' mangled-name='PyErr_Print' filepath='./Include/pythonrun.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_GetConfig' mangled-name='_Py_GetConfig' filepath='./Include/cpython/pystate.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyErr_WarnEx' mangled-name='PyErr_WarnEx' filepath='./Include/warnings.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_AsEncodedString' mangled-name='PyUnicode_AsEncodedString' filepath='./Include/unicodeobject.h' line='409' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_ToContiguous' mangled-name='PyBuffer_ToContiguous' filepath='./Include/cpython/abstract.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyLong_AsLong' mangled-name='PyLong_AsLong' filepath='./Include/longobject.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_ParseTupleAndKeywords_SizeT' mangled-name='_PyArg_ParseTupleAndKeywords_SizeT' filepath='./Include/modsupport.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='./Include/abstract.h' line='372' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='./Include/abstract.h' line='394' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySlice_Unpack' mangled-name='PySlice_Unpack' filepath='./Include/sliceobject.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PySlice_AdjustIndices' mangled-name='PySlice_AdjustIndices' filepath='./Include/sliceobject.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_New' mangled-name='_PyObject_New' filepath='./Include/objimpl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeLatin1' mangled-name='PyUnicode_DecodeLatin1' filepath='./Include/unicodeobject.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_strhex_with_sep' mangled-name='_Py_strhex_with_sep' filepath='./Include/pystrhex.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_BadArgument' mangled-name='_PyArg_BadArgument' filepath='./Include/modsupport.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_FromEncodedObject' mangled-name='PyUnicode_FromEncodedObject' filepath='./Include/unicodeobject.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyUnicode_GetDefaultEncoding' mangled-name='PyUnicode_GetDefaultEncoding' filepath='./Include/unicodeobject.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyArg_CheckPositional' mangled-name='_PyArg_CheckPositional' filepath='./Include/modsupport.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyList_Reverse' mangled-name='PyList_Reverse' filepath='./Include/listobject.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='./Include/cpython/abstract.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_maketrans' mangled-name='_Py_bytes_maketrans' filepath='./Include/internal/pycore_bytes_methods.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='./Include/objimpl.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='./Include/abstract.h' line='836' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='./Include/cpython/abstract.h' line='325' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='./Include/cpython/bytesobject.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyEval_GetBuiltinId' mangled-name='_PyEval_GetBuiltinId' filepath='./Include/cpython/ceval.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='./Include/cpython/bytesobject.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='./Include/cpython/abstract.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='./Include/abstract.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Objects/bytesobject.c' comp-dir-path='/src' language='LANG_C99'>
    <var-decl name='PyBytes_Type' type-id='type-id-182' mangled-name='PyBytes_Type' visibility='default' filepath='./Include/bytesobject.h' line='30' column='1' elf-symbol-id='PyBytes_Type'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-182' mangled-name='PyBytesIter_Type' visibility='default' filepath='./Include/bytesobject.h' line='31' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <class-decl name='__anonymous_struct__' size-in-bits='4416' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-298' visibility='default' filepath='./Include/cpython/bytesobject.h' line='44' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-100' visibility='default' filepath='./Include/cpython/bytesobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-15' visibility='default' filepath='./Include/cpython/bytesobject.h' line='49' column='1'/>
      </data-member>
