<abi-corpus version='2.3' path='libpython3.12.so' soname='libpython3.12.so.1.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAIter_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_Parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_UnpackTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ValidateKeywordArguments' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAsyncGen_New' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='wcschr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscoll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcslen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcstok' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcstombs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsxfrm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wmemchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wmemcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdin' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='./Modules/_abc.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='_Py_FalseStruct' type-id='type-id-1' visibility='default' filepath='./Include/boolobject.h' line='17' column='1'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-1' visibility='default' filepath='./Include/boolobject.h' line='18' column='1'/>
    <var-decl name='_PyRuntime' type-id='type-id-2' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='192' column='1'/>
    <var-decl name='PyLong_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='226' column='1'/>
    <var-decl name='_Py_NoneStruct' type-id='type-id-4' visibility='default' filepath='./Include/object.h' line='842' column='1'/>
    <var-decl name='_Py_NotImplementedStruct' type-id='type-id-4' visibility='default' filepath='./Include/object.h' line='856' column='1'/>
    <var-decl name='PyExc_AssertionError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='89' column='1'/>
    <var-decl name='PyExc_RuntimeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='105' column='1'/>
    <var-decl name='PyExc_TypeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='116' column='1'/>
    <function-decl name='PyInit__abc' mangled-name='PyInit__abc' filepath='./Modules/_abc.c' line='964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__abc'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_codecsmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='Py_hexdigits' type-id='type-id-6' visibility='default' filepath='./Include/codecs.h' line='242' column='1'/>
    <var-decl name='PyExc_OverflowError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='104' column='1'/>
    <var-decl name='PyExc_ValueError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='122' column='1'/>
    <var-decl name='PyTuple_Type' type-id='type-id-3' visibility='default' filepath='./Include/tupleobject.h' line='23' column='1'/>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='./Modules/_codecsmodule.c' line='1069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_collectionsmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='PyODict_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/odictobject.h' line='15' column='1'/>
    <var-decl name='PyDict_Type' type-id='type-id-3' visibility='default' filepath='./Include/dictobject.h' line='15' column='1'/>
    <var-decl name='_Py_tss_tstate' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='76' column='1'/>
    <var-decl name='PyExc_StopIteration' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='84' column='1'/>
    <var-decl name='PyExc_AttributeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='90' column='1'/>
    <var-decl name='PyExc_IndexError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='99' column='1'/>
    <var-decl name='PyExc_KeyError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='100' column='1'/>
    <var-decl name='PyUnicode_Type' type-id='type-id-3' visibility='default' filepath='./Include/unicodeobject.h' line='111' column='1'/>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='./Modules/_collectionsmodule.c' line='2592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_functoolsmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='PyBaseObject_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='388' column='1'/>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='./Modules/_functoolsmodule.c' line='1540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-12'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/_iomodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='PyType_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='387' column='1'/>
    <var-decl name='PyExc_OSError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='94' column='1'/>
    <var-decl name='PyExc_BlockingIOError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='126' column='1'/>
    <var-decl name='PyExc_RuntimeWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='157' column='1'/>
    <var-decl name='PyExc_EncodingWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='162' column='1'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='./Modules/_io/_iomodule.c' line='736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io'>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='bufferediobase_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='12' column='1'/>
    <var-decl name='bufferedrandom_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='13' column='1'/>
    <var-decl name='bufferedreader_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='14' column='1'/>
    <var-decl name='bufferedrwpair_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='15' column='1'/>
    <var-decl name='bufferedwriter_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='16' column='1'/>
    <var-decl name='bytesio_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='17' column='1'/>
    <var-decl name='bytesiobuf_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='18' column='1'/>
    <var-decl name='fileio_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='19' column='1'/>
    <var-decl name='iobase_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='20' column='1'/>
    <var-decl name='nldecoder_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='21' column='1'/>
    <var-decl name='rawiobase_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='22' column='1'/>
    <var-decl name='stringio_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='23' column='1'/>
    <var-decl name='textiobase_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='24' column='1'/>
    <var-decl name='textiowrapper_spec' type-id='type-id-14' visibility='default' filepath='./Modules/_io/_iomodule.h' line='25' column='1'/>
    <var-decl name='_PyIO_Module' type-id='type-id-15' visibility='default' filepath='./Modules/_io/_iomodule.h' line='143' column='1'/>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bufferedio.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <class-decl name='_io_state' size-in-bits='1024' is-struct='yes' visibility='default' filepath='./Modules/_io/_iomodule.h' line='145' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-16' visibility='default' filepath='./Modules/_io/_iomodule.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unsupported_operation' type-id='type-id-5' visibility='default' filepath='./Modules/_io/_iomodule.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='PyIOBase_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='PyRawIOBase_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='PyBufferedIOBase_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='PyBufferedRWPair_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='PyBufferedRandom_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='PyBufferedReader_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='PyBufferedWriter_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PyBytesIOBuffer_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='PyBytesIO_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='PyFileIO_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='PyStringIO_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='PyTextIOBase_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='PyTextIOWrapper_Type' type-id='type-id-19' visibility='default' filepath='./Modules/_io/_iomodule.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Py_off_t' type-id='type-id-20' filepath='./Modules/_io/_iomodule.h' line='109' column='1' id='type-id-21'/>
    <typedef-decl name='_PyIO_State' type-id='type-id-18' filepath='./Modules/_io/_iomodule.h' line='35' column='1' id='type-id-22'/>
    <typedef-decl name='off_t' type-id='type-id-23' filepath='/usr/include/sys/types.h' line='87' column='1' id='type-id-20'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-24'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-10' filepath='./Include/pythread.h' line='4' column='1' id='type-id-25'/>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='memchr' filepath='/usr/include/string.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memchr'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bytesio.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='PyBytes_Type' type-id='type-id-3' visibility='default' filepath='./Include/bytesobject.h' line='27' column='1'/>
    <var-decl name='PyExc_BufferError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='91' column='1'/>
    <var-decl name='PyExc_SystemError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='114' column='1'/>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/fileio.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='PyExc_Warning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='152' column='1'/>
    <var-decl name='_Py_open_cloexec_works' type-id='type-id-16' visibility='default' filepath='./Modules/_io/fileio.c' line='203' column='1'/>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='isatty' filepath='/usr/include/unistd.h' line='809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isatty'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='ftruncate' mangled-name='ftruncate64' filepath='/usr/include/unistd.h' line='1052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftruncate64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/iobase.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-27' visibility='default' filepath='./Include/cpython/bytearrayobject.h' line='14' column='1'/>
    <var-decl name='PyExc_NotImplementedError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='109' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/stringio.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/textio.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='PyList_Type' type-id='type-id-3' visibility='default' filepath='./Include/listobject.h' line='20' column='1'/>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_localemodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='./Modules/_localemodule.c' line='916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nl_langinfo'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dcgettext'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='textdomain' filepath='/usr/include/libintl.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='textdomain'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='bindtextdomain' filepath='/usr/include/libintl.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bindtextdomain'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='bind_textdomain_codeset' filepath='/usr/include/libintl.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bind_textdomain_codeset'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setlocale'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='localeconv'>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscoll'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsxfrm'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcslen'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_operator.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='./Modules/_operator.c' line='1879' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_sre/sre.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='_Py_ctype_table' type-id='type-id-33' visibility='default' filepath='./Include/cpython/pyctype.h' line='16' column='1'/>
    <var-decl name='_Py_ctype_tolower' type-id='type-id-34' visibility='default' filepath='./Include/cpython/pyctype.h' line='29' column='1'/>
    <var-decl name='_Py_ascii_whitespace' type-id='type-id-35' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='905' column='1'/>
    <var-decl name='PyExc_RecursionError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='107' column='1'/>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='./Modules/_sre/sre.c' line='3246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc'>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_tolower_loc'>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='__ctype_toupper_loc' filepath='/usr/include/ctype.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_toupper_loc'>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_stat.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='./Modules/_stat.c' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_threadmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='PyExc_SystemExit' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='115' column='1'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-10' filepath='./Include/pythread.h' line='4' column='1' id='type-id-38'/>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='./Modules/_threadmodule.c' line='1785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='floor' filepath='/usr/include/bits/mathcalls.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floor'>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-40'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_tracemalloc.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='./Modules/_tracemalloc.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_typingmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='_PyTypeAlias_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_typevarobject.h' line='19' column='1'/>
    <function-decl name='PyInit__typing' mangled-name='PyInit__typing' filepath='./Modules/_typingmodule.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__typing'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_weakref.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='_PyWeakref_RefType' type-id='type-id-3' visibility='default' filepath='./Include/weakrefobject.h' line='11' column='1'/>
    <var-decl name='_PyWeakref_ProxyType' type-id='type-id-3' visibility='default' filepath='./Include/weakrefobject.h' line='12' column='1'/>
    <var-decl name='_PyWeakref_CallableProxyType' type-id='type-id-3' visibility='default' filepath='./Include/weakrefobject.h' line='13' column='1'/>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='./Modules/_weakref.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-41'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/atexitmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='_Py_AtExit' mangled-name='_Py_AtExit' filepath='./Modules/atexitmodule.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_AtExit'>
      <parameter type-id='type-id-42' name='interp' filepath='./Modules/atexitmodule.c' line='27' column='1'/>
      <parameter type-id='type-id-43' name='func' filepath='./Modules/atexitmodule.c' line='28' column='1'/>
      <parameter type-id='type-id-10' name='data' filepath='./Modules/atexitmodule.c' line='28' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='./Modules/atexitmodule.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/errnomodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='./Modules/errnomodule.c' line='974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/faulthandler.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <enum-decl name='__rlimit_resource' filepath='/usr/include/bits/resource.h' line='31' column='1' id='type-id-44'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='RLIMIT_CPU' value='0'/>
      <enumerator name='RLIMIT_FSIZE' value='1'/>
      <enumerator name='RLIMIT_DATA' value='2'/>
      <enumerator name='RLIMIT_STACK' value='3'/>
      <enumerator name='RLIMIT_CORE' value='4'/>
      <enumerator name='__RLIMIT_RSS' value='5'/>
      <enumerator name='RLIMIT_NOFILE' value='7'/>
      <enumerator name='__RLIMIT_OFILE' value='7'/>
      <enumerator name='RLIMIT_AS' value='9'/>
      <enumerator name='__RLIMIT_NPROC' value='6'/>
      <enumerator name='__RLIMIT_MEMLOCK' value='8'/>
      <enumerator name='__RLIMIT_LOCKS' value='10'/>
      <enumerator name='__RLIMIT_SIGPENDING' value='11'/>
      <enumerator name='__RLIMIT_MSGQUEUE' value='12'/>
      <enumerator name='__RLIMIT_NICE' value='13'/>
      <enumerator name='__RLIMIT_RTPRIO' value='14'/>
      <enumerator name='__RLIMIT_RTTIME' value='15'/>
      <enumerator name='__RLIMIT_NLIMITS' value='16'/>
      <enumerator name='__RLIM_NLIMITS' value='16'/>
    </enum-decl>
    <class-decl name='rlimit' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/resource.h' line='139' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rlim_cur' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/resource.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rlim_max' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/resource.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__rlim64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='158' column='1' id='type-id-48'/>
    <typedef-decl name='__rlimit_resource_t' type-id='type-id-44' filepath='/usr/include/sys/resource.h' line='38' column='1' id='type-id-49'/>
    <typedef-decl name='rlim_t' type-id='type-id-48' filepath='/usr/include/bits/resource.h' line='133' column='1' id='type-id-47'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <qualified-type-def type-id='type-id-51' restrict='yes' id='type-id-52'/>
    <qualified-type-def type-id='type-id-50' const='yes' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <qualified-type-def type-id='type-id-54' restrict='yes' id='type-id-55'/>
    <qualified-type-def type-id='type-id-46' const='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-57'/>
    <qualified-type-def type-id='type-id-58' const='yes' id='type-id-59'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <qualified-type-def type-id='type-id-60' restrict='yes' id='type-id-61'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-63'/>
    <qualified-type-def type-id='type-id-63' restrict='yes' id='type-id-64'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-10' filepath='./Include/pythread.h' line='4' column='1' id='type-id-65'/>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='./Modules/faulthandler.c' line='1299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_sigmask' filepath='/usr/include/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_sigmask'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='raise' filepath='/usr/include/signal.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='raise'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigemptyset' filepath='/usr/include/signal.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigemptyset'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigfillset' filepath='/usr/include/signal.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigfillset'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigaction' filepath='/usr/include/signal.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaction'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigaltstack' filepath='/usr/include/signal.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaltstack'>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getauxval' filepath='/usr/include/sys/auxv.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getauxval'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getrlimit' mangled-name='getrlimit64' filepath='/usr/include/sys/resource.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrlimit64'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setrlimit' mangled-name='setrlimit64' filepath='/usr/include/sys/resource.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setrlimit64'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_exit' filepath='/usr/include/unistd.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_exit'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysconf'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-69'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-70'/>
    <type-decl name='int' size-in-bits='32' id='type-id-16'/>
    <typedef-decl name='size_t' type-id='type-id-11' filepath='/usr/lib/gcc/x86_64-redhat-linux/14/include/stddef.h' line='214' column='1' id='type-id-7'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-11'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-17'/>
    <qualified-type-def type-id='type-id-70' const='yes' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-6'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_Py_gitversion' mangled-name='_Py_gitversion' filepath='./Modules/getbuildinfo.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitversion'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-6'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-72'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getpath.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <class-decl name='_PyInterpreterFrame' size-in-bits='640' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_frame.h' line='51' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_code' type-id='type-id-74' visibility='default' filepath='./Include/internal/pycore_frame.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='previous' type-id='type-id-75' visibility='default' filepath='./Include/internal/pycore_frame.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_funcobj' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_globals' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_builtins' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_locals' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='frame_obj' type-id='type-id-76' visibility='default' filepath='./Include/internal/pycore_frame.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='prev_instr' type-id='type-id-77' visibility='default' filepath='./Include/internal/pycore_frame.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stacktop' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_frame.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='return_offset' type-id='type-id-78' visibility='default' filepath='./Include/internal/pycore_frame.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='owner' type-id='type-id-70' visibility='default' filepath='./Include/internal/pycore_frame.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='localsplus' type-id='type-id-79' visibility='default' filepath='./Include/internal/pycore_frame.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_frame' size-in-bits='448' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_frame.h' line='16' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_back' type-id='type-id-76' visibility='default' filepath='./Include/internal/pycore_frame.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_frame' type-id='type-id-75' visibility='default' filepath='./Include/internal/pycore_frame.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_trace' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_lineno' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_frame.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='f_trace_lines' type-id='type-id-70' visibility='default' filepath='./Include/internal/pycore_frame.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='f_trace_opcodes' type-id='type-id-70' visibility='default' filepath='./Include/internal/pycore_frame.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='f_fast_as_locals' type-id='type-id-70' visibility='default' filepath='./Include/internal/pycore_frame.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_f_frame_data' type-id='type-id-79' visibility='default' filepath='./Include/internal/pycore_frame.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_is' size-in-bits='3068416' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='75' column='1' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-42' visibility='default' filepath='./Include/internal/pycore_interp.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-82' visibility='default' filepath='./Include/internal/pycore_interp.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id_refcount' type-id='type-id-82' visibility='default' filepath='./Include/internal/pycore_interp.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='requires_idref' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='id_mutex' type-id='type-id-83' visibility='default' filepath='./Include/internal/pycore_interp.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_initialized' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='finalizing' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='monitoring_version' type-id='type-id-84' visibility='default' filepath='./Include/internal/pycore_interp.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='last_restart_version' type-id='type-id-84' visibility='default' filepath='./Include/internal/pycore_interp.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='threads' type-id='type-id-85' visibility='default' filepath='./Include/internal/pycore_interp.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='runtime' type-id='type-id-86' visibility='default' filepath='./Include/internal/pycore_interp.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_finalizing' type-id='type-id-87' visibility='default' filepath='./Include/internal/pycore_interp.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='gc' type-id='type-id-88' visibility='default' filepath='./Include/internal/pycore_interp.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='sysdict' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='builtins' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='ceval' type-id='type-id-89' visibility='default' filepath='./Include/internal/pycore_interp.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='imports' type-id='type-id-90' visibility='default' filepath='./Include/internal/pycore_interp.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='_gil' type-id='type-id-91' visibility='default' filepath='./Include/internal/pycore_interp.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9984'>
        <var-decl name='codec_search_path' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10048'>
        <var-decl name='codec_search_cache' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='codec_error_registry' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10176'>
        <var-decl name='codecs_initialized' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_interp.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10240'>
        <var-decl name='config' type-id='type-id-92' visibility='default' filepath='./Include/internal/pycore_interp.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13696'>
        <var-decl name='feature_flags' type-id='type-id-11' visibility='default' filepath='./Include/internal/pycore_interp.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13760'>
        <var-decl name='dict' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13824'>
        <var-decl name='sysdict_copy' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='builtins_copy' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13952'>
        <var-decl name='eval_frame' type-id='type-id-93' visibility='default' filepath='./Include/internal/pycore_interp.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14016'>
        <var-decl name='func_watchers' type-id='type-id-94' visibility='default' filepath='./Include/internal/pycore_interp.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14528'>
        <var-decl name='active_func_watchers' type-id='type-id-95' visibility='default' filepath='./Include/internal/pycore_interp.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14592'>
        <var-decl name='co_extra_user_count' type-id='type-id-96' visibility='default' filepath='./Include/internal/pycore_interp.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14656'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-97' visibility='default' filepath='./Include/internal/pycore_interp.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30976'>
        <var-decl name='before_forkers' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31040'>
        <var-decl name='after_forkers_parent' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31104'>
        <var-decl name='after_forkers_child' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31168'>
        <var-decl name='warnings' type-id='type-id-98' visibility='default' filepath='./Include/internal/pycore_interp.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31424'>
        <var-decl name='atexit' type-id='type-id-99' visibility='default' filepath='./Include/internal/pycore_interp.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31680'>
        <var-decl name='obmalloc' type-id='type-id-100' visibility='default' filepath='./Include/internal/pycore_interp.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2137664'>
        <var-decl name='audit_hooks' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2137728'>
        <var-decl name='type_watchers' type-id='type-id-101' visibility='default' filepath='./Include/internal/pycore_interp.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2138240'>
        <var-decl name='code_watchers' type-id='type-id-102' visibility='default' filepath='./Include/internal/pycore_interp.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2138752'>
        <var-decl name='active_code_watchers' type-id='type-id-95' visibility='default' filepath='./Include/internal/pycore_interp.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2138784'>
        <var-decl name='object_state' type-id='type-id-103' visibility='default' filepath='./Include/internal/pycore_interp.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2138816'>
        <var-decl name='unicode' type-id='type-id-104' visibility='default' filepath='./Include/internal/pycore_interp.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2139264'>
        <var-decl name='float_state' type-id='type-id-105' visibility='default' filepath='./Include/internal/pycore_interp.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2139392'>
        <var-decl name='long_state' type-id='type-id-106' visibility='default' filepath='./Include/internal/pycore_interp.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2139456'>
        <var-decl name='dtoa' type-id='type-id-107' visibility='default' filepath='./Include/internal/pycore_interp.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2158528'>
        <var-decl name='func_state' type-id='type-id-108' visibility='default' filepath='./Include/internal/pycore_interp.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2158592'>
        <var-decl name='slice_cache' type-id='type-id-109' visibility='default' filepath='./Include/internal/pycore_interp.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2158656'>
        <var-decl name='tuple' type-id='type-id-110' visibility='default' filepath='./Include/internal/pycore_interp.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160576'>
        <var-decl name='list' type-id='type-id-111' visibility='default' filepath='./Include/internal/pycore_interp.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2165760'>
        <var-decl name='dict_state' type-id='type-id-112' visibility='default' filepath='./Include/internal/pycore_interp.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176704'>
        <var-decl name='async_gen' type-id='type-id-113' visibility='default' filepath='./Include/internal/pycore_interp.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2187072'>
        <var-decl name='context' type-id='type-id-114' visibility='default' filepath='./Include/internal/pycore_interp.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2187200'>
        <var-decl name='exc_state' type-id='type-id-115' visibility='default' filepath='./Include/internal/pycore_interp.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2187456'>
        <var-decl name='ast' type-id='type-id-116' visibility='default' filepath='./Include/internal/pycore_interp.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2203072'>
        <var-decl name='types' type-id='type-id-117' visibility='default' filepath='./Include/internal/pycore_interp.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3053632'>
        <var-decl name='callable_cache' type-id='type-id-118' visibility='default' filepath='./Include/internal/pycore_interp.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3053888'>
        <var-decl name='interpreter_trampoline' type-id='type-id-74' visibility='default' filepath='./Include/internal/pycore_interp.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3053952'>
        <var-decl name='monitors' type-id='type-id-119' visibility='default' filepath='./Include/internal/pycore_interp.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3054072'>
        <var-decl name='f_opcode_trace_set' type-id='type-id-120' visibility='default' filepath='./Include/internal/pycore_interp.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3054080'>
        <var-decl name='sys_profile_initialized' type-id='type-id-120' visibility='default' filepath='./Include/internal/pycore_interp.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3054088'>
        <var-decl name='sys_trace_initialized' type-id='type-id-120' visibility='default' filepath='./Include/internal/pycore_interp.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3054144'>
        <var-decl name='sys_profiling_threads' type-id='type-id-96' visibility='default' filepath='./Include/internal/pycore_interp.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3054208'>
        <var-decl name='sys_tracing_threads' type-id='type-id-96' visibility='default' filepath='./Include/internal/pycore_interp.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3054272'>
        <var-decl name='monitoring_callables' type-id='type-id-121' visibility='default' filepath='./Include/internal/pycore_interp.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3062976'>
        <var-decl name='monitoring_tool_names' type-id='type-id-122' visibility='default' filepath='./Include/internal/pycore_interp.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3063488'>
        <var-decl name='cached_objects' type-id='type-id-123' visibility='default' filepath='./Include/internal/pycore_interp.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3064768'>
        <var-decl name='static_objects' type-id='type-id-124' visibility='default' filepath='./Include/internal/pycore_interp.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3065856'>
        <var-decl name='xidregistry' type-id='type-id-125' visibility='default' filepath='./Include/internal/pycore_interp.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3065984'>
        <var-decl name='threads_main' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3066048'>
        <var-decl name='_finalizing_id' type-id='type-id-87' visibility='default' filepath='./Include/internal/pycore_interp.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3066112'>
        <var-decl name='_initial_thread' type-id='type-id-126' visibility='default' filepath='./Include/internal/pycore_interp.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-10' restrict='yes' id='type-id-127'/>
    <var-decl name='PyCode_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/code.h' line='212' column='1'/>
    <var-decl name='PyExc_MemoryError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='102' column='1'/>
    <function-decl name='_Py_Get_Getpath_CodeObject' mangled-name='_Py_Get_Getpath_CodeObject' filepath='./Modules/getpath.c' line='795' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Get_Getpath_CodeObject'>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='stderr' type-id='type-id-128' visibility='default' filepath='/usr/include/stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose'>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf'>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread'>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='unsetenv' filepath='/usr/include/stdlib.h' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unsetenv'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscpy'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscmp'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wcschr' filepath='/usr/include/wchar.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcschr'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='wcsrchr' filepath='/usr/include/wchar.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsrchr'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/itertoolsmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove'>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='PyBool_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='227' column='1'/>
    <var-decl name='PyExc_DeprecationWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='154' column='1'/>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='./Modules/itertoolsmodule.c' line='4768' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/posixmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-133' size-in-bits='1024' id='type-id-134'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-11' id='type-id-135'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='256' id='type-id-137'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-11' id='type-id-138'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='2048' id='type-id-139'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-11' id='type-id-140'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='520' id='type-id-141'>
      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-11' id='type-id-142'/>
    </array-type-def>
    <enum-decl name='__priority_which' filepath='/usr/include/bits/resource.h' line='187' column='1' id='type-id-143'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='PRIO_PROCESS' value='0'/>
      <enumerator name='PRIO_PGRP' value='1'/>
      <enumerator name='PRIO_USER' value='2'/>
    </enum-decl>
    <enum-decl name='idtype_t' naming-typedef-id='type-id-144' filepath='/usr/include/bits/types/idtype_t.h' line='6' column='1' id='type-id-145'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='P_ALL' value='0'/>
      <enumerator name='P_PID' value='1'/>
      <enumerator name='P_PGID' value='2'/>
      <enumerator name='P_PIDFD' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='480' id='type-id-146'>
      <subrange length='15' lower-bound='0' upper-bound='14' type-id='type-id-11' id='type-id-147'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='512' id='type-id-148'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-11' id='type-id-135'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='160' id='type-id-149'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-11' id='type-id-150'/>
    </array-type-def>
    <class-decl name='cpu_set_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-151' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='39' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-134' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/bits/dirent.h' line='22' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-154' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-156' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-139' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_iovec.h' line='26' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/types/struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='posix_spawn_file_actions_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' filepath='/usr/include/spawn.h' line='44' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__allocated' type-id='type-id-16' visibility='default' filepath='/usr/include/spawn.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__used' type-id='type-id-16' visibility='default' filepath='/usr/include/spawn.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__actions' type-id='type-id-160' visibility='default' filepath='/usr/include/spawn.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__pad' type-id='type-id-148' visibility='default' filepath='/usr/include/spawn.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='posix_spawnattr_t' size-in-bits='2688' is-struct='yes' naming-typedef-id='type-id-161' visibility='default' filepath='/usr/include/spawn.h' line='29' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__flags' type-id='type-id-163' visibility='default' filepath='/usr/include/spawn.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__pgrp' type-id='type-id-164' visibility='default' filepath='/usr/include/spawn.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__sd' type-id='type-id-165' visibility='default' filepath='/usr/include/spawn.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__ss' type-id='type-id-165' visibility='default' filepath='/usr/include/spawn.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='__sp' type-id='type-id-166' visibility='default' filepath='/usr/include/spawn.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='__policy' type-id='type-id-16' visibility='default' filepath='/usr/include/spawn.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='__cgroup' type-id='type-id-16' visibility='default' filepath='/usr/include/spawn.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='__pad' type-id='type-id-146' visibility='default' filepath='/usr/include/spawn.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rusage' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='33' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ru_utime' type-id='type-id-168' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ru_stime' type-id='type-id-168' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-170' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-171' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='' type-id='type-id-172' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='' type-id='type-id-173' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='' type-id='type-id-174' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='' type-id='type-id-175' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-176' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='' type-id='type-id-177' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='' type-id='type-id-178' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='' type-id='type-id-179' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='' type-id='type-id-180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='type-id-181' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='' type-id='type-id-182' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_sched_param.h' line='23' column='1' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-16' visibility='default' filepath='/usr/include/bits/types/struct_sched_param.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='statvfs' size-in-bits='896' is-struct='yes' visibility='default' filepath='/usr/include/bits/statvfs.h' line='29' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_bsize' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/statvfs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_frsize' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/statvfs.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-184' visibility='default' filepath='/usr/include/bits/statvfs.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-184' visibility='default' filepath='/usr/include/bits/statvfs.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-184' visibility='default' filepath='/usr/include/bits/statvfs.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-185' visibility='default' filepath='/usr/include/bits/statvfs.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-185' visibility='default' filepath='/usr/include/bits/statvfs.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_favail' type-id='type-id-185' visibility='default' filepath='/usr/include/bits/statvfs.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_fsid' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/statvfs.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_flag' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/statvfs.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_namemax' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/statvfs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_type' type-id='type-id-186' visibility='default' filepath='/usr/include/bits/statvfs.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='__f_spare' type-id='type-id-149' visibility='default' filepath='/usr/include/bits/statvfs.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='termios' size-in-bits='480' is-struct='yes' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='24' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-136' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-137' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tms' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/sys/times.h' line='32' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tms_utime' type-id='type-id-191' visibility='default' filepath='/usr/include/sys/times.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tms_stime' type-id='type-id-191' visibility='default' filepath='/usr/include/sys/times.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tms_cutime' type-id='type-id-191' visibility='default' filepath='/usr/include/sys/times.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tms_cstime' type-id='type-id-191' visibility='default' filepath='/usr/include/sys/times.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/sys/utsname.h' line='48' column='1' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-141' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-141' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-141' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-141' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-141' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='type-id-141' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='winsize' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='27' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ws_row' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ws_col' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ws_xpixel' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ws_ypixel' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__compar_fn_t' type-id='type-id-194' filepath='/usr/include/stdlib.h' line='948' column='1' id='type-id-195'/>
    <typedef-decl name='__cpu_mask' type-id='type-id-11' filepath='/usr/include/bits/cpu-set.h' line='32' column='1' id='type-id-133'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='185' column='1' id='type-id-184'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='189' column='1' id='type-id-185'/>
    <typedef-decl name='__id_t' type-id='type-id-186' filepath='/usr/include/bits/types.h' line='159' column='1' id='type-id-196'/>
    <typedef-decl name='__priority_which_t' type-id='type-id-143' filepath='/usr/include/sys/resource.h' line='40' column='1' id='type-id-197'/>
    <typedef-decl name='cc_t' type-id='type-id-156' filepath='/usr/include/bits/termios.h' line='23' column='1' id='type-id-136'/>
    <typedef-decl name='clock_t' type-id='type-id-198' filepath='/usr/include/bits/types/clock_t.h' line='7' column='1' id='type-id-191'/>
    <typedef-decl name='cpu_set_t' type-id='type-id-152' filepath='/usr/include/bits/cpu-set.h' line='42' column='1' id='type-id-151'/>
    <typedef-decl name='eventfd_t' type-id='type-id-84' filepath='/usr/include/sys/eventfd.h' line='27' column='1' id='type-id-199'/>
    <typedef-decl name='gid_t' type-id='type-id-200' filepath='/usr/include/sys/types.h' line='64' column='1' id='type-id-201'/>
    <typedef-decl name='id_t' type-id='type-id-196' filepath='/usr/include/sys/types.h' line='103' column='1' id='type-id-202'/>
    <typedef-decl name='idtype_t' type-id='type-id-145' filepath='/usr/include/bits/types/idtype_t.h' line='12' column='1' id='type-id-144'/>
    <typedef-decl name='mode_t' type-id='type-id-203' filepath='/usr/include/sys/types.h' line='69' column='1' id='type-id-204'/>
    <typedef-decl name='pid_t' type-id='type-id-205' filepath='/usr/include/sys/types.h' line='97' column='1' id='type-id-164'/>
    <typedef-decl name='posix_spawn_file_actions_t' type-id='type-id-159' filepath='/usr/include/spawn.h' line='50' column='1' id='type-id-158'/>
    <typedef-decl name='posix_spawnattr_t' type-id='type-id-162' filepath='/usr/include/spawn.h' line='39' column='1' id='type-id-161'/>
    <typedef-decl name='speed_t' type-id='type-id-186' filepath='/usr/include/bits/termios.h' line='24' column='1' id='type-id-189'/>
    <typedef-decl name='tcflag_t' type-id='type-id-186' filepath='/usr/include/bits/termios.h' line='25' column='1' id='type-id-188'/>
    <typedef-decl name='uid_t' type-id='type-id-206' filepath='/usr/include/sys/types.h' line='79' column='1' id='type-id-207'/>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='53' column='1' id='type-id-171'>
      <data-member access='public'>
        <var-decl name='ru_idrss' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_idrss_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='56' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='85' column='1' id='type-id-176'>
      <data-member access='public'>
        <var-decl name='ru_inblock' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_inblock_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='88' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='59' column='1' id='type-id-172'>
      <data-member access='public'>
        <var-decl name='ru_isrss' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='61' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_isrss_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='62' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='47' column='1' id='type-id-170'>
      <data-member access='public'>
        <var-decl name='ru_ixrss' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_ixrss_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='50' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='72' column='1' id='type-id-174'>
      <data-member access='public'>
        <var-decl name='ru_majflt' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='74' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_majflt_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='75' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='40' column='1' id='type-id-169'>
      <data-member access='public'>
        <var-decl name='ru_maxrss' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='42' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_maxrss_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='43' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='66' column='1' id='type-id-173'>
      <data-member access='public'>
        <var-decl name='ru_minflt' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='68' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_minflt_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='69' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__11' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='103' column='1' id='type-id-179'>
      <data-member access='public'>
        <var-decl name='ru_msgrcv' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='105' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_msgrcv_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='106' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__10' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='97' column='1' id='type-id-178'>
      <data-member access='public'>
        <var-decl name='ru_msgsnd' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='99' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_msgsnd_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='100' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__14' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='124' column='1' id='type-id-182'>
      <data-member access='public'>
        <var-decl name='ru_nivcsw' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='126' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nivcsw_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='127' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__12' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='109' column='1' id='type-id-180'>
      <data-member access='public'>
        <var-decl name='ru_nsignals' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='111' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nsignals_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='112' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='78' column='1' id='type-id-175'>
      <data-member access='public'>
        <var-decl name='ru_nswap' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nswap_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='81' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__13' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='117' column='1' id='type-id-181'>
      <data-member access='public'>
        <var-decl name='ru_nvcsw' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='119' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nvcsw_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='120' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__9' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='91' column='1' id='type-id-177'>
      <data-member access='public'>
        <var-decl name='ru_oublock' type-id='type-id-69' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='93' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_oublock_word' type-id='type-id-208' visibility='default' filepath='/usr/include/bits/types/struct_rusage.h' line='94' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-209'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-211'/>
    <qualified-type-def type-id='type-id-212' restrict='yes' id='type-id-213'/>
    <qualified-type-def type-id='type-id-200' const='yes' id='type-id-214'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-215'/>
    <qualified-type-def type-id='type-id-151' const='yes' id='type-id-216'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <qualified-type-def type-id='type-id-157' const='yes' id='type-id-218'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <qualified-type-def type-id='type-id-158' const='yes' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <qualified-type-def type-id='type-id-221' restrict='yes' id='type-id-222'/>
    <qualified-type-def type-id='type-id-161' const='yes' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <qualified-type-def type-id='type-id-224' restrict='yes' id='type-id-225'/>
    <qualified-type-def type-id='type-id-166' const='yes' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-227'/>
    <qualified-type-def type-id='type-id-227' restrict='yes' id='type-id-228'/>
    <qualified-type-def type-id='type-id-165' const='yes' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-230'/>
    <qualified-type-def type-id='type-id-230' restrict='yes' id='type-id-231'/>
    <qualified-type-def type-id='type-id-187' const='yes' id='type-id-232'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <qualified-type-def type-id='type-id-193' const='yes' id='type-id-234'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-240'/>
    <qualified-type-def type-id='type-id-240' restrict='yes' id='type-id-241'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-242'/>
    <qualified-type-def type-id='type-id-242' restrict='yes' id='type-id-243'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-244'/>
    <qualified-type-def type-id='type-id-244' restrict='yes' id='type-id-245'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-248'/>
    <qualified-type-def type-id='type-id-248' restrict='yes' id='type-id-249'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-251'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-160'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-256'/>
    <class-decl name='__spawn_action' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-255'/>
    <qualified-type-def type-id='type-id-10' restrict='yes' id='type-id-257'/>
    <var-decl name='PyExc_FileNotFoundError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='134' column='1'/>
    <var-decl name='PyStructSequence_UnnamedField' type-id='type-id-258' visibility='default' filepath='./Include/structseq.h' line='22' column='1'/>
    <function-decl name='PyOS_BeforeFork' mangled-name='PyOS_BeforeFork' filepath='./Modules/posixmodule.c' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_BeforeFork'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Parent' mangled-name='PyOS_AfterFork_Parent' filepath='./Modules/posixmodule.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Parent'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Child' mangled-name='PyOS_AfterFork_Child' filepath='./Modules/posixmodule.c' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Child'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='./Modules/posixmodule.c' line='673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='./Modules/posixmodule.c' line='694' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid'>
      <parameter type-id='type-id-207' name='uid' filepath='./Modules/posixmodule.c' line='694' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='./Modules/posixmodule.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-5' name='obj' filepath='./Modules/posixmodule.c' line='710' column='1'/>
      <parameter type-id='type-id-251' name='p' filepath='./Modules/posixmodule.c' line='710' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='./Modules/posixmodule.c' line='816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-5' name='obj' filepath='./Modules/posixmodule.c' line='816' column='1'/>
      <parameter type-id='type-id-239' name='p' filepath='./Modules/posixmodule.c' line='816' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_Py_Sigset_Converter' mangled-name='_Py_Sigset_Converter' filepath='./Modules/posixmodule.c' line='1529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Sigset_Converter'>
      <parameter type-id='type-id-5' name='obj' filepath='./Modules/posixmodule.c' line='1529' column='1'/>
      <parameter type-id='type-id-10' name='addr' filepath='./Modules/posixmodule.c' line='1529' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyOS_FSPath' mangled-name='PyOS_FSPath' filepath='./Modules/posixmodule.c' line='15595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FSPath'>
      <parameter type-id='type-id-5' name='path' filepath='./Modules/posixmodule.c' line='15595' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='./Modules/posixmodule.c' line='17099' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__sched_cpucount' filepath='/usr/include/bits/cpu-set.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpucount'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__sched_cpualloc' filepath='/usr/include/bits/cpu-set.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpualloc'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <function-decl name='__sched_cpufree' filepath='/usr/include/bits/cpu-set.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpufree'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='splice' filepath='/usr/include/bits/fcntl-linux.h' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='splice'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='memfd_create' filepath='/usr/include/bits/mman-shared.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memfd_create'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='unshare' filepath='/usr/include/bits/sched.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unshare'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setns' filepath='/usr/include/bits/sched.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setns'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-256' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-253'/>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='fdopendir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdopendir'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='rewinddir' filepath='/usr/include/dirent.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rewinddir'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat64' filepath='/usr/include/fcntl.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openat64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_fadvise' mangled-name='posix_fadvise64' filepath='/usr/include/fcntl.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_fadvise64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_fallocate' mangled-name='posix_fallocate64' filepath='/usr/include/fcntl.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_fallocate64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setgroups' filepath='/usr/include/grp.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setgroups'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-215'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getgrouplist' filepath='/usr/include/grp.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgrouplist'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='initgroups' filepath='/usr/include/grp.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initgroups'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='openpty' filepath='/usr/include/pty.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openpty'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='forkpty' filepath='/usr/include/pty.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='forkpty'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_setparam' filepath='/usr/include/sched.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setparam'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-227'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_getparam' filepath='/usr/include/sched.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getparam'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_setscheduler' filepath='/usr/include/sched.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setscheduler'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-227'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_getscheduler' filepath='/usr/include/sched.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getscheduler'>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_get_priority_max' filepath='/usr/include/sched.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_get_priority_max'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_get_priority_min' filepath='/usr/include/sched.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_get_priority_min'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_rr_get_interval' filepath='/usr/include/sched.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_rr_get_interval'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_setaffinity' filepath='/usr/include/sched.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setaffinity'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sched_getaffinity' filepath='/usr/include/sched.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getaffinity'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kill'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='killpg' filepath='/usr/include/signal.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='killpg'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigaddset' filepath='/usr/include/signal.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaddset'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawn' filepath='/usr/include/spawn.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnp' filepath='/usr/include/spawn.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnp'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_init' filepath='/usr/include/spawn.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_init'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_destroy' filepath='/usr/include/spawn.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_destroy'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setsigdefault' filepath='/usr/include/spawn.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setsigdefault'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setsigmask' filepath='/usr/include/spawn.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setsigmask'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setflags' filepath='/usr/include/spawn.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setflags'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-163'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setpgroup' filepath='/usr/include/spawn.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setpgroup'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setschedpolicy' filepath='/usr/include/spawn.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setschedpolicy'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setschedparam' filepath='/usr/include/spawn.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setschedparam'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_init' filepath='/usr/include/spawn.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_init'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_destroy' filepath='/usr/include/spawn.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_destroy'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addopen' filepath='/usr/include/spawn.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_addopen'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-204'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addclose' filepath='/usr/include/spawn.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_addclose'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_adddup2' filepath='/usr/include/spawn.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_adddup2'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <var-decl name='stdout' type-id='type-id-128' visibility='default' filepath='/usr/include/stdio.h' line='150' column='1' elf-symbol-id='stdout'/>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rename'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='renameat' filepath='/usr/include/stdio.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='renameat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno'>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='ctermid' filepath='/usr/include/stdio.h' line='911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ctermid'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='__isoc23_strtol' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtol'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='setenv' filepath='/usr/include/stdlib.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setenv'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='system'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='qsort'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-195'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getloadavg' filepath='/usr/include/stdlib.h' line='1145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getloadavg'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strtok_r' filepath='/usr/include/string.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strtok_r'>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='eventfd' filepath='/usr/include/sys/eventfd.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='eventfd'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='eventfd_read' filepath='/usr/include/sys/eventfd.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='eventfd_read'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='eventfd_write' filepath='/usr/include/sys/eventfd.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='eventfd_write'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-199'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-11'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getpriority' filepath='/usr/include/sys/resource.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpriority'>
      <parameter type-id='type-id-197'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setpriority' filepath='/usr/include/sys/resource.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpriority'>
      <parameter type-id='type-id-197'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sendfile' mangled-name='sendfile64' filepath='/usr/include/sys/sendfile.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sendfile64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-267'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fstatat' mangled-name='fstatat64' filepath='/usr/include/sys/stat.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstatat64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='lstat' mangled-name='lstat64' filepath='/usr/include/sys/stat.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lstat64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-266'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='chmod' filepath='/usr/include/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chmod'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fchmod' filepath='/usr/include/sys/stat.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchmod'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fchmodat' filepath='/usr/include/sys/stat.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchmodat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='umask' filepath='/usr/include/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='umask'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-203'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/sys/stat.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdir'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mkdirat' filepath='/usr/include/sys/stat.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mknod' filepath='/usr/include/sys/stat.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mknod'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mknodat' filepath='/usr/include/sys/stat.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mknodat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mkfifo' filepath='/usr/include/sys/stat.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkfifo'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='mkfifoat' filepath='/usr/include/sys/stat.h' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkfifoat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='utimensat' filepath='/usr/include/sys/stat.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='utimensat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='futimens' filepath='/usr/include/sys/stat.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='futimens'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='statvfs' mangled-name='statvfs64' filepath='/usr/include/sys/statvfs.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statvfs64'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fstatvfs' mangled-name='fstatvfs64' filepath='/usr/include/sys/statvfs.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstatvfs64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='times' filepath='/usr/include/sys/times.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='times'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-191'/>
    </function-decl>
    <function-decl name='readv' filepath='/usr/include/sys/uio.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readv'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='writev' filepath='/usr/include/sys/uio.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='writev'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='pwritev2' mangled-name='pwritev64v2' filepath='/usr/include/sys/uio.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pwritev64v2'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='preadv2' mangled-name='preadv64v2' filepath='/usr/include/sys/uio.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='preadv64v2'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wait' filepath='/usr/include/sys/wait.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='waitpid' filepath='/usr/include/sys/wait.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='waitpid'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='waitid' filepath='/usr/include/sys/wait.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='waitid'>
      <parameter type-id='type-id-144'/>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-270'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wait3' filepath='/usr/include/sys/wait.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait3'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='wait4' filepath='/usr/include/sys/wait.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait4'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='setxattr' filepath='/usr/include/sys/xattr.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setxattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='lsetxattr' filepath='/usr/include/sys/xattr.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lsetxattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fsetxattr' filepath='/usr/include/sys/xattr.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fsetxattr'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getxattr' filepath='/usr/include/sys/xattr.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getxattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='lgetxattr' filepath='/usr/include/sys/xattr.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lgetxattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='fgetxattr' filepath='/usr/include/sys/xattr.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgetxattr'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='listxattr' filepath='/usr/include/sys/xattr.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='listxattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='llistxattr' filepath='/usr/include/sys/xattr.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='llistxattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='flistxattr' filepath='/usr/include/sys/xattr.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='flistxattr'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='removexattr' filepath='/usr/include/sys/xattr.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='removexattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='lremovexattr' filepath='/usr/include/sys/xattr.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lremovexattr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fremovexattr' filepath='/usr/include/sys/xattr.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fremovexattr'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='faccessat' filepath='/usr/include/unistd.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='faccessat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='pread' mangled-name='pread64' filepath='/usr/include/unistd.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pread64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='pwrite' mangled-name='pwrite64' filepath='/usr/include/unistd.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pwrite64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='pipe' filepath='/usr/include/unistd.h' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pipe'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='pipe2' filepath='/usr/include/unistd.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pipe2'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='chown' filepath='/usr/include/unistd.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chown'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fchown' filepath='/usr/include/unistd.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchown'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='lchown' filepath='/usr/include/unistd.h' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lchown'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fchownat' filepath='/usr/include/unistd.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchownat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='chdir' filepath='/usr/include/unistd.h' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chdir'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fchdir' filepath='/usr/include/unistd.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchdir'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getcwd' filepath='/usr/include/unistd.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getcwd'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='dup2' filepath='/usr/include/unistd.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dup2'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='dup3' filepath='/usr/include/unistd.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dup3'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <var-decl name='environ' type-id='type-id-271' visibility='default' filepath='/usr/include/unistd.h' line='566' column='1' elf-symbol-id='environ'/>
    <function-decl name='execve' filepath='/usr/include/unistd.h' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execve'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fexecve' filepath='/usr/include/unistd.h' line='578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fexecve'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='execv' filepath='/usr/include/unistd.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execv'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='nice' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nice'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='pathconf' filepath='/usr/include/unistd.h' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pathconf'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='fpathconf' filepath='/usr/include/unistd.h' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fpathconf'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='confstr' filepath='/usr/include/unistd.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='confstr'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpid'>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='getppid' filepath='/usr/include/unistd.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getppid'>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='getpgrp' filepath='/usr/include/unistd.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpgrp'>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='getpgid' filepath='/usr/include/unistd.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpgid'>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='setpgid' filepath='/usr/include/unistd.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpgid'>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setpgrp' filepath='/usr/include/unistd.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpgrp'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setsid' filepath='/usr/include/unistd.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setsid'>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='getsid' filepath='/usr/include/unistd.h' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getsid'>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='getuid' filepath='/usr/include/unistd.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getuid'>
      <return type-id='type-id-206'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='geteuid'>
      <return type-id='type-id-206'/>
    </function-decl>
    <function-decl name='getgid' filepath='/usr/include/unistd.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgid'>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='getegid' filepath='/usr/include/unistd.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getegid'>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='getgroups' filepath='/usr/include/unistd.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgroups'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setuid' filepath='/usr/include/unistd.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setuid'>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setreuid' filepath='/usr/include/unistd.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setreuid'>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='seteuid' filepath='/usr/include/unistd.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='seteuid'>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setgid' filepath='/usr/include/unistd.h' line='739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setgid'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setregid' filepath='/usr/include/unistd.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setregid'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setegid' filepath='/usr/include/unistd.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setegid'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getresuid' filepath='/usr/include/unistd.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getresuid'>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getresgid' filepath='/usr/include/unistd.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getresgid'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setresuid' filepath='/usr/include/unistd.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setresuid'>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setresgid' filepath='/usr/include/unistd.h' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setresgid'>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fork' filepath='/usr/include/unistd.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fork'>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='ttyname_r' filepath='/usr/include/unistd.h' line='803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ttyname_r'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='link' filepath='/usr/include/unistd.h' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='link'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='linkat' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='linkat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='symlink'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='symlinkat' filepath='/usr/include/unistd.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='symlinkat'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='readlinkat' filepath='/usr/include/unistd.h' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlinkat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlink'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='unlinkat' filepath='/usr/include/unistd.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlinkat'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='rmdir' filepath='/usr/include/unistd.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rmdir'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='tcgetpgrp' filepath='/usr/include/unistd.h' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tcgetpgrp'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='tcsetpgrp' filepath='/usr/include/unistd.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tcsetpgrp'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getlogin' filepath='/usr/include/unistd.h' line='881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getlogin'>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='chroot' filepath='/usr/include/unistd.h' line='977' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chroot'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fsync' filepath='/usr/include/unistd.h' line='989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fsync'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sync' filepath='/usr/include/unistd.h' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sync'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='truncate' mangled-name='truncate64' filepath='/usr/include/unistd.h' line='1030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='truncate64'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='syscall' filepath='/usr/include/unistd.h' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='syscall'>
      <parameter type-id='type-id-69'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='lockf' mangled-name='lockf64' filepath='/usr/include/unistd.h' line='1117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lockf64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='copy_file_range' filepath='/usr/include/unistd.h' line='1142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='copy_file_range'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='fdatasync' filepath='/usr/include/unistd.h' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdatasync'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='login_tty' filepath='/usr/include/utmp.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='login_tty'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-272'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/pwdmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/pwd.h' line='49' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-17' visibility='default' filepath='/usr/include/pwd.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-17' visibility='default' filepath='/usr/include/pwd.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-206' visibility='default' filepath='/usr/include/pwd.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-200' visibility='default' filepath='/usr/include/pwd.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-17' visibility='default' filepath='/usr/include/pwd.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-17' visibility='default' filepath='/usr/include/pwd.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-17' visibility='default' filepath='/usr/include/pwd.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-274'/>
    <qualified-type-def type-id='type-id-274' restrict='yes' id='type-id-275'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-276'/>
    <qualified-type-def type-id='type-id-276' restrict='yes' id='type-id-277'/>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='./Modules/pwdmodule.c' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setpwent' filepath='/usr/include/pwd.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpwent'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='endpwent' filepath='/usr/include/pwd.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endpwent'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getpwent' filepath='/usr/include/pwd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwent'>
      <return type-id='type-id-274'/>
    </function-decl>
    <function-decl name='getpwuid_r' filepath='/usr/include/pwd.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwuid_r'>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getpwnam_r' filepath='/usr/include/pwd.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwnam_r'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-277'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/signalmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <enum-decl name='__itimer_which' filepath='/usr/include/sys/time.h' line='114' column='1' id='type-id-278'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='ITIMER_REAL' value='0'/>
      <enumerator name='ITIMER_VIRTUAL' value='1'/>
      <enumerator name='ITIMER_PROF' value='2'/>
    </enum-decl>
    <class-decl name='itimerval' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/sys/time.h' line='130' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='it_interval' type-id='type-id-168' visibility='default' filepath='/usr/include/sys/time.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='it_value' type-id='type-id-168' visibility='default' filepath='/usr/include/sys/time.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__itimer_which_t' type-id='type-id-278' filepath='/usr/include/sys/time.h' line='141' column='1' id='type-id-280'/>
    <qualified-type-def type-id='type-id-279' const='yes' id='type-id-281'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <qualified-type-def type-id='type-id-282' restrict='yes' id='type-id-283'/>
    <qualified-type-def type-id='type-id-26' restrict='yes' id='type-id-284'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' id='type-id-285'/>
    <qualified-type-def type-id='type-id-285' restrict='yes' id='type-id-286'/>
    <qualified-type-def type-id='type-id-270' restrict='yes' id='type-id-287'/>
    <var-decl name='PyExc_KeyboardInterrupt' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='101' column='1'/>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='./Modules/signalmodule.c' line='1720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='./Modules/signalmodule.c' line='1760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyErr_CheckSignalsTstate' mangled-name='_PyErr_CheckSignalsTstate' filepath='./Modules/signalmodule.c' line='1786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_CheckSignalsTstate'>
      <parameter type-id='type-id-8' name='tstate' filepath='./Modules/signalmodule.c' line='1786' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyErr_CheckSignals' mangled-name='_PyErr_CheckSignals' filepath='./Modules/signalmodule.c' line='1874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_CheckSignals'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyErr_SetInterruptEx' mangled-name='PyErr_SetInterruptEx' filepath='./Modules/signalmodule.c' line='1886' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterruptEx'>
      <parameter type-id='type-id-16' name='signum' filepath='./Modules/signalmodule.c' line='1886' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='./Modules/signalmodule.c' line='1902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_RestoreSignals' mangled-name='_Py_RestoreSignals' filepath='./Modules/signalmodule.c' line='1940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_RestoreSignals'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyOS_InterruptOccurred' mangled-name='_PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='1994' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_InterruptOccurred'>
      <parameter type-id='type-id-8' name='tstate' filepath='./Modules/signalmodule.c' line='1994' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='2012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='./Modules/signalmodule.c' line='2045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='pthread_kill' filepath='/usr/include/bits/sigthread.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_kill'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigismember' filepath='/usr/include/signal.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigismember'>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigpending' filepath='/usr/include/signal.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigpending'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigwait' filepath='/usr/include/signal.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigwait'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigwaitinfo' filepath='/usr/include/signal.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigwaitinfo'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-287'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='sigtimedwait' filepath='/usr/include/signal.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigtimedwait'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-287'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmin' filepath='/usr/include/signal.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_current_sigrtmin'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmax' filepath='/usr/include/signal.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_current_sigrtmax'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='strsignal' filepath='/usr/include/string.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strsignal'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='getitimer' filepath='/usr/include/sys/time.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getitimer'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='setitimer' filepath='/usr/include/sys/time.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setitimer'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='alarm' filepath='/usr/include/unistd.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alarm'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='pause' filepath='/usr/include/unistd.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pause'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-290'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-291'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/symtablemodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='./Modules/symtablemodule.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/timemodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <enum-decl name='__rusage_who' filepath='/usr/include/bits/resource.h' line='158' column='1' id='type-id-292'>
      <underlying-type type-id='type-id-45'/>
      <enumerator name='RUSAGE_SELF' value='0'/>
      <enumerator name='RUSAGE_CHILDREN' value='-1'/>
      <enumerator name='RUSAGE_THREAD' value='1'/>
    </enum-decl>
    <typedef-decl name='__rusage_who_t' type-id='type-id-292' filepath='/usr/include/sys/resource.h' line='39' column='1' id='type-id-293'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-295'/>
    <qualified-type-def type-id='type-id-296' const='yes' id='type-id-297'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-298'/>
    <qualified-type-def type-id='type-id-298' restrict='yes' id='type-id-299'/>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='./Modules/timemodule.c' line='2138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_getcpuclockid' filepath='/usr/include/pthread.h' line='1315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_getcpuclockid'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='getrusage' filepath='/usr/include/sys/resource.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrusage'>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='clock' filepath='/usr/include/time.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock'>
      <return type-id='type-id-191'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='time'>
      <parameter type-id='type-id-300'/>
      <return type-id='type-id-301'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mktime'>
      <parameter type-id='type-id-302'/>
      <return type-id='type-id-301'/>
    </function-decl>
    <function-decl name='tzset' filepath='/usr/include/time.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tzset'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='clock_getres' filepath='/usr/include/time.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_getres'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_gettime'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='clock_settime' filepath='/usr/include/time.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_settime'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='clock_nanosleep' filepath='/usr/include/time.h' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_nanosleep'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-260'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='1043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsftime'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/dynload_shlib.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='256' id='type-id-304'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-11' id='type-id-305'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-10' restrict='yes' id='type-id-306'/>
    <var-decl name='_PyImport_DynLoadFiletab' type-id='type-id-304' visibility='default' filepath='./Python/importdl.h' line='9' column='1'/>
    <function-decl name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym'>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='dlerror' filepath='/usr/include/dlfcn.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlerror'>
      <return type-id='type-id-17'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/getplatform.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='Py_GetPlatform' mangled-name='Py_GetPlatform' filepath='./Python/getplatform.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPlatform'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/importdl.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <typedef-decl name='dl_funcptr' type-id='type-id-307' filepath='./Python/importdl.h' line='28' column='1' id='type-id-308'/>
    <var-decl name='PyModuleDef_Type' type-id='type-id-3' visibility='default' filepath='./Include/moduleobject.h' line='41' column='1'/>
    <var-decl name='PyExc_UnicodeEncodeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='119' column='1'/>
    <function-type size-in-bits='64' id='type-id-309'>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/sysmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwrite'>
      <return type-id='type-id-9'/>
    </function-decl>
    <var-decl name='Py_IsolatedFlag' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pydebug.h' line='22' column='1'/>
    <var-decl name='PyFloat_Type' type-id='type-id-3' visibility='default' filepath='./Include/floatobject.h' line='14' column='1'/>
    <var-decl name='_Py_perfmap_callbacks' type-id='type-id-310' visibility='default' filepath='./Include/internal/pycore_ceval.h' line='81' column='1'/>
    <var-decl name='PyExc_Exception' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='79' column='1'/>
    <var-decl name='PyExc_ImportError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='95' column='1'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-10' filepath='./Include/pythread.h' line='4' column='1' id='type-id-311'/>
    <var-decl name='PyFrozenSet_Type' type-id='type-id-3' visibility='default' filepath='./Include/setobject.h' line='10' column='1'/>
    <function-decl name='_PySys_GetAttr' mangled-name='_PySys_GetAttr' filepath='./Python/sysmodule.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetAttr'>
      <parameter type-id='type-id-8' name='tstate' filepath='./Python/sysmodule.c' line='67' column='1'/>
      <parameter type-id='type-id-5' name='name' filepath='./Python/sysmodule.c' line='67' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySys_GetObject' mangled-name='PySys_GetObject' filepath='./Python/sysmodule.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetObject'>
      <parameter type-id='type-id-6' name='name' filepath='./Python/sysmodule.c' line='92' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySys_SetObject' mangled-name='PySys_SetObject' filepath='./Python/sysmodule.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetObject'>
      <parameter type-id='type-id-6' name='name' filepath='./Python/sysmodule.c' line='142' column='1'/>
      <parameter type-id='type-id-5' name='v' filepath='./Python/sysmodule.c' line='142' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySys_Audit' mangled-name='PySys_Audit' filepath='./Python/sysmodule.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_Audit'>
      <parameter type-id='type-id-6' name='event' filepath='./Python/sysmodule.c' line='318' column='1'/>
      <parameter type-id='type-id-6' name='argFormat' filepath='./Python/sysmodule.c' line='318' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySys_AddAuditHook' mangled-name='PySys_AddAuditHook' filepath='./Python/sysmodule.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddAuditHook'>
      <parameter type-id='type-id-312' name='hook' filepath='./Python/sysmodule.c' line='389' column='1'/>
      <parameter type-id='type-id-10' name='userData' filepath='./Python/sysmodule.c' line='389' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PySys_GetSizeOf' mangled-name='_PySys_GetSizeOf' filepath='./Python/sysmodule.c' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetSizeOf'>
      <parameter type-id='type-id-5' name='o' filepath='./Python/sysmodule.c' line='1792' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyUnstable_PerfMapState_Init' mangled-name='PyUnstable_PerfMapState_Init' filepath='./Python/sysmodule.c' line='2299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_PerfMapState_Init'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyUnstable_WritePerfMapEntry' mangled-name='PyUnstable_WritePerfMapEntry' filepath='./Python/sysmodule.c' line='2330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_WritePerfMapEntry'>
      <parameter type-id='type-id-10' name='code_addr' filepath='./Python/sysmodule.c' line='2331' column='1'/>
      <parameter type-id='type-id-186' name='code_size' filepath='./Python/sysmodule.c' line='2332' column='1'/>
      <parameter type-id='type-id-6' name='entry_name' filepath='./Python/sysmodule.c' line='2333' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyUnstable_PerfMapState_Fini' mangled-name='PyUnstable_PerfMapState_Fini' filepath='./Python/sysmodule.c' line='2350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_PerfMapState_Fini'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_ResetWarnOptions' mangled-name='PySys_ResetWarnOptions' filepath='./Python/sysmodule.c' line='2639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_ResetWarnOptions'>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOptionUnicode' mangled-name='PySys_AddWarnOptionUnicode' filepath='./Python/sysmodule.c' line='2667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOptionUnicode'>
      <parameter type-id='type-id-5' name='option' filepath='./Python/sysmodule.c' line='2667' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOption' mangled-name='PySys_AddWarnOption' filepath='./Python/sysmodule.c' line='2679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOption'>
      <parameter type-id='type-id-30' name='s' filepath='./Python/sysmodule.c' line='2679' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_HasWarnOptions' mangled-name='PySys_HasWarnOptions' filepath='./Python/sysmodule.c' line='2698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_HasWarnOptions'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySys_AddXOption' mangled-name='PySys_AddXOption' filepath='./Python/sysmodule.c' line='2777' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddXOption'>
      <parameter type-id='type-id-30' name='s' filepath='./Python/sysmodule.c' line='2777' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_GetXOptions' mangled-name='PySys_GetXOptions' filepath='./Python/sysmodule.c' line='2791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetXOptions'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySys_SetPath' mangled-name='PySys_SetPath' filepath='./Python/sysmodule.c' line='3693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetPath'>
      <parameter type-id='type-id-30' name='path' filepath='./Python/sysmodule.c' line='3693' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_SetArgvEx' mangled-name='PySys_SetArgvEx' filepath='./Python/sysmodule.c' line='3725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgvEx'>
      <parameter type-id='type-id-16' name='argc' filepath='./Python/sysmodule.c' line='3725' column='1'/>
      <parameter type-id='type-id-313' name='argv' filepath='./Python/sysmodule.c' line='3725' column='1'/>
      <parameter type-id='type-id-16' name='updatepath' filepath='./Python/sysmodule.c' line='3725' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_SetArgv' mangled-name='PySys_SetArgv' filepath='./Python/sysmodule.c' line='3769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgv'>
      <parameter type-id='type-id-16' name='argc' filepath='./Python/sysmodule.c' line='3769' column='1'/>
      <parameter type-id='type-id-313' name='argv' filepath='./Python/sysmodule.c' line='3769' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_WriteStdout' mangled-name='PySys_WriteStdout' filepath='./Python/sysmodule.c' line='3864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStdout'>
      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='3864' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_WriteStderr' mangled-name='PySys_WriteStderr' filepath='./Python/sysmodule.c' line='3874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStderr'>
      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='3874' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_FormatStdout' mangled-name='PySys_FormatStdout' filepath='./Python/sysmodule.c' line='3906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStdout'>
      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='3906' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PySys_FormatStderr' mangled-name='PySys_FormatStderr' filepath='./Python/sysmodule.c' line='3916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStderr'>
      <parameter type-id='type-id-6' name='format' filepath='./Python/sysmodule.c' line='3916' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush'>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fdopen' filepath='/usr/include/stdio.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdopen'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='fputc' filepath='/usr/include/stdio.h' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fputs' filepath='/usr/include/stdio.h' line='717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputs'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-314'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-315'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-316'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-317'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-318'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-319'>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-320'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-321'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-322'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-10'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/config.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/gcmodule.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <typedef-decl name='gcvisitobjects_t' type-id='type-id-323' filepath='./Include/objimpl.h' line='175' column='1' id='type-id-324'/>
    <var-decl name='PyExc_ResourceWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='163' column='1'/>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='Modules/gcmodule.c' line='2061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyGC_Enable' mangled-name='PyGC_Enable' filepath='Modules/gcmodule.c' line='2068' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Enable'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyGC_Disable' mangled-name='PyGC_Disable' filepath='Modules/gcmodule.c' line='2077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Disable'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyGC_IsEnabled' mangled-name='PyGC_IsEnabled' filepath='Modules/gcmodule.c' line='2086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_IsEnabled'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='Modules/gcmodule.c' line='2094' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='Modules/gcmodule.c' line='2216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track'>
      <parameter type-id='type-id-10' name='op_raw' filepath='Modules/gcmodule.c' line='2216' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='Modules/gcmodule.c' line='2235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack'>
      <parameter type-id='type-id-10' name='op_raw' filepath='Modules/gcmodule.c' line='2235' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_IS_GC' mangled-name='PyObject_IS_GC' filepath='Modules/gcmodule.c' line='2247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IS_GC'>
      <parameter type-id='type-id-5' name='obj' filepath='Modules/gcmodule.c' line='2247' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='Modules/gcmodule.c' line='2319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-19' name='tp' filepath='Modules/gcmodule.c' line='2319' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='Modules/gcmodule.c' line='2331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar'>
      <parameter type-id='type-id-19' name='tp' filepath='Modules/gcmodule.c' line='2331' column='1'/>
      <parameter type-id='type-id-96' name='nitems' filepath='Modules/gcmodule.c' line='2331' column='1'/>
      <return type-id='type-id-325'/>
    </function-decl>
    <function-decl name='PyUnstable_Object_GC_NewWithExtraData' mangled-name='PyUnstable_Object_GC_NewWithExtraData' filepath='Modules/gcmodule.c' line='2350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_Object_GC_NewWithExtraData'>
      <parameter type-id='type-id-19' name='tp' filepath='Modules/gcmodule.c' line='2350' column='1'/>
      <parameter type-id='type-id-7' name='extra_size' filepath='Modules/gcmodule.c' line='2350' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='Modules/gcmodule.c' line='2363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize'>
      <parameter type-id='type-id-325' name='op' filepath='Modules/gcmodule.c' line='2363' column='1'/>
      <parameter type-id='type-id-96' name='nitems' filepath='Modules/gcmodule.c' line='2363' column='1'/>
      <return type-id='type-id-325'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='Modules/gcmodule.c' line='2382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-10' name='op' filepath='Modules/gcmodule.c' line='2382' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_GC_IsTracked' mangled-name='PyObject_GC_IsTracked' filepath='Modules/gcmodule.c' line='2406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_IsTracked'>
      <parameter type-id='type-id-5' name='obj' filepath='Modules/gcmodule.c' line='2406' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_GC_IsFinalized' mangled-name='PyObject_GC_IsFinalized' filepath='Modules/gcmodule.c' line='2415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_IsFinalized'>
      <parameter type-id='type-id-5' name='obj' filepath='Modules/gcmodule.c' line='2415' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyUnstable_GC_VisitObjects' mangled-name='PyUnstable_GC_VisitObjects' filepath='Modules/gcmodule.c' line='2424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_GC_VisitObjects'>
      <parameter type-id='type-id-324' name='callback' filepath='Modules/gcmodule.c' line='2424' column='1'/>
      <parameter type-id='type-id-10' name='arg' filepath='Modules/gcmodule.c' line='2424' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-326'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/main.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <var-decl name='Py_InspectFlag' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pydebug.h' line='12' column='1'/>
    <var-decl name='stdin' type-id='type-id-128' visibility='default' filepath='/usr/include/stdio.h' line='149' column='1' elf-symbol-id='stdin'/>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getc'>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ungetc'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='perror'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='Py_RunMain' mangled-name='Py_RunMain' filepath='Modules/main.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_RunMain'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='Modules/main.c' line='748' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-16' name='argc' filepath='Modules/main.c' line='748' column='1'/>
      <parameter type-id='type-id-313' name='argv' filepath='Modules/main.c' line='748' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='Py_BytesMain' mangled-name='Py_BytesMain' filepath='Modules/main.c' line='760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_BytesMain'>
      <parameter type-id='type-id-16' name='argc' filepath='Modules/main.c' line='760' column='1'/>
      <parameter type-id='type-id-271' name='argv' filepath='Modules/main.c' line='760' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/abstract.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='unknown' id='type-id-27'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-327'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-212'/>
    <qualified-type-def type-id='type-id-330' const='yes' id='type-id-331'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <qualified-type-def type-id='type-id-96' const='yes' id='type-id-333'/>
    <pointer-type-def type-id='type-id-333' size-in-bits='64' id='type-id-334'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-3' visibility='default' filepath='./Include/bytearrayobject.h' line='20' column='1'/>
    <var-decl name='PyComplex_Type' type-id='type-id-3' visibility='default' filepath='./Include/complexobject.h' line='11' column='1'/>
    <var-decl name='_PyUnion_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_unionobject.h' line='11' column='1'/>
    <var-decl name='PyCFunction_Type' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='14' column='1'/>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='40' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='Objects/abstract.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='53' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='72' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='Objects/abstract.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='79' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='91' column='1'/>
      <parameter type-id='type-id-96' name='defaultvalue' filepath='Objects/abstract.c' line='91' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='149' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='Objects/abstract.c' line='149' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='203' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='Objects/abstract.c' line='203' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='Objects/abstract.c' line='203' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='237' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='Objects/abstract.c' line='237' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='271' column='1'/>
      <parameter type-id='type-id-6' name='key' filepath='Objects/abstract.c' line='271' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='Objects/abstract.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckBuffer'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='291' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='302' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='337' column='1'/>
      <parameter type-id='type-id-335' name='buffer' filepath='Objects/abstract.c' line='338' column='1'/>
      <parameter type-id='type-id-336' name='buffer_len' filepath='Objects/abstract.c' line='339' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='351' column='1'/>
      <parameter type-id='type-id-337' name='buffer' filepath='Objects/abstract.c' line='352' column='1'/>
      <parameter type-id='type-id-336' name='buffer_len' filepath='Objects/abstract.c' line='353' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='380' column='1'/>
      <parameter type-id='type-id-338' name='view' filepath='Objects/abstract.c' line='380' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='Objects/abstract.c' line='380' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-332' name='view' filepath='Objects/abstract.c' line='463' column='1'/>
      <parameter type-id='type-id-70' name='order' filepath='Objects/abstract.c' line='463' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-332' name='view' filepath='Objects/abstract.c' line='479' column='1'/>
      <parameter type-id='type-id-334' name='indices' filepath='Objects/abstract.c' line='479' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='Objects/abstract.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-16' name='nd' filepath='Objects/abstract.c' line='495' column='1'/>
      <parameter type-id='type-id-336' name='index' filepath='Objects/abstract.c' line='495' column='1'/>
      <parameter type-id='type-id-334' name='shape' filepath='Objects/abstract.c' line='495' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='Objects/abstract.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-16' name='nd' filepath='Objects/abstract.c' line='511' column='1'/>
      <parameter type-id='type-id-336' name='index' filepath='Objects/abstract.c' line='511' column='1'/>
      <parameter type-id='type-id-334' name='shape' filepath='Objects/abstract.c' line='511' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_SizeFromFormat' mangled-name='PyBuffer_SizeFromFormat' filepath='Objects/abstract.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_SizeFromFormat'>
      <parameter type-id='type-id-6' name='format' filepath='Objects/abstract.c' line='527' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-332' name='view' filepath='Objects/abstract.c' line='562' column='1'/>
      <parameter type-id='type-id-10' name='buf' filepath='Objects/abstract.c' line='562' column='1'/>
      <parameter type-id='type-id-96' name='len' filepath='Objects/abstract.c' line='562' column='1'/>
      <parameter type-id='type-id-70' name='fort' filepath='Objects/abstract.c' line='562' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-5' name='dest' filepath='Objects/abstract.c' line='614' column='1'/>
      <parameter type-id='type-id-5' name='src' filepath='Objects/abstract.c' line='614' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-16' name='nd' filepath='Objects/abstract.c' line='685' column='1'/>
      <parameter type-id='type-id-336' name='shape' filepath='Objects/abstract.c' line='685' column='1'/>
      <parameter type-id='type-id-336' name='strides' filepath='Objects/abstract.c' line='686' column='1'/>
      <parameter type-id='type-id-16' name='itemsize' filepath='Objects/abstract.c' line='686' column='1'/>
      <parameter type-id='type-id-70' name='fort' filepath='Objects/abstract.c' line='687' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-338' name='view' filepath='Objects/abstract.c' line='709' column='1'/>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='709' column='1'/>
      <parameter type-id='type-id-10' name='buf' filepath='Objects/abstract.c' line='709' column='1'/>
      <parameter type-id='type-id-96' name='len' filepath='Objects/abstract.c' line='709' column='1'/>
      <parameter type-id='type-id-16' name='readonly' filepath='Objects/abstract.c' line='710' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='Objects/abstract.c' line='710' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='746' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-338' name='view' filepath='Objects/abstract.c' line='746' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='761' column='1'/>
      <parameter type-id='type-id-5' name='format_spec' filepath='Objects/abstract.c' line='761' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='821' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='821' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='1051' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1051' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1051' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='1052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1052' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1052' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='1053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1053' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1053' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1054' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1054' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='1055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1055' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1055' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='1056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1056' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1056' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='1057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1057' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1057' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='1060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1060' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1060' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='1098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1098' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1098' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='1117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1117' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1117' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='1123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1123' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1123' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='1129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1129' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1129' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='1135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1135' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1135' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1141' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1141' column='1'/>
      <parameter type-id='type-id-5' name='z' filepath='Objects/abstract.c' line='1141' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1236' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1236' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1237' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1237' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1238' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1238' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='Objects/abstract.c' line='1239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1239' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1239' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='Objects/abstract.c' line='1240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1240' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1240' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='Objects/abstract.c' line='1241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1241' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1241' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='Objects/abstract.c' line='1242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1242' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1242' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='Objects/abstract.c' line='1243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1243' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1243' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='Objects/abstract.c' line='1244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1244' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1244' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='Objects/abstract.c' line='1245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1245' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1245' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='Objects/abstract.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1248' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1248' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='Objects/abstract.c' line='1271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1271' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1271' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='Objects/abstract.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='1300' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='1300' column='1'/>
      <parameter type-id='type-id-5' name='z' filepath='Objects/abstract.c' line='1300' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='Objects/abstract.c' line='1316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1316' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='Objects/abstract.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1333' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='Objects/abstract.c' line='1350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1350' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='Objects/abstract.c' line='1367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1367' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='Objects/abstract.c' line='1385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='1385' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyNumber_Index' mangled-name='_PyNumber_Index' filepath='Objects/abstract.c' line='1397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNumber_Index'>
      <parameter type-id='type-id-5' name='item' filepath='Objects/abstract.c' line='1397' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='Objects/abstract.c' line='1443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-5' name='item' filepath='Objects/abstract.c' line='1443' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='Objects/abstract.c' line='1455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-5' name='item' filepath='Objects/abstract.c' line='1455' column='1'/>
      <parameter type-id='type-id-5' name='err' filepath='Objects/abstract.c' line='1455' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='Objects/abstract.c' line='1506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1506' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='Objects/abstract.c' line='1621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1621' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='Objects/abstract.c' line='1682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-5' name='n' filepath='Objects/abstract.c' line='1682' column='1'/>
      <parameter type-id='type-id-16' name='base' filepath='Objects/abstract.c' line='1682' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='Objects/abstract.c' line='1701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1701' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='Objects/abstract.c' line='1710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1710' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='Objects/abstract.c' line='1734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1734' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='Objects/abstract.c' line='1741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1741' column='1'/>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1741' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='Objects/abstract.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1767' column='1'/>
      <parameter type-id='type-id-96' name='count' filepath='Objects/abstract.c' line='1767' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='Objects/abstract.c' line='1798' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1798' column='1'/>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1798' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='Objects/abstract.c' line='1827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1827' column='1'/>
      <parameter type-id='type-id-96' name='count' filepath='Objects/abstract.c' line='1827' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='Objects/abstract.c' line='1861' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1861' column='1'/>
      <parameter type-id='type-id-96' name='i' filepath='Objects/abstract.c' line='1861' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='Objects/abstract.c' line='1891' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1891' column='1'/>
      <parameter type-id='type-id-96' name='i1' filepath='Objects/abstract.c' line='1891' column='1'/>
      <parameter type-id='type-id-96' name='i2' filepath='Objects/abstract.c' line='1891' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='Objects/abstract.c' line='1913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1913' column='1'/>
      <parameter type-id='type-id-96' name='i' filepath='Objects/abstract.c' line='1913' column='1'/>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1913' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='Objects/abstract.c' line='1946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1946' column='1'/>
      <parameter type-id='type-id-96' name='i' filepath='Objects/abstract.c' line='1946' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='Objects/abstract.c' line='1979' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1979' column='1'/>
      <parameter type-id='type-id-96' name='i1' filepath='Objects/abstract.c' line='1979' column='1'/>
      <parameter type-id='type-id-96' name='i2' filepath='Objects/abstract.c' line='1979' column='1'/>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='1979' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='Objects/abstract.c' line='2002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='2002' column='1'/>
      <parameter type-id='type-id-96' name='i1' filepath='Objects/abstract.c' line='2002' column='1'/>
      <parameter type-id='type-id-96' name='i2' filepath='Objects/abstract.c' line='2002' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='Objects/abstract.c' line='2025' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='2025' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='Objects/abstract.c' line='2108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='2108' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='Objects/abstract.c' line='2131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='2131' column='1'/>
      <parameter type-id='type-id-6' name='m' filepath='Objects/abstract.c' line='2131' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='Objects/abstract.c' line='2165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-5' name='seq' filepath='Objects/abstract.c' line='2165' column='1'/>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='2165' column='1'/>
      <parameter type-id='type-id-16' name='operation' filepath='Objects/abstract.c' line='2165' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='Objects/abstract.c' line='2250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='2250' column='1'/>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2250' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='Objects/abstract.c' line='2259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-5' name='seq' filepath='Objects/abstract.c' line='2259' column='1'/>
      <parameter type-id='type-id-5' name='ob' filepath='Objects/abstract.c' line='2259' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='Objects/abstract.c' line='2274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-5' name='w' filepath='Objects/abstract.c' line='2274' column='1'/>
      <parameter type-id='type-id-5' name='v' filepath='Objects/abstract.c' line='2274' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='Objects/abstract.c' line='2280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='2280' column='1'/>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2280' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='Objects/abstract.c' line='2288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2288' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='Objects/abstract.c' line='2295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2295' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='Objects/abstract.c' line='2320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2320' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='Objects/abstract.c' line='2327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2327' column='1'/>
      <parameter type-id='type-id-6' name='key' filepath='Objects/abstract.c' line='2327' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='Objects/abstract.c' line='2344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2344' column='1'/>
      <parameter type-id='type-id-6' name='key' filepath='Objects/abstract.c' line='2344' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='Objects/abstract.c' line='2344' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='Objects/abstract.c' line='2363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2363' column='1'/>
      <parameter type-id='type-id-6' name='key' filepath='Objects/abstract.c' line='2363' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='Objects/abstract.c' line='2377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2377' column='1'/>
      <parameter type-id='type-id-5' name='key' filepath='Objects/abstract.c' line='2377' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='Objects/abstract.c' line='2423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2423' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='Objects/abstract.c' line='2435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2435' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='Objects/abstract.c' line='2447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2447' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='Objects/abstract.c' line='2667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-5' name='inst' filepath='Objects/abstract.c' line='2667' column='1'/>
      <parameter type-id='type-id-5' name='cls' filepath='Objects/abstract.c' line='2667' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='Objects/abstract.c' line='2755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-5' name='derived' filepath='Objects/abstract.c' line='2755' column='1'/>
      <parameter type-id='type-id-5' name='cls' filepath='Objects/abstract.c' line='2755' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='Objects/abstract.c' line='2763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-5' name='inst' filepath='Objects/abstract.c' line='2763' column='1'/>
      <parameter type-id='type-id-5' name='cls' filepath='Objects/abstract.c' line='2763' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='Objects/abstract.c' line='2769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-5' name='derived' filepath='Objects/abstract.c' line='2769' column='1'/>
      <parameter type-id='type-id-5' name='cls' filepath='Objects/abstract.c' line='2769' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='Objects/abstract.c' line='2776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2776' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyObject_GetAIter' mangled-name='PyObject_GetAIter' filepath='Objects/abstract.c' line='2801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetAIter'>
      <parameter type-id='type-id-5' name='o' filepath='Objects/abstract.c' line='2801' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='Objects/abstract.c' line='2820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='2820' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyAIter_Check' mangled-name='PyAIter_Check' filepath='Objects/abstract.c' line='2828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyAIter_Check'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='2828' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='Objects/abstract.c' line='2844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-5' name='iter' filepath='Objects/abstract.c' line='2844' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyIter_Send' mangled-name='PyIter_Send' filepath='Objects/abstract.c' line='2860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Send'>
      <parameter type-id='type-id-5' name='iter' filepath='Objects/abstract.c' line='2860' column='1'/>
      <parameter type-id='type-id-5' name='arg' filepath='Objects/abstract.c' line='2860' column='1'/>
      <parameter type-id='type-id-339' name='result' filepath='Objects/abstract.c' line='2860' column='1'/>
      <return type-id='type-id-340'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='Objects/abstract.c' line='2893' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-5' name='self' filepath='Objects/abstract.c' line='2893' column='1'/>
      <return type-id='type-id-212'/>
    </function-decl>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='Objects/abstract.c' line='2952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-212' name='array' filepath='Objects/abstract.c' line='2952' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/boolobject.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='Objects/boolobject.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-69' name='ok' filepath='Objects/boolobject.c' line='21' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-341'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-343'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-3' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='21' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-344' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='./Include/cpython/bytearrayobject.h' line='14' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='42' column='1'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='43' column='1'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='44' column='1'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='45' column='1'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='46' column='1'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='47' column='1'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='48' column='1'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='49' column='1'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='50' column='1'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='51' column='1'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='52' column='1'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='53' column='1'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='54' column='1'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='55' column='1'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='56' column='1'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='57' column='1'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='58' column='1'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='59' column='1'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='60' column='1'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='61' column='1'/>
    <var-decl name='PyExc_BytesWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='161' column='1'/>
    <var-decl name='PySlice_Type' type-id='type-id-3' visibility='default' filepath='./Include/sliceobject.h' line='28' column='1'/>
    <function-decl name='memrchr' filepath='/usr/include/string.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memrchr'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-5' name='input' filepath='Objects/bytearrayobject.c' line='83' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='Objects/bytearrayobject.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-6' name='bytes' filepath='Objects/bytearrayobject.c' line='109' column='1'/>
      <parameter type-id='type-id-96' name='size' filepath='Objects/bytearrayobject.c' line='109' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-5' name='self' filepath='Objects/bytearrayobject.c' line='153' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='Objects/bytearrayobject.c' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-5' name='self' filepath='Objects/bytearrayobject.c' line='162' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-5' name='self' filepath='Objects/bytearrayobject.c' line='171' column='1'/>
      <parameter type-id='type-id-96' name='requested_size' filepath='Objects/bytearrayobject.c' line='171' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-5' name='a' filepath='Objects/bytearrayobject.c' line='250' column='1'/>
      <parameter type-id='type-id-5' name='b' filepath='Objects/bytearrayobject.c' line='250' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='984' id='type-id-346'>
      <subrange length='123' lower-bound='0' upper-bound='122' type-id='type-id-11' id='type-id-347'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='992' id='type-id-348'>
      <subrange length='124' lower-bound='0' upper-bound='123' type-id='type-id-11' id='type-id-349'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1008' id='type-id-350'>
      <subrange length='126' lower-bound='0' upper-bound='125' type-id='type-id-11' id='type-id-351'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1040' id='type-id-352'>
      <subrange length='130' lower-bound='0' upper-bound='129' type-id='type-id-11' id='type-id-353'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1056' id='type-id-354'>
      <subrange length='132' lower-bound='0' upper-bound='131' type-id='type-id-11' id='type-id-355'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1128' id='type-id-356'>
      <subrange length='141' lower-bound='0' upper-bound='140' type-id='type-id-11' id='type-id-357'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1240' id='type-id-358'>
      <subrange length='155' lower-bound='0' upper-bound='154' type-id='type-id-11' id='type-id-359'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1592' id='type-id-360'>
      <subrange length='199' lower-bound='0' upper-bound='198' type-id='type-id-11' id='type-id-361'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1840' id='type-id-362'>
      <subrange length='230' lower-bound='0' upper-bound='229' type-id='type-id-11' id='type-id-363'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1912' id='type-id-364'>
      <subrange length='239' lower-bound='0' upper-bound='238' type-id='type-id-11' id='type-id-365'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='1928' id='type-id-366'>
      <subrange length='241' lower-bound='0' upper-bound='240' type-id='type-id-11' id='type-id-367'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='2112' id='type-id-368'>
      <subrange length='264' lower-bound='0' upper-bound='263' type-id='type-id-11' id='type-id-369'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='2144' id='type-id-370'>
      <subrange length='268' lower-bound='0' upper-bound='267' type-id='type-id-11' id='type-id-371'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='2160' id='type-id-372'>
      <subrange length='270' lower-bound='0' upper-bound='269' type-id='type-id-11' id='type-id-373'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='2168' id='type-id-374'>
      <subrange length='271' lower-bound='0' upper-bound='270' type-id='type-id-11' id='type-id-375'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='2328' id='type-id-376'>
      <subrange length='291' lower-bound='0' upper-bound='290' type-id='type-id-11' id='type-id-377'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='744' id='type-id-378'>
      <subrange length='93' lower-bound='0' upper-bound='92' type-id='type-id-11' id='type-id-379'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='784' id='type-id-380'>
      <subrange length='98' lower-bound='0' upper-bound='97' type-id='type-id-11' id='type-id-381'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-71' size-in-bits='unknown' id='type-id-345'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-327'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-382' size-in-bits='2048' id='type-id-34'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-11' id='type-id-140'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-156' const='yes' id='type-id-382'/>
    <var-decl name='_Py_ctype_toupper' type-id='type-id-34' visibility='default' filepath='./Include/cpython/pyctype.h' line='30' column='1'/>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-352' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='42' column='1'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-352' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='43' column='1'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-354' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='44' column='1'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-380' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='45' column='1'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-350' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='46' column='1'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='47' column='1'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='48' column='1'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-362' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='49' column='1'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-378' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='50' column='1'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-378' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='51' column='1'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-358' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='52' column='1'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='53' column='1'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-346' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='54' column='1'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-360' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='55' column='1'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-364' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='56' column='1'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-372' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='57' column='1'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='58' column='1'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-374' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='59' column='1'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-370' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='60' column='1'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-368' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='61' column='1'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-376' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='62' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/bytesobject.c' comp-dir-path='/home/encukou/dev/cpython' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='4096' id='type-id-383'>
      <subrange length='512' lower-bound='0' upper-bound='511' type-id='type-id-11' id='type-id-384'/>
    </array-type-def>
    <class-decl name='_PyBytesWriter' size-in-bits='4416' is-struct='yes' naming-typedef-id='type-id-385' visibility='default' filepath='./Include/cpython/bytesobject.h' line='55' column='1' id='type-id-386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-5' visibility='default' filepath='./Include/cpython/bytesobject.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-96' visibility='default' filepath='./Include/cpython/bytesobject.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='min_size' type-id='type-id-96' visibility='default' filepath='./Include/cpython/bytesobject.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_bytearray' type-id='type-id-16' visibility='default' filepath='./Include/cpython/bytesobject.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='overallocate' type-id='type-id-16' visibility='default' filepath='./Include/cpython/bytesobject.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='use_small_buffer' type-id='type-id-16' visibility='default' filepath='./Include/cpython/bytesobject.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='small_buffer' type-id='type-id-383' visibility='default' filepath='./Include/cpython/bytesobject.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyBytesWriter' type-id='type-id-386' filepath='./Include/cpython/bytesobject.h' line='76' column='1' id='type-id-385'/>
    <array-type-def dimensions='1' type-id='type-id-156' size-in-bits='2048' id='type-id-387'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-11' id='type-id-140'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-388'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-3' mangled-name='PyBytesIter_Type' visibility='default' filepath='./Include/bytesobject.h' line='28' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <var-decl name='_PyLong_DigitValue' type-id='type-id-387' visibility='default' filepath='./Include/internal/pycore_long.h' line='87' column='1'/>
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sprintf'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-6'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='Objects/bytesobject.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromStringAndSize'>
      <parameter type-id='type-id-6' name='str' filepath='Objects/bytesobject.c' line='118' column='1'/>
      <parameter type-id='type-id-96' name='size' filepath='Objects/bytesobject.c' line='118' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_FromString' mangled-name='PyBytes_FromString' filepath='Objects/bytesobject.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromString'>
      <parameter type-id='type-id-6' name='str' filepath='Objects/bytesobject.c' line='145' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormatV' mangled-name='PyBytes_FromFormatV' filepath='Objects/bytesobject.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormatV'>
      <parameter type-id='type-id-6' name='format' filepath='Objects/bytesobject.c' line='181' column='1'/>
      <parameter type-id='type-id-389' name='vargs' filepath='Objects/bytesobject.c' line='181' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormat' mangled-name='PyBytes_FromFormat' filepath='Objects/bytesobject.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormat'>
      <parameter type-id='type-id-6' name='format' filepath='Objects/bytesobject.c' line='372' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='Objects/bytesobject.c' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FormatEx'>
      <parameter type-id='type-id-6' name='format' filepath='Objects/bytesobject.c' line='571' column='1'/>
      <parameter type-id='type-id-96' name='format_len' filepath='Objects/bytesobject.c' line='571' column='1'/>
      <parameter type-id='type-id-5' name='args' filepath='Objects/bytesobject.c' line='572' column='1'/>
      <parameter type-id='type-id-16' name='use_bytearray' filepath='Objects/bytesobject.c' line='572' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1051' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_DecodeEscape'>
      <parameter type-id='type-id-6' name='s' filepath='Objects/bytesobject.c' line='1051' column='1'/>
      <parameter type-id='type-id-96' name='len' filepath='Objects/bytesobject.c' line='1052' column='1'/>
      <parameter type-id='type-id-6' name='errors' filepath='Objects/bytesobject.c' line='1053' column='1'/>
      <parameter type-id='type-id-335' name='first_invalid_escape' filepath='Objects/bytesobject.c' line='1054' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='Objects/bytesobject.c' line='1165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
      <parameter type-id='type-id-6' name='s' filepath='Objects/bytesobject.c' line='1165' column='1'/>
      <parameter type-id='type-id-96' name='len' filepath='Objects/bytesobject.c' line='1166' column='1'/>
      <parameter type-id='type-id-6' name='errors' filepath='Objects/bytesobject.c' line='1167' column='1'/>
      <parameter type-id='type-id-96' name='_unused_unicode' filepath='Objects/bytesobject.c' line='1168' column='1'/>
      <parameter type-id='type-id-6' name='_unused_recode_encoding' filepath='Objects/bytesobject.c' line='1169' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_Size' mangled-name='PyBytes_Size' filepath='Objects/bytesobject.c' line='1204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Size'>
      <parameter type-id='type-id-5' name='op' filepath='Objects/bytesobject.c' line='1204' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='Objects/bytesobject.c' line='1215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsString'>
      <parameter type-id='type-id-5' name='op' filepath='Objects/bytesobject.c' line='1215' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='Objects/bytesobject.c' line='1226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/bytesobject.c' line='1226' column='1'/>
      <parameter type-id='type-id-271' name='s' filepath='Objects/bytesobject.c' line='1227' column='1'/>
      <parameter type-id='type-id-336' name='len' filepath='Objects/bytesobject.c' line='1228' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyBytes_Find' mangled-name='_PyBytes_Find' filepath='Objects/bytesobject.c' line='1273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Find'>
      <parameter type-id='type-id-6' name='haystack' filepath='Objects/bytesobject.c' line='1273' column='1'/>
      <parameter type-id='type-id-96' name='len_haystack' filepath='Objects/bytesobject.c' line='1273' column='1'/>
      <parameter type-id='type-id-6' name='needle' filepath='Objects/bytesobject.c' line='1274' column='1'/>
      <parameter type-id='type-id-96' name='len_needle' filepath='Objects/bytesobject.c' line='1274' column='1'/>
      <parameter type-id='type-id-96' name='offset' filepath='Objects/bytesobject.c' line='1275' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='_PyBytes_ReverseFind' mangled-name='_PyBytes_ReverseFind' filepath='Objects/bytesobject.c' line='1299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_ReverseFind'>
      <parameter type-id='type-id-6' name='haystack' filepath='Objects/bytesobject.c' line='1299' column='1'/>
      <parameter type-id='type-id-96' name='len_haystack' filepath='Objects/bytesobject.c' line='1299' column='1'/>
      <parameter type-id='type-id-6' name='needle' filepath='Objects/bytesobject.c' line='1300' column='1'/>
      <parameter type-id='type-id-96' name='len_needle' filepath='Objects/bytesobject.c' line='1300' column='1'/>
      <parameter type-id='type-id-96' name='offset' filepath='Objects/bytesobject.c' line='1301' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='Objects/bytesobject.c' line='1308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/bytesobject.c' line='1308' column='1'/>
      <parameter type-id='type-id-16' name='smartquotes' filepath='Objects/bytesobject.c' line='1308' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='Objects/bytesobject.c' line='1863' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
      <parameter type-id='type-id-5' name='sep' filepath='Objects/bytesobject.c' line='1863' column='1'/>
      <parameter type-id='type-id-5' name='x' filepath='Objects/bytesobject.c' line='1863' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='Objects/bytesobject.c' line='2375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FromHex'>
      <parameter type-id='type-id-5' name='string' filepath='Objects/bytesobject.c' line='2375' column='1'/>
      <parameter type-id='type-id-16' name='use_bytearray' filepath='Objects/bytesobject.c' line='2375' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='Objects/bytesobject.c' line='2835' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
      <parameter type-id='type-id-5' name='x' filepath='Objects/bytesobject.c' line='2835' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyBytes_Concat' mangled-name='PyBytes_Concat' filepath='Objects/bytesobject.c' line='2977' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Concat'>
      <parameter type-id='type-id-339' name='pv' filepath='Objects/bytesobject.c' line='2977' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/bytesobject.c' line='2977' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='Objects/bytesobject.c' line='3026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
      <parameter type-id='type-id-339' name='pv' filepath='Objects/bytesobject.c' line='3026' column='1'/>
      <parameter type-id='type-id-5' name='w' filepath='Objects/bytesobject.c' line='3026' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='Objects/bytesobject.c' line='3048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
      <parameter type-id='type-id-339' name='pv' filepath='Objects/bytesobject.c' line='3048' column='1'/>
      <parameter type-id='type-id-96' name='newsize' filepath='Objects/bytesobject.c' line='3048' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='Objects/bytesobject.c' line='3271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3271' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='Objects/bytesobject.c' line='3282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3282' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='Objects/bytesobject.c' line='3352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3352' column='1'/>
      <parameter type-id='type-id-10' name='str' filepath='Objects/bytesobject.c' line='3352' column='1'/>
      <parameter type-id='type-id-96' name='size' filepath='Objects/bytesobject.c' line='3352' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='Objects/bytesobject.c' line='3422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3422' column='1'/>
      <parameter type-id='type-id-10' name='str' filepath='Objects/bytesobject.c' line='3422' column='1'/>
      <parameter type-id='type-id-96' name='size' filepath='Objects/bytesobject.c' line='3422' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='Objects/bytesobject.c' line='3452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3452' column='1'/>
      <parameter type-id='type-id-96' name='size' filepath='Objects/bytesobject.c' line='3452' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='Objects/bytesobject.c' line='3482' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3482' column='1'/>
      <parameter type-id='type-id-10' name='str' filepath='Objects/bytesobject.c' line='3482' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='Objects/bytesobject.c' line='3526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes'>
      <parameter type-id='type-id-388' name='writer' filepath='Objects/bytesobject.c' line='3526' column='1'/>
      <parameter type-id='type-id-10' name='ptr' filepath='Objects/bytesobject.c' line='3526' column='1'/>
      <parameter type-id='type-id-10' name='bytes' filepath='Objects/bytesobject.c' line='3527' column='1'/>
