<abi-corpus path='libpython3.7m.so' soname='libpython3.7m.so.1.0'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_mod2obj' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_obj2mod' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_endswith__doc__' size='264' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_expandtabs__doc__' size='173' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_find__doc__' size='239' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_global_config_int_max_str_digits' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_index__doc__' size='270' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalnum__doc__' size='132' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isalpha__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isascii__doc__' size='98' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isdigit__doc__' size='126' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_islower__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isspace__doc__' size='130' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_istitle__doc__' size='230' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_isupper__doc__' size='141' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ljust__doc__' size='167' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_lower__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_maketrans__doc__' size='291' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_open_cloexec_works' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rfind__doc__' size='241' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rindex__doc__' size='271' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_rjust__doc__' size='167' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_startswith__doc__' size='268' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_swapcase__doc__' size='123' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_title__doc__' size='155' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_upper__doc__' size='93' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_zfill__doc__' size='139' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Modules/getbuildinfo.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='../gpshead/Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_Py_gitversion' mangled-name='_Py_gitversion' filepath='../gpshead/Modules/getbuildinfo.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitversion'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='../gpshead/Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/acceler.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <type-decl name='void' id='type-id-4'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-5' visibility='default' filepath='../gpshead/Include/grammar.h' line='61' column='1' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_ndfas' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dfa' type-id='type-id-8' visibility='default' filepath='../gpshead/Include/grammar.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_ll' type-id='type-id-9' visibility='default' filepath='../gpshead/Include/grammar.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='g_start' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='g_accel' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-7'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-10' visibility='default' filepath='../gpshead/Include/grammar.h' line='50' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_type' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_name' type-id='type-id-12' visibility='default' filepath='../gpshead/Include/grammar.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_initial' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='d_nstates' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='d_state' type-id='type-id-13' visibility='default' filepath='../gpshead/Include/grammar.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='d_first' type-id='type-id-14' visibility='default' filepath='../gpshead/Include/grammar.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-12'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-15' visibility='default' filepath='../gpshead/Include/grammar.h' line='37' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_narcs' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_arc' type-id='type-id-17' visibility='default' filepath='../gpshead/Include/grammar.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_lower' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='s_upper' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_accel' type-id='type-id-18' visibility='default' filepath='../gpshead/Include/grammar.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='s_accept' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-19' visibility='default' filepath='../gpshead/Include/grammar.h' line='30' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a_lbl' type-id='type-id-21' visibility='default' filepath='../gpshead/Include/grammar.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='a_arrow' type-id='type-id-21' visibility='default' filepath='../gpshead/Include/grammar.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-21'/>
    <typedef-decl name='arc' type-id='type-id-20' filepath='../gpshead/Include/grammar.h' line='33' column='1' id='type-id-19'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <typedef-decl name='state' type-id='type-id-16' filepath='../gpshead/Include/grammar.h' line='46' column='1' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-13'/>
    <typedef-decl name='bitset' type-id='type-id-12' filepath='../gpshead/Include/bitset.h' line='12' column='1' id='type-id-14'/>
    <typedef-decl name='dfa' type-id='type-id-11' filepath='../gpshead/Include/grammar.h' line='57' column='1' id='type-id-10'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-8'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-9' visibility='default' filepath='../gpshead/Include/grammar.h' line='23' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ll_nlabels' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ll_label' type-id='type-id-23' visibility='default' filepath='../gpshead/Include/grammar.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-24' visibility='default' filepath='../gpshead/Include/grammar.h' line='14' column='1' id='type-id-25'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lb_type' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/grammar.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lb_str' type-id='type-id-12' visibility='default' filepath='../gpshead/Include/grammar.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='label' type-id='type-id-25' filepath='../gpshead/Include/grammar.h' line='17' column='1' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-23'/>
    <typedef-decl name='labellist' type-id='type-id-22' filepath='../gpshead/Include/grammar.h' line='26' column='1' id='type-id-9'/>
    <typedef-decl name='grammar' type-id='type-id-6' filepath='../gpshead/Include/grammar.h' line='67' column='1' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-26'/>
    <function-decl name='PyGrammar_RemoveAccelerators' mangled-name='PyGrammar_RemoveAccelerators' filepath='../gpshead/Parser/acceler.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_RemoveAccelerators'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/acceler.c' line='35' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyGrammar_AddAccelerators' mangled-name='PyGrammar_AddAccelerators' filepath='../gpshead/Parser/acceler.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_AddAccelerators'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/acceler.c' line='24' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/grammar1.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <function-decl name='PyGrammar_LabelRepr' mangled-name='PyGrammar_LabelRepr' filepath='../gpshead/Parser/grammar1.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_LabelRepr'>
      <parameter type-id='type-id-23' name='lb' filepath='../gpshead/Parser/grammar1.c' line='33' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='PyGrammar_FindDFA' mangled-name='PyGrammar_FindDFA' filepath='../gpshead/Parser/grammar1.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGrammar_FindDFA'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/grammar1.c' line='12' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/grammar1.c' line='12' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/listnode.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <class-decl name='_node' size-in-bits='320' is-struct='yes' visibility='default' filepath='../gpshead/Include/node.h' line='10' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_type' type-id='type-id-21' visibility='default' filepath='../gpshead/Include/node.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_str' type-id='type-id-12' visibility='default' filepath='../gpshead/Include/node.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='n_lineno' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/node.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='n_col_offset' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/node.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='n_nchildren' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/node.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='n_child' type-id='type-id-28' visibility='default' filepath='../gpshead/Include/node.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-28'/>
    <typedef-decl name='node' type-id='type-id-27' filepath='../gpshead/Include/node.h' line='17' column='1' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
    <function-decl name='PyNode_ListTree' mangled-name='PyNode_ListTree' filepath='../gpshead/Parser/listnode.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_ListTree'>
      <parameter type-id='type-id-30' name='n' filepath='../gpshead/Parser/listnode.c' line='13' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/node.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='type-id-31'/>
    <typedef-decl name='__ssize_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-32'/>
    <typedef-decl name='ssize_t' type-id='type-id-32' filepath='/usr/include/stdio.h' line='77' column='1' id='type-id-33'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-33' filepath='../gpshead/Include/pyport.h' line='84' column='1' id='type-id-34'/>
    <function-decl name='_PyNode_SizeOf' mangled-name='_PyNode_SizeOf' filepath='../gpshead/Parser/node.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNode_SizeOf'>
      <parameter type-id='type-id-30' name='n' filepath='../gpshead/Parser/node.c' line='130' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyNode_Free' mangled-name='PyNode_Free' filepath='../gpshead/Parser/node.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_Free'>
      <parameter type-id='type-id-30' name='n' filepath='../gpshead/Parser/listnode.c' line='13' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyNode_AddChild' mangled-name='PyNode_AddChild' filepath='../gpshead/Parser/node.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_AddChild'>
      <parameter type-id='type-id-30' name='n1' filepath='../gpshead/Parser/node.c' line='79' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/node.c' line='79' column='1'/>
      <parameter type-id='type-id-12' name='str' filepath='../gpshead/Parser/node.c' line='79' column='1'/>
      <parameter type-id='type-id-7' name='lineno' filepath='../gpshead/Parser/node.c' line='79' column='1'/>
      <parameter type-id='type-id-7' name='col_offset' filepath='../gpshead/Parser/node.c' line='79' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyNode_New' mangled-name='PyNode_New' filepath='../gpshead/Parser/node.c' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNode_New'>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/node.c' line='8' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/parser.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='288256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-35' visibility='default' filepath='../gpshead/Parser/parser.h' line='24' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_stack' type-id='type-id-37' visibility='default' filepath='../gpshead/Parser/parser.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288064'>
        <var-decl name='p_grammar' type-id='type-id-26' visibility='default' filepath='../gpshead/Parser/parser.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288128'>
        <var-decl name='p_tree' type-id='type-id-30' visibility='default' filepath='../gpshead/Parser/parser.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288192'>
        <var-decl name='p_flags' type-id='type-id-38' visibility='default' filepath='../gpshead/Parser/parser.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='288064' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-37' visibility='default' filepath='../gpshead/Parser/parser.h' line='18' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_top' type-id='type-id-40' visibility='default' filepath='../gpshead/Parser/parser.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_base' type-id='type-id-41' visibility='default' filepath='../gpshead/Parser/parser.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-42' visibility='default' filepath='../gpshead/Parser/parser.h' line='12' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_state' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/parser.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_dfa' type-id='type-id-8' visibility='default' filepath='../gpshead/Parser/parser.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_parent' type-id='type-id-28' visibility='default' filepath='../gpshead/Parser/parser.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='stackentry' type-id='type-id-43' filepath='../gpshead/Parser/parser.h' line='16' column='1' id='type-id-42'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-40'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-38'/>

    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='288000' id='type-id-41'>
      <subrange length='1500' type-id='type-id-38' id='type-id-44'/>

    </array-type-def>
    <typedef-decl name='stack' type-id='type-id-39' filepath='../gpshead/Parser/parser.h' line='22' column='1' id='type-id-37'/>
    <typedef-decl name='parser_state' type-id='type-id-36' filepath='../gpshead/Parser/parser.h' line='31' column='1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-45'/>
    <function-decl name='PyParser_AddToken' mangled-name='PyParser_AddToken' filepath='../gpshead/Parser/parser.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_AddToken'>
      <parameter type-id='type-id-45' name='ps' filepath='../gpshead/Parser/parser.c' line='227' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/parser.c' line='227' column='1'/>
      <parameter type-id='type-id-12' name='str' filepath='../gpshead/Parser/parser.c' line='227' column='1'/>
      <parameter type-id='type-id-7' name='lineno' filepath='../gpshead/Parser/parser.c' line='228' column='1'/>
      <parameter type-id='type-id-7' name='col_offset' filepath='../gpshead/Parser/parser.c' line='228' column='1'/>
      <parameter type-id='type-id-18' name='expected_ret' filepath='../gpshead/Parser/parser.c' line='228' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyParser_Delete' mangled-name='PyParser_Delete' filepath='../gpshead/Parser/parser.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_Delete'>
      <parameter type-id='type-id-45' name='ps' filepath='../gpshead/Parser/parser.c' line='96' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyParser_New' mangled-name='PyParser_New' filepath='../gpshead/Parser/parser.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_New'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parser.c' line='72' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parser.c' line='72' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/bitset.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <function-decl name='_Py_mergebitset' mangled-name='_Py_mergebitset' filepath='../gpshead/Parser/bitset.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_mergebitset'>
      <parameter type-id='type-id-14' name='ss1' filepath='../gpshead/Parser/bitset.c' line='60' column='1'/>
      <parameter type-id='type-id-14' name='ss2' filepath='../gpshead/Parser/bitset.c' line='60' column='1'/>
      <parameter type-id='type-id-7' name='nbits' filepath='../gpshead/Parser/bitset.c' line='60' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_samebitset' mangled-name='_Py_samebitset' filepath='../gpshead/Parser/bitset.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_samebitset'>
      <parameter type-id='type-id-14' name='ss1' filepath='../gpshead/Parser/bitset.c' line='49' column='1'/>
      <parameter type-id='type-id-14' name='ss2' filepath='../gpshead/Parser/bitset.c' line='49' column='1'/>
      <parameter type-id='type-id-7' name='nbits' filepath='../gpshead/Parser/bitset.c' line='49' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_addbit' mangled-name='_Py_addbit' filepath='../gpshead/Parser/bitset.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_addbit'>
      <parameter type-id='type-id-14' name='ss' filepath='../gpshead/Parser/bitset.c' line='29' column='1'/>
      <parameter type-id='type-id-7' name='ibit' filepath='../gpshead/Parser/bitset.c' line='29' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_delbitset' mangled-name='_Py_delbitset' filepath='../gpshead/Parser/bitset.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_delbitset'>
      <parameter type-id='type-id-14' name='ss' filepath='../gpshead/Parser/bitset.c' line='23' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_newbitset' mangled-name='_Py_newbitset' filepath='../gpshead/Parser/bitset.c' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_newbitset'>
      <parameter type-id='type-id-7' name='nbits' filepath='../gpshead/Parser/bitset.c' line='8' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/metagrammar.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <function-decl name='Py_meta_grammar' mangled-name='Py_meta_grammar' filepath='../gpshead/Parser/metagrammar.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_meta_grammar'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='_Py_meta_grammar' mangled-name='_Py_meta_grammar' filepath='../gpshead/Parser/metagrammar.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_meta_grammar'>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/firstsets.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <function-decl name='_Py_addfirstsets' mangled-name='_Py_addfirstsets' filepath='../gpshead/Parser/firstsets.c' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_addfirstsets'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/acceler.c' line='24' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/grammar.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <function-decl name='_Py_translatelabels' mangled-name='_Py_translatelabels' filepath='../gpshead/Parser/grammar.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_translatelabels'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/grammar.c' line='155' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-46'/>
    <function-decl name='_Py_findlabel' mangled-name='_Py_findlabel' filepath='../gpshead/Parser/grammar.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_findlabel'>
      <parameter type-id='type-id-46' name='ll' filepath='../gpshead/Parser/grammar.c' line='131' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/grammar.c' line='131' column='1'/>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Parser/grammar.c' line='131' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_addlabel' mangled-name='_Py_addlabel' filepath='../gpshead/Parser/grammar.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_addlabel'>
      <parameter type-id='type-id-46' name='ll' filepath='../gpshead/Parser/grammar.c' line='105' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/grammar.c' line='105' column='1'/>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Parser/grammar.c' line='105' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_addarc' mangled-name='_Py_addarc' filepath='../gpshead/Parser/grammar.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_addarc'>
      <parameter type-id='type-id-8' name='d' filepath='../gpshead/Parser/grammar.c' line='87' column='1'/>
      <parameter type-id='type-id-7' name='from' filepath='../gpshead/Parser/grammar.c' line='87' column='1'/>
      <parameter type-id='type-id-7' name='to' filepath='../gpshead/Parser/grammar.c' line='87' column='1'/>
      <parameter type-id='type-id-7' name='lbl' filepath='../gpshead/Parser/grammar.c' line='87' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_addstate' mangled-name='_Py_addstate' filepath='../gpshead/Parser/grammar.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_addstate'>
      <parameter type-id='type-id-8' name='d' filepath='../gpshead/Parser/grammar.c' line='68' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_adddfa' mangled-name='_Py_adddfa' filepath='../gpshead/Parser/grammar.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_adddfa'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/grammar.c' line='49' column='1'/>
      <parameter type-id='type-id-7' name='type' filepath='../gpshead/Parser/grammar.c' line='49' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='../gpshead/Parser/grammar.c' line='49' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_freegrammar' mangled-name='_Py_freegrammar' filepath='../gpshead/Parser/grammar.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_freegrammar'>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/grammar.c' line='32' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_newgrammar' mangled-name='_Py_newgrammar' filepath='../gpshead/Parser/grammar.c' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_newgrammar'>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/grammar.c' line='15' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/pgen.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <function-decl name='Py_pgen' mangled-name='Py_pgen' filepath='../gpshead/Parser/pgen.c' line='691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_pgen'>
      <parameter type-id='type-id-30' name='n' filepath='../gpshead/Parser/pgen.c' line='691' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='_Py_pgen' mangled-name='_Py_pgen' filepath='../gpshead/Parser/pgen.c' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_pgen'>
      <parameter type-id='type-id-30' name='n' filepath='../gpshead/Parser/pgen.c' line='677' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/myreadline.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <class-decl name='_ts' size-in-bits='2240' is-struct='yes' visibility='default' filepath='../gpshead/Include/pystate.h' line='212' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-48' visibility='default' filepath='../gpshead/Include/pystate.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-48' visibility='default' filepath='../gpshead/Include/pystate.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-49' visibility='default' filepath='../gpshead/Include/pystate.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-50' visibility='default' filepath='../gpshead/Include/pystate.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='overflowed' type-id='type-id-1' visibility='default' filepath='../gpshead/Include/pystate.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='recursion_critical' type-id='type-id-1' visibility='default' filepath='../gpshead/Include/pystate.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stackcheck_counter' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_tracing' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_profilefunc' type-id='type-id-51' visibility='default' filepath='../gpshead/Include/pystate.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_tracefunc' type-id='type-id-51' visibility='default' filepath='../gpshead/Include/pystate.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_profileobj' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_traceobj' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_type' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_value' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_traceback' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_state' type-id='type-id-53' visibility='default' filepath='../gpshead/Include/pystate.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='exc_info' type-id='type-id-54' visibility='default' filepath='../gpshead/Include/pystate.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dict' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='gilstate_counter' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='async_exc' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='thread_id' type-id='type-id-38' visibility='default' filepath='../gpshead/Include/pystate.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='trash_delete_nesting' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='trash_delete_later' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='on_delete' type-id='type-id-55' visibility='default' filepath='../gpshead/Include/pystate.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='on_delete_data' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/pystate.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='coroutine_wrapper' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='in_coroutine_wrapper' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='async_gen_firstiter' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='async_gen_finalizer' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='context' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='context_ver' type-id='type-id-57' visibility='default' filepath='../gpshead/Include/pystate.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='id' type-id='type-id-57' visibility='default' filepath='../gpshead/Include/pystate.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <class-decl name='_is' size-in-bits='20544' is-struct='yes' visibility='default' filepath='../gpshead/Include/pystate.h' line='113' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-59' visibility='default' filepath='../gpshead/Include/pystate.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_head' type-id='type-id-48' visibility='default' filepath='../gpshead/Include/pystate.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='type-id-60' visibility='default' filepath='../gpshead/Include/pystate.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id_refcount' type-id='type-id-60' visibility='default' filepath='../gpshead/Include/pystate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='id_mutex' type-id='type-id-61' visibility='default' filepath='../gpshead/Include/pystate.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='modules' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='modules_by_index' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sysdict' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='builtins' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='importlib' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='check_interval' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='num_threads' type-id='type-id-31' visibility='default' filepath='../gpshead/Include/pystate.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='pythread_stacksize' type-id='type-id-62' visibility='default' filepath='../gpshead/Include/pystate.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='codec_search_path' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='codec_search_cache' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='codec_error_registry' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='codecs_initialized' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='fscodec_initialized' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='core_config' type-id='type-id-63' visibility='default' filepath='../gpshead/Include/pystate.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='config' type-id='type-id-64' visibility='default' filepath='../gpshead/Include/pystate.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='dlopenflags' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='builtins_copy' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='import_func' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='eval_frame' type-id='type-id-65' visibility='default' filepath='../gpshead/Include/pystate.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='co_extra_user_count' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/pystate.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-66' visibility='default' filepath='../gpshead/Include/pystate.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20160'>
        <var-decl name='before_forkers' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20224'>
        <var-decl name='after_forkers_parent' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20288'>
        <var-decl name='after_forkers_child' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20352'>
        <var-decl name='pyexitfunc' type-id='type-id-67' visibility='default' filepath='../gpshead/Include/pystate.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20416'>
        <var-decl name='pyexitmodule' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20480'>
        <var-decl name='tstate_next_unique_id' type-id='type-id-57' visibility='default' filepath='../gpshead/Include/pystate.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-59'/>
    <typedef-decl name='__int64_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-68'/>
    <typedef-decl name='int64_t' type-id='type-id-68' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-60'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-56'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-56' filepath='../gpshead/Include/pythread.h' line='5' column='1' id='type-id-61'/>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='../gpshead/Include/object.h' line='106' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-70' visibility='default' filepath='../gpshead/Include/object.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' size-in-bits='3200' is-struct='yes' visibility='default' filepath='../gpshead/Include/object.h' line='346' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-72' visibility='default' filepath='../gpshead/Include/object.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/object.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-73' visibility='default' filepath='../gpshead/Include/object.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_print' type-id='type-id-74' visibility='default' filepath='../gpshead/Include/object.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-75' visibility='default' filepath='../gpshead/Include/object.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-76' visibility='default' filepath='../gpshead/Include/object.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-77' visibility='default' filepath='../gpshead/Include/object.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-78' visibility='default' filepath='../gpshead/Include/object.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-79' visibility='default' filepath='../gpshead/Include/object.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-80' visibility='default' filepath='../gpshead/Include/object.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-81' visibility='default' filepath='../gpshead/Include/object.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-82' visibility='default' filepath='../gpshead/Include/object.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-83' visibility='default' filepath='../gpshead/Include/object.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-78' visibility='default' filepath='../gpshead/Include/object.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-84' visibility='default' filepath='../gpshead/Include/object.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-85' visibility='default' filepath='../gpshead/Include/object.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-86' visibility='default' filepath='../gpshead/Include/object.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-38' visibility='default' filepath='../gpshead/Include/object.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/object.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-87' visibility='default' filepath='../gpshead/Include/object.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-88' visibility='default' filepath='../gpshead/Include/object.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-89' visibility='default' filepath='../gpshead/Include/object.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-90' visibility='default' filepath='../gpshead/Include/object.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-91' visibility='default' filepath='../gpshead/Include/object.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-92' visibility='default' filepath='../gpshead/Include/object.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-93' visibility='default' filepath='../gpshead/Include/object.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-94' visibility='default' filepath='../gpshead/Include/object.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-70' visibility='default' filepath='../gpshead/Include/object.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-95' visibility='default' filepath='../gpshead/Include/object.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-96' visibility='default' filepath='../gpshead/Include/object.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-97' visibility='default' filepath='../gpshead/Include/object.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-98' visibility='default' filepath='../gpshead/Include/object.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-99' visibility='default' filepath='../gpshead/Include/object.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-100' visibility='default' filepath='../gpshead/Include/object.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-88' visibility='default' filepath='../gpshead/Include/object.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-73' visibility='default' filepath='../gpshead/Include/object.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-101' visibility='default' filepath='../gpshead/Include/object.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-73' visibility='default' filepath='../gpshead/Include/object.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-72' visibility='default' filepath='../gpshead/Include/object.h' line='112' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-103' visibility='default' filepath='../gpshead/Include/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyObject' type-id='type-id-69' filepath='../gpshead/Include/object.h' line='110' column='1' id='type-id-103'/>
    <typedef-decl name='PyVarObject' type-id='type-id-102' filepath='../gpshead/Include/object.h' line='115' column='1' id='type-id-72'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-67'/>
    <typedef-decl name='destructor' type-id='type-id-67' filepath='../gpshead/Include/object.h' line='320' column='1' id='type-id-73'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-106' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-107' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-108' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-111' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-112' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-114' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-115' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-107' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-56' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-7' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-116' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-107'/>
    <typedef-decl name='__off_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-108'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-109'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-110'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-111'>
      <subrange length='1' type-id='type-id-38' id='type-id-118'/>

    </array-type-def>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-119'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-112'/>
    <typedef-decl name='__off64_t' type-id='type-id-31' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-113'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-114'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-115'/>
    <typedef-decl name='size_t' type-id='type-id-38' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-62'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-116'>
      <subrange length='20' type-id='type-id-38' id='type-id-122'/>

    </array-type-def>
    <typedef-decl name='FILE' type-id='type-id-105' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <typedef-decl name='printfunc' type-id='type-id-126' filepath='../gpshead/Include/object.h' line='326' column='1' id='type-id-74'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <typedef-decl name='getattrfunc' type-id='type-id-128' filepath='../gpshead/Include/object.h' line='328' column='1' id='type-id-75'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='setattrfunc' type-id='type-id-130' filepath='../gpshead/Include/object.h' line='330' column='1' id='type-id-76'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='../gpshead/Include/object.h' line='307' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <typedef-decl name='unaryfunc' type-id='type-id-135' filepath='../gpshead/Include/object.h' line='169' column='1' id='type-id-133'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-132' filepath='../gpshead/Include/object.h' line='311' column='1' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-77'/>
    <typedef-decl name='reprfunc' type-id='type-id-135' filepath='../gpshead/Include/object.h' line='332' column='1' id='type-id-78'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-136' visibility='default' filepath='../gpshead/Include/object.h' line='240' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-83' visibility='default' filepath='../gpshead/Include/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-88' visibility='default' filepath='../gpshead/Include/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-83' visibility='default' filepath='../gpshead/Include/object.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-133' visibility='default' filepath='../gpshead/Include/object.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <typedef-decl name='binaryfunc' type-id='type-id-140' filepath='../gpshead/Include/object.h' line='170' column='1' id='type-id-138'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-142'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-142' filepath='../gpshead/Include/object.h' line='171' column='1' id='type-id-83'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-144'/>
    <typedef-decl name='inquiry' type-id='type-id-144' filepath='../gpshead/Include/object.h' line='172' column='1' id='type-id-88'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-137' filepath='../gpshead/Include/object.h' line='285' column='1' id='type-id-136'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-79'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-145' visibility='default' filepath='../gpshead/Include/object.h' line='287' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-147' visibility='default' filepath='../gpshead/Include/object.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-148' visibility='default' filepath='../gpshead/Include/object.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-148' visibility='default' filepath='../gpshead/Include/object.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/object.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-149' visibility='default' filepath='../gpshead/Include/object.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/object.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-150' visibility='default' filepath='../gpshead/Include/object.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-148' visibility='default' filepath='../gpshead/Include/object.h' line='298' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-152'/>
    <typedef-decl name='lenfunc' type-id='type-id-152' filepath='../gpshead/Include/object.h' line='173' column='1' id='type-id-147'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-154'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-154' filepath='../gpshead/Include/object.h' line='174' column='1' id='type-id-148'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-156'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-156' filepath='../gpshead/Include/object.h' line='176' column='1' id='type-id-149'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <typedef-decl name='objobjproc' type-id='type-id-158' filepath='../gpshead/Include/object.h' line='235' column='1' id='type-id-150'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-146' filepath='../gpshead/Include/object.h' line='299' column='1' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-80'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-159' visibility='default' filepath='../gpshead/Include/object.h' line='301' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-147' visibility='default' filepath='../gpshead/Include/object.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-138' visibility='default' filepath='../gpshead/Include/object.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-161' visibility='default' filepath='../gpshead/Include/object.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <typedef-decl name='objobjargproc' type-id='type-id-163' filepath='../gpshead/Include/object.h' line='178' column='1' id='type-id-161'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-160' filepath='../gpshead/Include/object.h' line='305' column='1' id='type-id-159'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-34' filepath='../gpshead/Include/pyport.h' line='93' column='1' id='type-id-164'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-166'/>
    <typedef-decl name='hashfunc' type-id='type-id-166' filepath='../gpshead/Include/object.h' line='333' column='1' id='type-id-82'/>
    <typedef-decl name='getattrofunc' type-id='type-id-140' filepath='../gpshead/Include/object.h' line='329' column='1' id='type-id-84'/>
    <typedef-decl name='setattrofunc' type-id='type-id-163' filepath='../gpshead/Include/object.h' line='331' column='1' id='type-id-85'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-167' visibility='default' filepath='../gpshead/Include/object.h' line='313' column='1' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-169' visibility='default' filepath='../gpshead/Include/object.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-170' visibility='default' filepath='../gpshead/Include/object.h' line='315' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bufferinfo' size-in-bits='640' is-struct='yes' visibility='default' filepath='../gpshead/Include/object.h' line='182' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/object.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/object.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/object.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-12' visibility='default' filepath='../gpshead/Include/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-172' visibility='default' filepath='../gpshead/Include/object.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-172' visibility='default' filepath='../gpshead/Include/object.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-172' visibility='default' filepath='../gpshead/Include/object.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/object.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-172'/>
    <typedef-decl name='Py_buffer' type-id='type-id-171' filepath='../gpshead/Include/object.h' line='195' column='1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-176'/>
    <typedef-decl name='getbufferproc' type-id='type-id-176' filepath='../gpshead/Include/object.h' line='197' column='1' id='type-id-169'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-178' filepath='../gpshead/Include/object.h' line='198' column='1' id='type-id-170'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-168' filepath='../gpshead/Include/object.h' line='316' column='1' id='type-id-167'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <typedef-decl name='visitproc' type-id='type-id-180' filepath='../gpshead/Include/object.h' line='236' column='1' id='type-id-181'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-183'/>
    <typedef-decl name='traverseproc' type-id='type-id-183' filepath='../gpshead/Include/object.h' line='237' column='1' id='type-id-87'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-185'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-185' filepath='../gpshead/Include/object.h' line='334' column='1' id='type-id-89'/>
    <typedef-decl name='getiterfunc' type-id='type-id-135' filepath='../gpshead/Include/object.h' line='335' column='1' id='type-id-90'/>
    <typedef-decl name='iternextfunc' type-id='type-id-135' filepath='../gpshead/Include/object.h' line='336' column='1' id='type-id-91'/>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='../gpshead/Include/methodobject.h' line='56' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/methodobject.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-187' visibility='default' filepath='../gpshead/Include/methodobject.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/methodobject.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/methodobject.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCFunction' type-id='type-id-140' filepath='../gpshead/Include/methodobject.h' line='18' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-92'/>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-188'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-93'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='../gpshead/Include/descrobject.h' line='11' column='1' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-190' visibility='default' filepath='../gpshead/Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-191' visibility='default' filepath='../gpshead/Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-193'/>
    <typedef-decl name='getter' type-id='type-id-193' filepath='../gpshead/Include/descrobject.h' line='8' column='1' id='type-id-190'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <typedef-decl name='setter' type-id='type-id-195' filepath='../gpshead/Include/descrobject.h' line='9' column='1' id='type-id-191'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-70'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-142' filepath='../gpshead/Include/object.h' line='337' column='1' id='type-id-95'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-163' filepath='../gpshead/Include/object.h' line='338' column='1' id='type-id-96'/>
    <typedef-decl name='initproc' type-id='type-id-163' filepath='../gpshead/Include/object.h' line='339' column='1' id='type-id-97'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <typedef-decl name='allocfunc' type-id='type-id-197' filepath='../gpshead/Include/object.h' line='341' column='1' id='type-id-98'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-199'/>
    <typedef-decl name='newfunc' type-id='type-id-199' filepath='../gpshead/Include/object.h' line='340' column='1' id='type-id-99'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-55'/>
    <typedef-decl name='freefunc' type-id='type-id-55' filepath='../gpshead/Include/object.h' line='319' column='1' id='type-id-100'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-101'/>
    <class-decl name='__anonymous_struct__' size-in-bits='1792' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-63' visibility='default' filepath='../gpshead/Include/pystate.h' line='29' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='install_signal_handlers' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ignore_environment' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_hash_seed' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash_seed' type-id='type-id-38' visibility='default' filepath='../gpshead/Include/pystate.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allocator' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/pystate.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_mode' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='faulthandler' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tracemalloc' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='import_time' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_ref_count' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='show_alloc_count' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dump_refs' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='malloc_stats' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='coerce_c_locale' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='coerce_c_locale_warn' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='utf8_mode' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='program_name' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='argc' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='argv' type-id='type-id-203' visibility='default' filepath='../gpshead/Include/pystate.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='program' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nxoption' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xoptions' type-id='type-id-203' visibility='default' filepath='../gpshead/Include/pystate.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nwarnoption' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='warnoptions' type-id='type-id-203' visibility='default' filepath='../gpshead/Include/pystate.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='module_search_path_env' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='home' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nmodule_search_path' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='module_search_paths' type-id='type-id-203' visibility='default' filepath='../gpshead/Include/pystate.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='executable' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='prefix' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='base_prefix' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='exec_prefix' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='base_exec_prefix' type-id='type-id-202' visibility='default' filepath='../gpshead/Include/pystate.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='_disable_importlib' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wchar_t' type-id='type-id-7' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='321' column='1' id='type-id-204'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-202'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-203'/>
    <typedef-decl name='_PyCoreConfig' type-id='type-id-201' filepath='../gpshead/Include/pystate.h' line='77' column='1' id='type-id-63'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-64' visibility='default' filepath='../gpshead/Include/pystate.h' line='96' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='install_signal_handlers' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/pystate.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='argv' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='executable' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='prefix' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='base_prefix' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='exec_prefix' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='base_exec_prefix' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='warnoptions' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='xoptions' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='module_search_path' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyMainInterpreterConfig' type-id='type-id-205' filepath='../gpshead/Include/pystate.h' line='107' column='1' id='type-id-64'/>
    <class-decl name='_frame' size-in-bits='2944' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-208'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-208' filepath='../gpshead/Include/pystate.h' line='26' column='1' id='type-id-65'/>

    <array-type-def dimensions='1' type-id='type-id-100' size-in-bits='16320' id='type-id-66'>
      <subrange length='255' type-id='type-id-38' id='type-id-209'/>

    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-210'/>
    <typedef-decl name='uint64_t' type-id='type-id-210' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-57'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-58' filepath='../gpshead/Include/pystate.h' line='169' column='1' id='type-id-211'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-213' filepath='../gpshead/Include/pystate.h' line='177' column='1' id='type-id-51'/>
    <class-decl name='_err_stackitem' size-in-bits='256' is-struct='yes' visibility='default' filepath='../gpshead/Include/pystate.h' line='198' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exc_type' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exc_value' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='exc_traceback' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/pystate.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='previous_item' type-id='type-id-215' visibility='default' filepath='../gpshead/Include/pystate.h' line='207' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-215'/>
    <typedef-decl name='_PyErr_StackItem' type-id='type-id-214' filepath='../gpshead/Include/pystate.h' line='209' column='1' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <typedef-decl name='PyThreadState' type-id='type-id-47' filepath='../gpshead/Include/pystate.h' line='305' column='1' id='type-id-216'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' id='type-id-217'/>
    <var-decl name='_PyOS_ReadlineTState' type-id='type-id-217' mangled-name='_PyOS_ReadlineTState' visibility='default' filepath='../gpshead/Include/pythonrun.h' line='160' column='1' elf-symbol-id='_PyOS_ReadlineTState'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-219'/>
    <var-decl name='PyOS_InputHook' type-id='type-id-219' mangled-name='PyOS_InputHook' visibility='default' filepath='../gpshead/Include/pythonrun.h' line='157' column='1' elf-symbol-id='PyOS_InputHook'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' id='type-id-221'/>
    <var-decl name='PyOS_ReadlineFunctionPointer' type-id='type-id-221' mangled-name='PyOS_ReadlineFunctionPointer' visibility='default' filepath='../gpshead/Include/pythonrun.h' line='158' column='1' elf-symbol-id='PyOS_ReadlineFunctionPointer'/>
    <function-decl name='PyOS_Readline' mangled-name='PyOS_Readline' filepath='../gpshead/Parser/myreadline.c' line='322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_Readline'>
      <parameter type-id='type-id-124' name='sys_stdin' filepath='../gpshead/Parser/myreadline.c' line='322' column='1'/>
      <parameter type-id='type-id-124' name='sys_stdout' filepath='../gpshead/Parser/myreadline.c' line='322' column='1'/>
      <parameter type-id='type-id-3' name='prompt' filepath='../gpshead/Parser/myreadline.c' line='322' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyOS_StdioReadline' mangled-name='PyOS_StdioReadline' filepath='../gpshead/Parser/myreadline.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_StdioReadline'>
      <parameter type-id='type-id-124' name='sys_stdin' filepath='../gpshead/Parser/myreadline.c' line='209' column='1'/>
      <parameter type-id='type-id-124' name='sys_stdout' filepath='../gpshead/Parser/myreadline.c' line='209' column='1'/>
      <parameter type-id='type-id-3' name='prompt' filepath='../gpshead/Parser/myreadline.c' line='209' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-139'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-141'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-153'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-192'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-207'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-198'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-196'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-52'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-220'>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-12'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-218'>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-143'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-125'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-157'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-162'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-194'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-212'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-129'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-155'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-179'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-164'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-151'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-34'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-104'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-200'>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/parsetok.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-222' visibility='default' filepath='../gpshead/Include/parsetok.h' line='10' column='1' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/parsetok.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='filename' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/parsetok.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lineno' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/parsetok.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='offset' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/parsetok.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='text' type-id='type-id-12' visibility='default' filepath='../gpshead/Include/parsetok.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='token' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/parsetok.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='expected' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/parsetok.h' line='20' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='perrdetail' type-id='type-id-223' filepath='../gpshead/Include/parsetok.h' line='21' column='1' id='type-id-222'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' id='type-id-224'/>
    <function-decl name='PyParser_ParseFileFlagsEx' mangled-name='PyParser_ParseFileFlagsEx' filepath='../gpshead/Parser/parsetok.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileFlagsEx'>
      <parameter type-id='type-id-124' name='fp' filepath='../gpshead/Parser/parsetok.c' line='138' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='../gpshead/Parser/parsetok.c' line='138' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='../gpshead/Parser/parsetok.c' line='139' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='139' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='139' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='../gpshead/Parser/parsetok.c' line='140' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='../gpshead/Parser/parsetok.c' line='140' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='141' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='../gpshead/Parser/parsetok.c' line='141' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseFileObject' mangled-name='PyParser_ParseFileObject' filepath='../gpshead/Parser/parsetok.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileObject'>
      <parameter type-id='type-id-124' name='fp' filepath='../gpshead/Parser/parsetok.c' line='116' column='1'/>
      <parameter type-id='type-id-52' name='filename' filepath='../gpshead/Parser/parsetok.c' line='116' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='../gpshead/Parser/parsetok.c' line='117' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='117' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='117' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='../gpshead/Parser/parsetok.c' line='118' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='../gpshead/Parser/parsetok.c' line='118' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='119' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='../gpshead/Parser/parsetok.c' line='119' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseFileFlags' mangled-name='PyParser_ParseFileFlags' filepath='../gpshead/Parser/parsetok.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFileFlags'>
      <parameter type-id='type-id-124' name='fp' filepath='../gpshead/Parser/parsetok.c' line='105' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='../gpshead/Parser/parsetok.c' line='105' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='../gpshead/Parser/parsetok.c' line='105' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='106' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='106' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='../gpshead/Parser/parsetok.c' line='107' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='../gpshead/Parser/parsetok.c' line='107' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='108' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='../gpshead/Parser/parsetok.c' line='108' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseFile' mangled-name='PyParser_ParseFile' filepath='../gpshead/Parser/parsetok.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseFile'>
      <parameter type-id='type-id-124' name='fp' filepath='../gpshead/Parser/parsetok.c' line='96' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='../gpshead/Parser/parsetok.c' line='96' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='96' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='96' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='../gpshead/Parser/parsetok.c' line='97' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='../gpshead/Parser/parsetok.c' line='97' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='98' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlagsFilenameEx' mangled-name='PyParser_ParseStringFlagsFilenameEx' filepath='../gpshead/Parser/parsetok.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlagsFilenameEx'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Parser/parsetok.c' line='71' column='1'/>
      <parameter type-id='type-id-3' name='filename_str' filepath='../gpshead/Parser/parsetok.c' line='71' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='72' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='72' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='73' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='../gpshead/Parser/parsetok.c' line='73' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringObject' mangled-name='PyParser_ParseStringObject' filepath='../gpshead/Parser/parsetok.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringObject'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Parser/parsetok.c' line='44' column='1'/>
      <parameter type-id='type-id-52' name='filename' filepath='../gpshead/Parser/parsetok.c' line='44' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='45' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='45' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='46' column='1'/>
      <parameter type-id='type-id-18' name='flags' filepath='../gpshead/Parser/parsetok.c' line='46' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlagsFilename' mangled-name='PyParser_ParseStringFlagsFilename' filepath='../gpshead/Parser/parsetok.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlagsFilename'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Parser/parsetok.c' line='34' column='1'/>
      <parameter type-id='type-id-3' name='filename' filepath='../gpshead/Parser/parsetok.c' line='34' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='35' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='35' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='36' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='../gpshead/Parser/parsetok.c' line='36' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseStringFlags' mangled-name='PyParser_ParseStringFlags' filepath='../gpshead/Parser/parsetok.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseStringFlags'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Parser/parsetok.c' line='26' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='26' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='26' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='27' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='../gpshead/Parser/parsetok.c' line='27' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='PyParser_ParseString' mangled-name='PyParser_ParseString' filepath='../gpshead/Parser/parsetok.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyParser_ParseString'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Parser/parsetok.c' line='20' column='1'/>
      <parameter type-id='type-id-26' name='g' filepath='../gpshead/Parser/parsetok.c' line='20' column='1'/>
      <parameter type-id='type-id-7' name='start' filepath='../gpshead/Parser/parsetok.c' line='20' column='1'/>
      <parameter type-id='type-id-224' name='err_ret' filepath='../gpshead/Parser/parsetok.c' line='20' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Parser/tokenizer.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='infinite' id='type-id-225'>
      <subrange length='infinite' id='type-id-226'/>

    </array-type-def>
    <var-decl name='_PyParser_TokenNames' type-id='type-id-225' mangled-name='_PyParser_TokenNames' visibility='default' filepath='../gpshead/Include/token.h' line='83' column='1' elf-symbol-id='_PyParser_TokenNames'/>
    <function-decl name='PyTokenizer_FindEncoding' mangled-name='PyTokenizer_FindEncoding' filepath='../gpshead/Parser/tokenizer.c' line='1906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FindEncoding'>
      <parameter type-id='type-id-7' name='fd' filepath='../gpshead/Parser/tokenizer.c' line='1906' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyTokenizer_FindEncodingFilename' mangled-name='PyTokenizer_FindEncodingFilename' filepath='../gpshead/Parser/tokenizer.c' line='1854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FindEncodingFilename'>
      <parameter type-id='type-id-7' name='fd' filepath='../gpshead/Parser/tokenizer.c' line='1854' column='1'/>
      <parameter type-id='type-id-52' name='filename' filepath='../gpshead/Parser/tokenizer.c' line='1854' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <class-decl name='tok_state' size-in-bits='7872' is-struct='yes' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='22' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-12' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cur' type-id='type-id-12' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='inp' type-id='type-id-12' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='end' type-id='type-id-12' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='start' type-id='type-id-12' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='done' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fp' type-id='type-id-124' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tabsize' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='indent' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='indstack' type-id='type-id-228' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='atbol' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3744'>
        <var-decl name='pendin' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='prompt' type-id='type-id-3' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='nextprompt' type-id='type-id-3' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='lineno' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3936'>
        <var-decl name='level' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='filename' type-id='type-id-52' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='altindstack' type-id='type-id-228' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='decoding_state' type-id='type-id-229' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7264'>
        <var-decl name='decoding_erred' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='read_coding_spec' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='encoding' type-id='type-id-12' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='cont_line' type-id='type-id-7' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='line_start' type-id='type-id-3' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='decoding_readline' type-id='type-id-52' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='decoding_buffer' type-id='type-id-52' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='enc' type-id='type-id-3' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='str' type-id='type-id-3' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='input' type-id='type-id-3' visibility='default' filepath='../gpshead/Parser/tokenizer.h' line='64' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='3200' id='type-id-228'>
      <subrange length='100' type-id='type-id-38' id='type-id-230'/>

    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-231'/>
    <enum-decl name='decoding_state' filepath='../gpshead/Parser/tokenizer.h' line='15' column='1' id='type-id-229'>
      <underlying-type type-id='type-id-231'/>
      <enumerator name='STATE_INIT' value='0'/>
      <enumerator name='STATE_RAW' value='1'/>
      <enumerator name='STATE_NORMAL' value='2'/>
    </enum-decl>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-233'/>
    <function-decl name='PyTokenizer_Get' mangled-name='PyTokenizer_Get' filepath='../gpshead/Parser/tokenizer.c' line='1833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_Get'>
      <parameter type-id='type-id-232' name='tok' filepath='../gpshead/Parser/tokenizer.c' line='1833' column='1'/>
      <parameter type-id='type-id-233' name='p_start' filepath='../gpshead/Parser/tokenizer.c' line='1833' column='1'/>
      <parameter type-id='type-id-233' name='p_end' filepath='../gpshead/Parser/tokenizer.c' line='1833' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='../gpshead/Parser/tokenizer.c' line='1236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_ThreeChars'>
      <parameter type-id='type-id-7' name='c1' filepath='../gpshead/Parser/tokenizer.c' line='1236' column='1'/>
      <parameter type-id='type-id-7' name='c2' filepath='../gpshead/Parser/tokenizer.c' line='1236' column='1'/>
      <parameter type-id='type-id-7' name='c3' filepath='../gpshead/Parser/tokenizer.c' line='1236' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='../gpshead/Parser/tokenizer.c' line='1157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_TwoChars'>
      <parameter type-id='type-id-7' name='c1' filepath='../gpshead/Parser/tokenizer.c' line='1157' column='1'/>
      <parameter type-id='type-id-7' name='c2' filepath='../gpshead/Parser/tokenizer.c' line='1157' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='../gpshead/Parser/tokenizer.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_OneChar'>
      <parameter type-id='type-id-7' name='c' filepath='../gpshead/Parser/tokenizer.c' line='1125' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyTokenizer_Free' mangled-name='PyTokenizer_Free' filepath='../gpshead/Parser/tokenizer.c' line='893' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_Free'>
      <parameter type-id='type-id-232' name='tok' filepath='../gpshead/Parser/tokenizer.c' line='893' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromFile' mangled-name='PyTokenizer_FromFile' filepath='../gpshead/Parser/tokenizer.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FromFile'>
      <parameter type-id='type-id-124' name='fp' filepath='../gpshead/Parser/tokenizer.c' line='860' column='1'/>
      <parameter type-id='type-id-3' name='enc' filepath='../gpshead/Parser/tokenizer.c' line='860' column='1'/>
      <parameter type-id='type-id-3' name='ps1' filepath='../gpshead/Parser/tokenizer.c' line='861' column='1'/>
      <parameter type-id='type-id-3' name='ps2' filepath='../gpshead/Parser/tokenizer.c' line='861' column='1'/>
      <return type-id='type-id-232'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromUTF8' mangled-name='PyTokenizer_FromUTF8' filepath='../gpshead/Parser/tokenizer.c' line='829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FromUTF8'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Parser/tokenizer.c' line='829' column='1'/>
      <parameter type-id='type-id-7' name='exec_input' filepath='../gpshead/Parser/tokenizer.c' line='829' column='1'/>
      <return type-id='type-id-232'/>
    </function-decl>
    <function-decl name='PyTokenizer_FromString' mangled-name='PyTokenizer_FromString' filepath='../gpshead/Parser/tokenizer.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTokenizer_FromString'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Parser/tokenizer.c' line='829' column='1'/>
      <parameter type-id='type-id-7' name='exec_input' filepath='../gpshead/Parser/tokenizer.c' line='829' column='1'/>
      <return type-id='type-id-232'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/abstract.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <qualified-type-def type-id='type-id-12' const='yes' id='type-id-234'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='../gpshead/Objects/abstract.c' line='2632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-235' name='array' filepath='../gpshead/Objects/abstract.c' line='2632' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='../gpshead/Include/structmember.h' line='18' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='../gpshead/Objects/abstract.c' line='2573' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/abstract.c' line='2573' column='1'/>
      <return type-id='type-id-235'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='../gpshead/Objects/abstract.c' line='2552' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='../gpshead/Objects/abstract.c' line='2519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2519' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='../gpshead/Objects/abstract.c' line='2512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-52' name='derived' filepath='../gpshead/Objects/abstract.c' line='2512' column='1'/>
      <parameter type-id='type-id-52' name='cls' filepath='../gpshead/Objects/abstract.c' line='2512' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='../gpshead/Objects/abstract.c' line='2506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-52' name='derived' filepath='../gpshead/Objects/abstract.c' line='2512' column='1'/>
      <parameter type-id='type-id-52' name='cls' filepath='../gpshead/Objects/abstract.c' line='2512' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='../gpshead/Objects/abstract.c' line='2450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-52' name='derived' filepath='../gpshead/Objects/abstract.c' line='2450' column='1'/>
      <parameter type-id='type-id-52' name='cls' filepath='../gpshead/Objects/abstract.c' line='2450' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='../gpshead/Objects/abstract.c' line='2375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-52' name='derived' filepath='../gpshead/Objects/abstract.c' line='2450' column='1'/>
      <parameter type-id='type-id-52' name='cls' filepath='../gpshead/Objects/abstract.c' line='2450' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='../gpshead/Objects/abstract.c' line='2223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='../gpshead/Objects/abstract.c' line='2209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='../gpshead/Objects/abstract.c' line='2195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='../gpshead/Objects/abstract.c' line='2150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2150' column='1'/>
      <parameter type-id='type-id-52' name='key' filepath='../gpshead/Objects/abstract.c' line='2150' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='../gpshead/Objects/abstract.c' line='2136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2136' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='../gpshead/Objects/abstract.c' line='2136' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='../gpshead/Objects/abstract.c' line='2117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2117' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='../gpshead/Objects/abstract.c' line='2117' column='1'/>
      <parameter type-id='type-id-52' name='value' filepath='../gpshead/Objects/abstract.c' line='2117' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='../gpshead/Objects/abstract.c' line='2100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2100' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='../gpshead/Objects/abstract.c' line='2100' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='../gpshead/Objects/abstract.c' line='2093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2093' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='../gpshead/Objects/abstract.c' line='2071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2071' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='../gpshead/Objects/abstract.c' line='2064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2064' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='../gpshead/Objects/abstract.c' line='2056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='2056' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2056' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='../gpshead/Objects/abstract.c' line='2050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-52' name='derived' filepath='../gpshead/Objects/abstract.c' line='2512' column='1'/>
      <parameter type-id='type-id-52' name='cls' filepath='../gpshead/Objects/abstract.c' line='2512' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='../gpshead/Objects/abstract.c' line='2037' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-52' name='seq' filepath='../gpshead/Objects/abstract.c' line='2037' column='1'/>
      <parameter type-id='type-id-52' name='ob' filepath='../gpshead/Objects/abstract.c' line='2037' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='../gpshead/Objects/abstract.c' line='2028' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='2056' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2056' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='../gpshead/Objects/abstract.c' line='1945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-52' name='seq' filepath='../gpshead/Objects/abstract.c' line='1945' column='1'/>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='1945' column='1'/>
      <parameter type-id='type-id-7' name='operation' filepath='../gpshead/Objects/abstract.c' line='1945' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='../gpshead/Objects/abstract.c' line='1912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1912' column='1'/>
      <parameter type-id='type-id-3' name='m' filepath='../gpshead/Objects/abstract.c' line='1912' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='../gpshead/Objects/abstract.c' line='1889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1889' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='../gpshead/Objects/abstract.c' line='1805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1805' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='../gpshead/Objects/abstract.c' line='1781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1781' column='1'/>
      <parameter type-id='type-id-34' name='i1' filepath='../gpshead/Objects/abstract.c' line='1781' column='1'/>
      <parameter type-id='type-id-34' name='i2' filepath='../gpshead/Objects/abstract.c' line='1781' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='../gpshead/Objects/abstract.c' line='1756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1756' column='1'/>
      <parameter type-id='type-id-34' name='i1' filepath='../gpshead/Objects/abstract.c' line='1756' column='1'/>
      <parameter type-id='type-id-34' name='i2' filepath='../gpshead/Objects/abstract.c' line='1756' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1756' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='../gpshead/Objects/abstract.c' line='1727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1727' column='1'/>
      <parameter type-id='type-id-34' name='i' filepath='../gpshead/Objects/abstract.c' line='1727' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='../gpshead/Objects/abstract.c' line='1698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1698' column='1'/>
      <parameter type-id='type-id-34' name='i' filepath='../gpshead/Objects/abstract.c' line='1698' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1698' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='../gpshead/Objects/abstract.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1675' column='1'/>
      <parameter type-id='type-id-34' name='i1' filepath='../gpshead/Objects/abstract.c' line='1675' column='1'/>
      <parameter type-id='type-id-34' name='i2' filepath='../gpshead/Objects/abstract.c' line='1675' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='../gpshead/Objects/abstract.c' line='1648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1648' column='1'/>
      <parameter type-id='type-id-34' name='i' filepath='../gpshead/Objects/abstract.c' line='1648' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='../gpshead/Objects/abstract.c' line='1618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1648' column='1'/>
      <parameter type-id='type-id-34' name='i' filepath='../gpshead/Objects/abstract.c' line='1648' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='../gpshead/Objects/abstract.c' line='1593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='../gpshead/Objects/abstract.c' line='1563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1648' column='1'/>
      <parameter type-id='type-id-34' name='i' filepath='../gpshead/Objects/abstract.c' line='1648' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='../gpshead/Objects/abstract.c' line='1538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='../gpshead/Objects/abstract.c' line='1531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2093' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='../gpshead/Objects/abstract.c' line='1509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2071' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='../gpshead/Objects/abstract.c' line='1500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2064' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='../gpshead/Objects/abstract.c' line='1481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-52' name='n' filepath='../gpshead/Objects/abstract.c' line='1481' column='1'/>
      <parameter type-id='type-id-7' name='base' filepath='../gpshead/Objects/abstract.c' line='1481' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='../gpshead/Objects/abstract.c' line='1434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1434' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='../gpshead/Objects/abstract.c' line='1342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1342' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='../gpshead/Objects/abstract.c' line='1297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-52' name='item' filepath='../gpshead/Objects/abstract.c' line='1297' column='1'/>
      <parameter type-id='type-id-52' name='err' filepath='../gpshead/Objects/abstract.c' line='1297' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='../gpshead/Objects/abstract.c' line='1255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-52' name='item' filepath='../gpshead/Objects/abstract.c' line='1255' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='../gpshead/Objects/abstract.c' line='1235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='../gpshead/Objects/abstract.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='../gpshead/Objects/abstract.c' line='1203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='../gpshead/Objects/abstract.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='../gpshead/Objects/abstract.c' line='1172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='z' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='../gpshead/Objects/abstract.c' line='1165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='../gpshead/Objects/abstract.c' line='1158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='../gpshead/Objects/abstract.c' line='1129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='../gpshead/Objects/abstract.c' line='1108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='../gpshead/Objects/abstract.c' line='1101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='../gpshead/Objects/abstract.c' line='1094' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InMatrixMultiply' mangled-name='PyNumber_InMatrixMultiply' filepath='../gpshead/Objects/abstract.c' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InMatrixMultiply'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='../gpshead/Objects/abstract.c' line='1090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='../gpshead/Objects/abstract.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='../gpshead/Objects/abstract.c' line='1088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='../gpshead/Objects/abstract.c' line='1087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='../gpshead/Objects/abstract.c' line='1086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='../gpshead/Objects/abstract.c' line='1085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='../gpshead/Objects/abstract.c' line='1029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='z' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='../gpshead/Objects/abstract.c' line='1023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='../gpshead/Objects/abstract.c' line='1017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='../gpshead/Objects/abstract.c' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='../gpshead/Objects/abstract.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='../gpshead/Objects/abstract.c' line='986' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='../gpshead/Objects/abstract.c' line='955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-52' name='s' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1593' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='../gpshead/Objects/abstract.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='../gpshead/Objects/abstract.c' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='../gpshead/Objects/abstract.c' line='950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='../gpshead/Objects/abstract.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='../gpshead/Objects/abstract.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='../gpshead/Objects/abstract.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='../gpshead/Objects/abstract.c' line='946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='../gpshead/Objects/abstract.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2064' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='../gpshead/Objects/abstract.c' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='698' column='1'/>
      <parameter type-id='type-id-52' name='format_spec' filepath='../gpshead/Objects/abstract.c' line='698' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='../gpshead/Objects/abstract.c' line='684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-174' name='view' filepath='../gpshead/Objects/abstract.c' line='684' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='../gpshead/Objects/abstract.c' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-174' name='view' filepath='../gpshead/Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-56' name='buf' filepath='../gpshead/Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/abstract.c' line='645' column='1'/>
      <parameter type-id='type-id-7' name='readonly' filepath='../gpshead/Objects/abstract.c' line='646' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='../gpshead/Objects/abstract.c' line='646' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='../gpshead/Objects/abstract.c' line='621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-7' name='nd' filepath='../gpshead/Objects/abstract.c' line='621' column='1'/>
      <parameter type-id='type-id-172' name='shape' filepath='../gpshead/Objects/abstract.c' line='621' column='1'/>
      <parameter type-id='type-id-172' name='strides' filepath='../gpshead/Objects/abstract.c' line='622' column='1'/>
      <parameter type-id='type-id-7' name='itemsize' filepath='../gpshead/Objects/abstract.c' line='622' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='../gpshead/Objects/abstract.c' line='623' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='../gpshead/Objects/abstract.c' line='550' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-52' name='dest' filepath='../gpshead/Objects/abstract.c' line='550' column='1'/>
      <parameter type-id='type-id-52' name='src' filepath='../gpshead/Objects/abstract.c' line='550' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='../gpshead/Objects/abstract.c' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-174' name='view' filepath='../gpshead/Objects/abstract.c' line='499' column='1'/>
      <parameter type-id='type-id-56' name='buf' filepath='../gpshead/Objects/abstract.c' line='499' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/abstract.c' line='499' column='1'/>
      <parameter type-id='type-id-1' name='fort' filepath='../gpshead/Objects/abstract.c' line='499' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-236'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-237'/>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='../gpshead/Objects/abstract.c' line='483' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-7' name='nd' filepath='../gpshead/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-172' name='index' filepath='../gpshead/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-237' name='shape' filepath='../gpshead/Objects/abstract.c' line='483' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='../gpshead/Objects/abstract.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-7' name='nd' filepath='../gpshead/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-172' name='index' filepath='../gpshead/Objects/abstract.c' line='483' column='1'/>
      <parameter type-id='type-id-237' name='shape' filepath='../gpshead/Objects/abstract.c' line='483' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='../gpshead/Objects/abstract.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-174' name='view' filepath='../gpshead/Objects/abstract.c' line='451' column='1'/>
      <parameter type-id='type-id-172' name='indices' filepath='../gpshead/Objects/abstract.c' line='451' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-238'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='../gpshead/Objects/abstract.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-239' name='view' filepath='../gpshead/Objects/abstract.c' line='435' column='1'/>
      <parameter type-id='type-id-1' name='order' filepath='../gpshead/Objects/abstract.c' line='435' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='../gpshead/Objects/abstract.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='354' column='1'/>
      <parameter type-id='type-id-174' name='view' filepath='../gpshead/Objects/abstract.c' line='354' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='../gpshead/Objects/abstract.c' line='354' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-240'/>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='../gpshead/Objects/abstract.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='325' column='1'/>
      <parameter type-id='type-id-240' name='buffer' filepath='../gpshead/Objects/abstract.c' line='326' column='1'/>
      <parameter type-id='type-id-172' name='buffer_len' filepath='../gpshead/Objects/abstract.c' line='327' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='../gpshead/Objects/abstract.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='318' column='1'/>
      <parameter type-id='type-id-240' name='buffer' filepath='../gpshead/Objects/abstract.c' line='319' column='1'/>
      <parameter type-id='type-id-172' name='buffer_len' filepath='../gpshead/Objects/abstract.c' line='320' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-241'/>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='../gpshead/Objects/abstract.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='311' column='1'/>
      <parameter type-id='type-id-241' name='buffer' filepath='../gpshead/Objects/abstract.c' line='312' column='1'/>
      <parameter type-id='type-id-172' name='buffer_len' filepath='../gpshead/Objects/abstract.c' line='313' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='../gpshead/Objects/abstract.c' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/abstract.c' line='276' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='../gpshead/Objects/abstract.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='255' column='1'/>
      <parameter type-id='type-id-3' name='key' filepath='../gpshead/Objects/abstract.c' line='255' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='../gpshead/Objects/abstract.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2150' column='1'/>
      <parameter type-id='type-id-52' name='key' filepath='../gpshead/Objects/abstract.c' line='2150' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='../gpshead/Objects/abstract.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='191' column='1'/>
      <parameter type-id='type-id-52' name='key' filepath='../gpshead/Objects/abstract.c' line='191' column='1'/>
      <parameter type-id='type-id-52' name='value' filepath='../gpshead/Objects/abstract.c' line='191' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='../gpshead/Objects/abstract.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='143' column='1'/>
      <parameter type-id='type-id-52' name='key' filepath='../gpshead/Objects/abstract.c' line='143' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='../gpshead/Objects/abstract.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='86' column='1'/>
      <parameter type-id='type-id-34' name='defaultvalue' filepath='../gpshead/Objects/abstract.c' line='86' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='../gpshead/Objects/abstract.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2064' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='../gpshead/Objects/abstract.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2093' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='../gpshead/Objects/abstract.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2071' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='../gpshead/Objects/abstract.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-52' name='iter' filepath='../gpshead/Objects/abstract.c' line='2552' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/accu.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-242' visibility='default' filepath='../gpshead/Include/accu.h' line='21' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/accu.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/accu.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyAccu' type-id='type-id-243' filepath='../gpshead/Include/accu.h' line='24' column='1' id='type-id-242'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-244'/>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='../gpshead/Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-244' name='acc' filepath='../gpshead/Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='../gpshead/Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-244' name='acc' filepath='../gpshead/Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='../gpshead/Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-244' name='acc' filepath='../gpshead/Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='../gpshead/Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-244' name='acc' filepath='../gpshead/Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-52' name='unicode' filepath='../gpshead/Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='../gpshead/Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-244' name='acc' filepath='../gpshead/Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/boolobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <typedef-decl name='PyTypeObject' type-id='type-id-71' filepath='../gpshead/Include/object.h' line='435' column='1' id='type-id-245'/>
    <var-decl name='PyBool_Type' type-id='type-id-245' mangled-name='PyBool_Type' visibility='default' filepath='../gpshead/Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='../gpshead/Include/longintrepr.h' line='85' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-72' visibility='default' filepath='../gpshead/Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-247' visibility='default' filepath='../gpshead/Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-101' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-248'/>
    <typedef-decl name='uint32_t' type-id='type-id-248' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-249'/>
    <typedef-decl name='digit' type-id='type-id-249' filepath='../gpshead/Include/longintrepr.h' line='45' column='1' id='type-id-250'/>

    <array-type-def dimensions='1' type-id='type-id-250' size-in-bits='32' id='type-id-247'>
      <subrange length='1' type-id='type-id-38' id='type-id-118'/>

    </array-type-def>
    <var-decl name='_Py_FalseStruct' type-id='type-id-246' mangled-name='_Py_FalseStruct' visibility='default' filepath='../gpshead/Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-246' mangled-name='_Py_TrueStruct' visibility='default' filepath='../gpshead/Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='../gpshead/Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-31' name='ok' filepath='../gpshead/Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/bytes_methods.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='infinite' id='type-id-251'>
      <subrange length='infinite' id='type-id-226'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-252'/>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-252' mangled-name='_Py_isspace__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='38' column='1' elf-symbol-id='_Py_isspace__doc__'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-252' mangled-name='_Py_isalpha__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='39' column='1' elf-symbol-id='_Py_isalpha__doc__'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-252' mangled-name='_Py_isalnum__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='40' column='1' elf-symbol-id='_Py_isalnum__doc__'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-252' mangled-name='_Py_isascii__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='41' column='1' elf-symbol-id='_Py_isascii__doc__'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-252' mangled-name='_Py_isdigit__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='42' column='1' elf-symbol-id='_Py_isdigit__doc__'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-252' mangled-name='_Py_islower__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='43' column='1' elf-symbol-id='_Py_islower__doc__'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-252' mangled-name='_Py_isupper__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='44' column='1' elf-symbol-id='_Py_isupper__doc__'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-252' mangled-name='_Py_istitle__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='45' column='1' elf-symbol-id='_Py_istitle__doc__'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-252' mangled-name='_Py_lower__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='46' column='1' elf-symbol-id='_Py_lower__doc__'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-252' mangled-name='_Py_upper__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='47' column='1' elf-symbol-id='_Py_upper__doc__'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-252' mangled-name='_Py_title__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='48' column='1' elf-symbol-id='_Py_title__doc__'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-252' mangled-name='_Py_capitalize__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='49' column='1' elf-symbol-id='_Py_capitalize__doc__'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-252' mangled-name='_Py_swapcase__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='50' column='1' elf-symbol-id='_Py_swapcase__doc__'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-252' mangled-name='_Py_maketrans__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='58' column='1' elf-symbol-id='_Py_maketrans__doc__'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-252' mangled-name='_Py_find__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='52' column='1' elf-symbol-id='_Py_find__doc__'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-252' mangled-name='_Py_index__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='53' column='1' elf-symbol-id='_Py_index__doc__'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-252' mangled-name='_Py_rfind__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='54' column='1' elf-symbol-id='_Py_rfind__doc__'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-252' mangled-name='_Py_rindex__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='55' column='1' elf-symbol-id='_Py_rindex__doc__'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-252' mangled-name='_Py_count__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='51' column='1' elf-symbol-id='_Py_count__doc__'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-252' mangled-name='_Py_startswith__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='56' column='1' elf-symbol-id='_Py_startswith__doc__'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-252' mangled-name='_Py_endswith__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='57' column='1' elf-symbol-id='_Py_endswith__doc__'/>
    <var-decl name='_Py_expandtabs__doc__' type-id='type-id-252' mangled-name='_Py_expandtabs__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='59' column='1' elf-symbol-id='_Py_expandtabs__doc__'/>
    <var-decl name='_Py_ljust__doc__' type-id='type-id-252' mangled-name='_Py_ljust__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='60' column='1' elf-symbol-id='_Py_ljust__doc__'/>
    <var-decl name='_Py_rjust__doc__' type-id='type-id-252' mangled-name='_Py_rjust__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='61' column='1' elf-symbol-id='_Py_rjust__doc__'/>
    <var-decl name='_Py_center__doc__' type-id='type-id-252' mangled-name='_Py_center__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='62' column='1' elf-symbol-id='_Py_center__doc__'/>
    <var-decl name='_Py_zfill__doc__' type-id='type-id-252' mangled-name='_Py_zfill__doc__' visibility='default' filepath='../gpshead/Include/bytes_methods.h' line='63' column='1' elf-symbol-id='_Py_zfill__doc__'/>
    <function-decl name='_Py_bytes_endswith' mangled-name='_Py_bytes_endswith' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_endswith'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_startswith' mangled-name='_Py_bytes_startswith' filepath='../gpshead/Objects/bytes_methods.c' line='830' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_startswith'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='844' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_contains' mangled-name='_Py_bytes_contains' filepath='../gpshead/Objects/bytes_methods.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_contains'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='710' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='710' column='1'/>
      <parameter type-id='type-id-52' name='arg' filepath='../gpshead/Objects/bytes_methods.c' line='710' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_Py_bytes_count' mangled-name='_Py_bytes_count' filepath='../gpshead/Objects/bytes_methods.c' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_count'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='670' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='670' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='670' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_rindex' mangled-name='_Py_bytes_rindex' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_rindex'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_rfind' mangled-name='_Py_bytes_rfind' filepath='../gpshead/Objects/bytes_methods.c' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_rfind'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_index' mangled-name='_Py_bytes_index' filepath='../gpshead/Objects/bytes_methods.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_index'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_find' mangled-name='_Py_bytes_find' filepath='../gpshead/Objects/bytes_methods.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_find'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytes_methods.c' line='649' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_maketrans' mangled-name='_Py_bytes_maketrans' filepath='../gpshead/Objects/bytes_methods.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_maketrans'>
      <parameter type-id='type-id-174' name='frm' filepath='../gpshead/Objects/bytes_methods.c' line='420' column='1'/>
      <parameter type-id='type-id-174' name='to' filepath='../gpshead/Objects/bytes_methods.c' line='420' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_swapcase' mangled-name='_Py_bytes_swapcase' filepath='../gpshead/Objects/bytes_methods.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_swapcase'>
      <parameter type-id='type-id-12' name='result' filepath='../gpshead/Objects/bytes_methods.c' line='392' column='1'/>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Objects/bytes_methods.c' line='392' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='392' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' mangled-name='_Py_bytes_capitalize' filepath='../gpshead/Objects/bytes_methods.c' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_capitalize'>
      <parameter type-id='type-id-12' name='result' filepath='../gpshead/Objects/bytes_methods.c' line='362' column='1'/>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Objects/bytes_methods.c' line='362' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='362' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' mangled-name='_Py_bytes_title' filepath='../gpshead/Objects/bytes_methods.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_title'>
      <parameter type-id='type-id-12' name='result' filepath='../gpshead/Objects/bytes_methods.c' line='333' column='1'/>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Objects/bytes_methods.c' line='333' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='333' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' mangled-name='_Py_bytes_upper' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_upper'>
      <parameter type-id='type-id-12' name='result' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' mangled-name='_Py_bytes_lower' filepath='../gpshead/Objects/bytes_methods.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_lower'>
      <parameter type-id='type-id-12' name='result' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='316' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' mangled-name='_Py_bytes_istitle' filepath='../gpshead/Objects/bytes_methods.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_istitle'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='254' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='254' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' mangled-name='_Py_bytes_isupper' filepath='../gpshead/Objects/bytes_methods.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isupper'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='218' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='218' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' mangled-name='_Py_bytes_islower' filepath='../gpshead/Objects/bytes_methods.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_islower'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='218' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='218' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' mangled-name='_Py_bytes_isdigit' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isdigit'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_isascii' mangled-name='_Py_bytes_isascii' filepath='../gpshead/Objects/bytes_methods.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isascii'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='113' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='113' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' mangled-name='_Py_bytes_isalnum' filepath='../gpshead/Objects/bytes_methods.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalnum'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' mangled-name='_Py_bytes_isalpha' filepath='../gpshead/Objects/bytes_methods.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isalpha'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' mangled-name='_Py_bytes_isspace' filepath='../gpshead/Objects/bytes_methods.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_bytes_isspace'>
      <parameter type-id='type-id-3' name='cptr' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytes_methods.c' line='154' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/bytearrayobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-253'>
      <subrange length='infinite' id='type-id-226'/>

    </array-type-def>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-253' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='../gpshead/Include/bytearrayobject.h' line='56' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-245' mangled-name='PyByteArray_Type' visibility='default' filepath='../gpshead/Include/bytearrayobject.h' line='34' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-245' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='../gpshead/Include/bytearrayobject.h' line='35' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='../gpshead/Objects/bytearrayobject.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-52' name='a' filepath='../gpshead/Objects/bytearrayobject.c' line='268' column='1'/>
      <parameter type-id='type-id-52' name='b' filepath='../gpshead/Objects/bytearrayobject.c' line='268' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='../gpshead/Objects/bytearrayobject.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/bytearrayobject.c' line='189' column='1'/>
      <parameter type-id='type-id-34' name='requested_size' filepath='../gpshead/Objects/bytearrayobject.c' line='189' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyByteArray_AsString' mangled-name='PyByteArray_AsString' filepath='../gpshead/Objects/bytearrayobject.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_AsString'>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/bytearrayobject.c' line='180' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='../gpshead/Objects/bytearrayobject.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2093' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyByteArray_FromStringAndSize' mangled-name='PyByteArray_FromStringAndSize' filepath='../gpshead/Objects/bytearrayobject.c' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromStringAndSize'>
      <parameter type-id='type-id-3' name='bytes' filepath='../gpshead/Objects/bytearrayobject.c' line='127' column='1'/>
      <parameter type-id='type-id-34' name='size' filepath='../gpshead/Objects/bytearrayobject.c' line='127' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='../gpshead/Objects/bytearrayobject.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-52' name='input' filepath='../gpshead/Objects/bytearrayobject.c' line='100' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyByteArray_Init' mangled-name='PyByteArray_Init' filepath='../gpshead/Objects/bytearrayobject.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Init'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyByteArray_Fini' mangled-name='PyByteArray_Fini' filepath='../gpshead/Objects/bytearrayobject.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Fini'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/bytesobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <var-decl name='PyBytes_Type' type-id='type-id-245' mangled-name='PyBytes_Type' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='44' column='1' elf-symbol-id='PyBytes_Type'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-245' mangled-name='PyBytesIter_Type' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='45' column='1' elf-symbol-id='PyBytesIter_Type'/>
    <class-decl name='__anonymous_struct__' size-in-bits='4416' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-254' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='144' column='1' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='min_size' type-id='type-id-34' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_bytearray' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='overallocate' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='use_small_buffer' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='small_buffer' type-id='type-id-256' visibility='default' filepath='../gpshead/Include/bytesobject.h' line='164' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='4096' id='type-id-256'>
      <subrange length='512' type-id='type-id-38' id='type-id-257'/>

    </array-type-def>
    <typedef-decl name='_PyBytesWriter' type-id='type-id-255' filepath='../gpshead/Include/bytesobject.h' line='165' column='1' id='type-id-254'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' id='type-id-258'/>
    <function-decl name='_PyBytesWriter_WriteBytes' mangled-name='_PyBytesWriter_WriteBytes' filepath='../gpshead/Objects/bytesobject.c' line='3465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_WriteBytes'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3465' column='1'/>
      <parameter type-id='type-id-56' name='ptr' filepath='../gpshead/Objects/bytesobject.c' line='3465' column='1'/>
      <parameter type-id='type-id-56' name='bytes' filepath='../gpshead/Objects/bytesobject.c' line='3466' column='1'/>
      <parameter type-id='type-id-34' name='size' filepath='../gpshead/Objects/bytesobject.c' line='3466' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Finish' mangled-name='_PyBytesWriter_Finish' filepath='../gpshead/Objects/bytesobject.c' line='3421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Finish'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3421' column='1'/>
      <parameter type-id='type-id-56' name='str' filepath='../gpshead/Objects/bytesobject.c' line='3421' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Alloc' mangled-name='_PyBytesWriter_Alloc' filepath='../gpshead/Objects/bytesobject.c' line='3391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Alloc'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3391' column='1'/>
      <parameter type-id='type-id-34' name='size' filepath='../gpshead/Objects/bytesobject.c' line='3391' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Prepare' mangled-name='_PyBytesWriter_Prepare' filepath='../gpshead/Objects/bytesobject.c' line='3361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Prepare'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3361' column='1'/>
      <parameter type-id='type-id-56' name='str' filepath='../gpshead/Objects/bytesobject.c' line='3361' column='1'/>
      <parameter type-id='type-id-34' name='size' filepath='../gpshead/Objects/bytesobject.c' line='3361' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Resize' mangled-name='_PyBytesWriter_Resize' filepath='../gpshead/Objects/bytesobject.c' line='3292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Resize'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3292' column='1'/>
      <parameter type-id='type-id-56' name='str' filepath='../gpshead/Objects/bytesobject.c' line='3292' column='1'/>
      <parameter type-id='type-id-34' name='size' filepath='../gpshead/Objects/bytesobject.c' line='3292' column='1'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Dealloc' mangled-name='_PyBytesWriter_Dealloc' filepath='../gpshead/Objects/bytesobject.c' line='3223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Dealloc'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3223' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='_PyBytesWriter_Init' mangled-name='_PyBytesWriter_Init' filepath='../gpshead/Objects/bytesobject.c' line='3213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytesWriter_Init'>
      <parameter type-id='type-id-258' name='writer' filepath='../gpshead/Objects/bytesobject.c' line='3213' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_Fini' mangled-name='PyBytes_Fini' filepath='../gpshead/Objects/bytesobject.c' line='3040' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Fini'>
      <return type-id='type-id-4'/>
    </function-decl>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-259'/>
    <function-decl name='_PyBytes_Resize' mangled-name='_PyBytes_Resize' filepath='../gpshead/Objects/bytesobject.c' line='2988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Resize'>
      <parameter type-id='type-id-259' name='pv' filepath='../gpshead/Objects/bytesobject.c' line='2988' column='1'/>
      <parameter type-id='type-id-34' name='newsize' filepath='../gpshead/Objects/bytesobject.c' line='2988' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBytes_ConcatAndDel' mangled-name='PyBytes_ConcatAndDel' filepath='../gpshead/Objects/bytesobject.c' line='2966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_ConcatAndDel'>
      <parameter type-id='type-id-259' name='pv' filepath='../gpshead/Objects/bytesobject.c' line='2966' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/bytesobject.c' line='2966' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_Concat' mangled-name='PyBytes_Concat' filepath='../gpshead/Objects/bytesobject.c' line='2916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Concat'>
      <parameter type-id='type-id-259' name='pv' filepath='../gpshead/Objects/bytesobject.c' line='2916' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/bytesobject.c' line='2916' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyBytes_FromObject' mangled-name='PyBytes_FromObject' filepath='../gpshead/Objects/bytesobject.c' line='2792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromObject'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2519' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='../gpshead/Objects/bytesobject.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FromHex'>
      <parameter type-id='type-id-52' name='string' filepath='../gpshead/Objects/bytesobject.c' line='2349' column='1'/>
      <parameter type-id='type-id-7' name='use_bytearray' filepath='../gpshead/Objects/bytesobject.c' line='2349' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyBytes_Join' mangled-name='_PyBytes_Join' filepath='../gpshead/Objects/bytesobject.c' line='1905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_Join'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyBytes_Repr' mangled-name='PyBytes_Repr' filepath='../gpshead/Objects/bytesobject.c' line='1342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Repr'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/bytesobject.c' line='1342' column='1'/>
      <parameter type-id='type-id-7' name='smartquotes' filepath='../gpshead/Objects/bytesobject.c' line='1342' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='../gpshead/Objects/bytesobject.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/bytesobject.c' line='1300' column='1'/>
      <parameter type-id='type-id-233' name='s' filepath='../gpshead/Objects/bytesobject.c' line='1301' column='1'/>
      <parameter type-id='type-id-172' name='len' filepath='../gpshead/Objects/bytesobject.c' line='1302' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyBytes_AsString' mangled-name='PyBytes_AsString' filepath='../gpshead/Objects/bytesobject.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsString'>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/bytearrayobject.c' line='180' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyBytes_Size' mangled-name='PyBytes_Size' filepath='../gpshead/Objects/bytesobject.c' line='1278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_Size'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2093' column='1'/>
      <return type-id='type-id-34'/>
    </function-decl>
    <function-decl name='PyBytes_DecodeEscape' mangled-name='PyBytes_DecodeEscape' filepath='../gpshead/Objects/bytesobject.c' line='1251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_DecodeEscape'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Objects/bytesobject.c' line='1251' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytesobject.c' line='1252' column='1'/>
      <parameter type-id='type-id-3' name='errors' filepath='../gpshead/Objects/bytesobject.c' line='1253' column='1'/>
      <parameter type-id='type-id-34' name='unicode' filepath='../gpshead/Objects/bytesobject.c' line='1254' column='1'/>
      <parameter type-id='type-id-3' name='recode_encoding' filepath='../gpshead/Objects/bytesobject.c' line='1255' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyBytes_DecodeEscape' mangled-name='_PyBytes_DecodeEscape' filepath='../gpshead/Objects/bytesobject.c' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_DecodeEscape'>
      <parameter type-id='type-id-3' name='s' filepath='../gpshead/Objects/bytesobject.c' line='1128' column='1'/>
      <parameter type-id='type-id-34' name='len' filepath='../gpshead/Objects/bytesobject.c' line='1129' column='1'/>
      <parameter type-id='type-id-3' name='errors' filepath='../gpshead/Objects/bytesobject.c' line='1130' column='1'/>
      <parameter type-id='type-id-34' name='unicode' filepath='../gpshead/Objects/bytesobject.c' line='1131' column='1'/>
      <parameter type-id='type-id-3' name='recode_encoding' filepath='../gpshead/Objects/bytesobject.c' line='1132' column='1'/>
      <parameter type-id='type-id-241' name='first_invalid_escape' filepath='../gpshead/Objects/bytesobject.c' line='1133' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='../gpshead/Objects/bytesobject.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FormatEx'>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/bytesobject.c' line='597' column='1'/>
      <parameter type-id='type-id-34' name='format_len' filepath='../gpshead/Objects/bytesobject.c' line='597' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/bytesobject.c' line='598' column='1'/>
      <parameter type-id='type-id-7' name='use_bytearray' filepath='../gpshead/Objects/bytesobject.c' line='598' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyBytes_FromFormat' mangled-name='PyBytes_FromFormat' filepath='../gpshead/Objects/bytesobject.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormat'>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/bytesobject.c' line='370' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-56' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-261'/>
    <function-decl name='PyBytes_FromFormatV' mangled-name='PyBytes_FromFormatV' filepath='../gpshead/Objects/bytesobject.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromFormatV'>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/bytesobject.c' line='181' column='1'/>
      <parameter type-id='type-id-261' name='vargs' filepath='../gpshead/Objects/bytesobject.c' line='181' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyBytes_FromString' mangled-name='PyBytes_FromString' filepath='../gpshead/Objects/bytesobject.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromString'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytesobject.c' line='135' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyBytes_FromStringAndSize' mangled-name='PyBytes_FromStringAndSize' filepath='../gpshead/Objects/bytesobject.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_FromStringAndSize'>
      <parameter type-id='type-id-3' name='str' filepath='../gpshead/Objects/bytesobject.c' line='101' column='1'/>
      <parameter type-id='type-id-34' name='size' filepath='../gpshead/Objects/bytesobject.c' line='101' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/call.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <qualified-type-def type-id='type-id-52' const='yes' id='type-id-262'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-264'/>
    <function-decl name='_PyStack_UnpackDict' mangled-name='_PyStack_UnpackDict' filepath='../gpshead/Objects/call.c' line='1349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_UnpackDict'>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='1349' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='1349' column='1'/>
      <parameter type-id='type-id-52' name='kwargs' filepath='../gpshead/Objects/call.c' line='1349' column='1'/>
      <parameter type-id='type-id-264' name='p_stack' filepath='../gpshead/Objects/call.c' line='1350' column='1'/>
      <parameter type-id='type-id-259' name='p_kwnames' filepath='../gpshead/Objects/call.c' line='1350' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyStack_AsDict' mangled-name='_PyStack_AsDict' filepath='../gpshead/Objects/call.c' line='1322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsDict'>
      <parameter type-id='type-id-263' name='values' filepath='../gpshead/Objects/call.c' line='1322' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='1322' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyStack_AsTupleSlice' mangled-name='_PyStack_AsTupleSlice' filepath='../gpshead/Objects/call.c' line='1297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsTupleSlice'>
      <parameter type-id='type-id-263' name='stack' filepath='../gpshead/Objects/call.c' line='1297' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='1297' column='1'/>
      <parameter type-id='type-id-34' name='start' filepath='../gpshead/Objects/call.c' line='1298' column='1'/>
      <parameter type-id='type-id-34' name='end' filepath='../gpshead/Objects/call.c' line='1298' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyStack_AsTuple' mangled-name='_PyStack_AsTuple' filepath='../gpshead/Objects/call.c' line='1277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyStack_AsTuple'>
      <parameter type-id='type-id-263' name='stack' filepath='../gpshead/Objects/call.c' line='1277' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='1277' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='../gpshead/Objects/call.c' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='1259' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <class-decl name='_Py_Identifier' size-in-bits='192' is-struct='yes' visibility='default' filepath='../gpshead/Include/object.h' line='142' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-266' visibility='default' filepath='../gpshead/Include/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-3' visibility='default' filepath='../gpshead/Include/object.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/object.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-266'/>
    <function-decl name='_PyObject_CallMethodIdObjArgs' mangled-name='_PyObject_CallMethodIdObjArgs' filepath='../gpshead/Objects/call.c' line='1234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodIdObjArgs'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='1234' column='1'/>
      <parameter type-id='type-id-266' name='name' filepath='../gpshead/Objects/call.c' line='1235' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_CallMethodObjArgs' mangled-name='PyObject_CallMethodObjArgs' filepath='../gpshead/Objects/call.c' line='1210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethodObjArgs'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='1210' column='1'/>
      <parameter type-id='type-id-52' name='name' filepath='../gpshead/Objects/call.c' line='1210' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <typedef-decl name='_Py_Identifier' type-id='type-id-265' filepath='../gpshead/Include/object.h' line='146' column='1' id='type-id-267'/>
    <function-decl name='_PyObject_CallMethodId_SizeT' mangled-name='_PyObject_CallMethodId_SizeT' filepath='../gpshead/Objects/call.c' line='1131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId_SizeT'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='1131' column='1'/>
      <parameter type-id='type-id-266' name='name' filepath='../gpshead/Objects/call.c' line='1131' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1132' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethod_SizeT' mangled-name='_PyObject_CallMethod_SizeT' filepath='../gpshead/Objects/call.c' line='1107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethod_SizeT'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='1107' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='../gpshead/Objects/call.c' line='1107' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1108' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_CallMethodId' mangled-name='_PyObject_CallMethodId' filepath='../gpshead/Objects/call.c' line='1083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallMethodId'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='1131' column='1'/>
      <parameter type-id='type-id-266' name='name' filepath='../gpshead/Objects/call.c' line='1131' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1132' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyEval_CallMethod' mangled-name='PyEval_CallMethod' filepath='../gpshead/Objects/call.c' line='1060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallMethod'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='1107' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='../gpshead/Objects/call.c' line='1107' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1108' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_CallMethod' mangled-name='PyObject_CallMethod' filepath='../gpshead/Objects/call.c' line='1034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallMethod'>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='1107' column='1'/>
      <parameter type-id='type-id-3' name='name' filepath='../gpshead/Objects/call.c' line='1107' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1108' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_CallFunction_SizeT' mangled-name='_PyObject_CallFunction_SizeT' filepath='../gpshead/Objects/call.c' line='1004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_CallFunction_SizeT'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='1004' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1004' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyEval_CallFunction' mangled-name='PyEval_CallFunction' filepath='../gpshead/Objects/call.c' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallFunction'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='1004' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1004' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_CallFunction' mangled-name='PyObject_CallFunction' filepath='../gpshead/Objects/call.c' line='973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunction'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='1004' column='1'/>
      <parameter type-id='type-id-3' name='format' filepath='../gpshead/Objects/call.c' line='1004' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_Call_Prepend' mangled-name='_PyObject_Call_Prepend' filepath='../gpshead/Objects/call.c' line='878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_Call_Prepend'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='878' column='1'/>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='879' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/call.c' line='879' column='1'/>
      <parameter type-id='type-id-52' name='kwargs' filepath='../gpshead/Objects/call.c' line='879' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_FastCall_Prepend' mangled-name='_PyObject_FastCall_Prepend' filepath='../gpshead/Objects/call.c' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCall_Prepend'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='843' column='1'/>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/call.c' line='843' column='1'/>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='844' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='844' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_CallObject' mangled-name='PyObject_CallObject' filepath='../gpshead/Objects/call.c' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallObject'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1165' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyEval_CallObjectWithKeywords' mangled-name='PyEval_CallObjectWithKeywords' filepath='../gpshead/Objects/call.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyEval_CallObjectWithKeywords'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='z' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyCFunction_Call' mangled-name='PyCFunction_Call' filepath='../gpshead/Objects/call.c' line='780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCFunction_Call'>
      <parameter type-id='type-id-52' name='v' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='w' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <parameter type-id='type-id-52' name='z' filepath='../gpshead/Objects/abstract.c' line='1172' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyCFunction_FastCallKeywords' mangled-name='_PyCFunction_FastCallKeywords' filepath='../gpshead/Objects/call.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCFunction_FastCallKeywords'>
      <parameter type-id='type-id-52' name='func' filepath='../gpshead/Objects/call.c' line='723' column='1'/>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='724' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='724' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='725' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <typedef-decl name='PyMethodDef' type-id='type-id-186' filepath='../gpshead/Include/methodobject.h' line='63' column='1' id='type-id-268'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-269'/>
    <function-decl name='_PyMethodDef_RawFastCallKeywords' mangled-name='_PyMethodDef_RawFastCallKeywords' filepath='../gpshead/Objects/call.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMethodDef_RawFastCallKeywords'>
      <parameter type-id='type-id-269' name='method' filepath='../gpshead/Objects/call.c' line='594' column='1'/>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/call.c' line='594' column='1'/>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='595' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='595' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='596' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyCFunction_FastCallDict' mangled-name='_PyCFunction_FastCallDict' filepath='../gpshead/Objects/call.c' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCFunction_FastCallDict'>
      <parameter type-id='type-id-52' name='func' filepath='../gpshead/Objects/call.c' line='723' column='1'/>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='724' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='724' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='725' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyMethodDef_RawFastCallDict' mangled-name='_PyMethodDef_RawFastCallDict' filepath='../gpshead/Objects/call.c' line='446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMethodDef_RawFastCallDict'>
      <parameter type-id='type-id-269' name='method' filepath='../gpshead/Objects/call.c' line='446' column='1'/>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/call.c' line='446' column='1'/>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='447' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='447' column='1'/>
      <parameter type-id='type-id-52' name='kwargs' filepath='../gpshead/Objects/call.c' line='448' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyFunction_FastCallKeywords' mangled-name='_PyFunction_FastCallKeywords' filepath='../gpshead/Objects/call.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFunction_FastCallKeywords'>
      <parameter type-id='type-id-52' name='func' filepath='../gpshead/Objects/call.c' line='386' column='1'/>
      <parameter type-id='type-id-263' name='stack' filepath='../gpshead/Objects/call.c' line='386' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='387' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='387' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyFunction_FastCallDict' mangled-name='_PyFunction_FastCallDict' filepath='../gpshead/Objects/call.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFunction_FastCallDict'>
      <parameter type-id='type-id-52' name='func' filepath='../gpshead/Objects/call.c' line='299' column='1'/>
      <parameter type-id='type-id-263' name='args' filepath='../gpshead/Objects/call.c' line='299' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='299' column='1'/>
      <parameter type-id='type-id-52' name='kwargs' filepath='../gpshead/Objects/call.c' line='300' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyObject_Call' mangled-name='PyObject_Call' filepath='../gpshead/Objects/call.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Call'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='213' column='1'/>
      <parameter type-id='type-id-52' name='args' filepath='../gpshead/Objects/call.c' line='213' column='1'/>
      <parameter type-id='type-id-52' name='kwargs' filepath='../gpshead/Objects/call.c' line='213' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_FastCallKeywords' mangled-name='_PyObject_FastCallKeywords' filepath='../gpshead/Objects/call.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCallKeywords'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='137' column='1'/>
      <parameter type-id='type-id-263' name='stack' filepath='../gpshead/Objects/call.c' line='137' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='137' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='138' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_FastCallDict' mangled-name='_PyObject_FastCallDict' filepath='../gpshead/Objects/call.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_FastCallDict'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='137' column='1'/>
      <parameter type-id='type-id-263' name='stack' filepath='../gpshead/Objects/call.c' line='137' column='1'/>
      <parameter type-id='type-id-34' name='nargs' filepath='../gpshead/Objects/call.c' line='137' column='1'/>
      <parameter type-id='type-id-52' name='kwnames' filepath='../gpshead/Objects/call.c' line='138' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_CheckFunctionResult' mangled-name='_Py_CheckFunctionResult' filepath='../gpshead/Objects/call.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckFunctionResult'>
      <parameter type-id='type-id-52' name='callable' filepath='../gpshead/Objects/call.c' line='33' column='1'/>
      <parameter type-id='type-id-52' name='result' filepath='../gpshead/Objects/call.c' line='33' column='1'/>
      <parameter type-id='type-id-3' name='where' filepath='../gpshead/Objects/call.c' line='33' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyObject_HasFastCall' mangled-name='_PyObject_HasFastCall' filepath='../gpshead/Objects/call.c' line='7' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasFastCall'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='2064' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/cellobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <var-decl name='PyCell_Type' type-id='type-id-245' mangled-name='PyCell_Type' visibility='default' filepath='../gpshead/Include/cellobject.h' line='14' column='1' elf-symbol-id='PyCell_Type'/>
    <function-decl name='PyCell_Set' mangled-name='PyCell_Set' filepath='../gpshead/Objects/cellobject.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_Set'>
      <parameter type-id='type-id-52' name='op' filepath='../gpshead/Objects/cellobject.c' line='34' column='1'/>
      <parameter type-id='type-id-52' name='obj' filepath='../gpshead/Objects/cellobject.c' line='34' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCell_Get' mangled-name='PyCell_Get' filepath='../gpshead/Objects/cellobject.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_Get'>
      <parameter type-id='type-id-52' name='op' filepath='../gpshead/Objects/cellobject.c' line='23' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyCell_New' mangled-name='PyCell_New' filepath='../gpshead/Objects/cellobject.c' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCell_New'>
      <parameter type-id='type-id-52' name='item' filepath='../gpshead/Objects/abstract.c' line='1255' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/classobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <var-decl name='PyMethod_Type' type-id='type-id-245' mangled-name='PyMethod_Type' visibility='default' filepath='../gpshead/Include/classobject.h' line='19' column='1' elf-symbol-id='PyMethod_Type'/>
    <var-decl name='PyInstanceMethod_Type' type-id='type-id-245' mangled-name='PyInstanceMethod_Type' visibility='default' filepath='../gpshead/Include/classobject.h' line='42' column='1' elf-symbol-id='PyInstanceMethod_Type'/>
    <function-decl name='PyInstanceMethod_Function' mangled-name='PyInstanceMethod_Function' filepath='../gpshead/Objects/classobject.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInstanceMethod_Function'>
      <parameter type-id='type-id-52' name='input' filepath='../gpshead/Objects/bytearrayobject.c' line='100' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyInstanceMethod_New' mangled-name='PyInstanceMethod_New' filepath='../gpshead/Objects/classobject.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInstanceMethod_New'>
      <parameter type-id='type-id-52' name='o' filepath='../gpshead/Objects/abstract.c' line='1434' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_PyMethod_DebugMallocStats' mangled-name='_PyMethod_DebugMallocStats' filepath='../gpshead/Objects/classobject.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMethod_DebugMallocStats'>
      <parameter type-id='type-id-124' name='out' filepath='../gpshead/Objects/classobject.c' line='392' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMethod_Fini' mangled-name='PyMethod_Fini' filepath='../gpshead/Objects/classobject.c' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Fini'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='PyMethod_ClearFreeList' mangled-name='PyMethod_ClearFreeList' filepath='../gpshead/Objects/classobject.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_ClearFreeList'>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyMethod_New' mangled-name='PyMethod_New' filepath='../gpshead/Objects/classobject.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_New'>
      <parameter type-id='type-id-52' name='func' filepath='../gpshead/Objects/classobject.c' line='48' column='1'/>
      <parameter type-id='type-id-52' name='self' filepath='../gpshead/Objects/classobject.c' line='48' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyMethod_Self' mangled-name='PyMethod_Self' filepath='../gpshead/Objects/classobject.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Self'>
      <parameter type-id='type-id-52' name='input' filepath='../gpshead/Objects/bytearrayobject.c' line='100' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyMethod_Function' mangled-name='PyMethod_Function' filepath='../gpshead/Objects/classobject.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMethod_Function'>
      <parameter type-id='type-id-52' name='input' filepath='../gpshead/Objects/bytearrayobject.c' line='100' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/codeobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <var-decl name='PyCode_Type' type-id='type-id-245' mangled-name='PyCode_Type' visibility='default' filepath='../gpshead/Include/code.h' line='98' column='1' elf-symbol-id='PyCode_Type'/>
    <function-decl name='_PyCode_SetExtra' mangled-name='_PyCode_SetExtra' filepath='../gpshead/Objects/codeobject.c' line='865' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_SetExtra'>
      <parameter type-id='type-id-52' name='code' filepath='../gpshead/Objects/codeobject.c' line='865' column='1'/>
      <parameter type-id='type-id-34' name='index' filepath='../gpshead/Objects/codeobject.c' line='865' column='1'/>
      <parameter type-id='type-id-56' name='extra' filepath='../gpshead/Objects/codeobject.c' line='865' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyCode_GetExtra' mangled-name='_PyCode_GetExtra' filepath='../gpshead/Objects/codeobject.c' line='844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_GetExtra'>
      <parameter type-id='type-id-52' name='code' filepath='../gpshead/Objects/codeobject.c' line='844' column='1'/>
      <parameter type-id='type-id-34' name='index' filepath='../gpshead/Objects/codeobject.c' line='844' column='1'/>
      <parameter type-id='type-id-240' name='extra' filepath='../gpshead/Objects/codeobject.c' line='844' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1152' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-270' visibility='default' filepath='../gpshead/Include/code.h' line='21' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-103' visibility='default' filepath='../gpshead/Include/code.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='co_argcount' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='co_kwonlyargcount' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='co_nlocals' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='co_stacksize' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='co_flags' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='co_firstlineno' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='co_code' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='co_consts' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='co_names' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='co_varnames' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='co_freevars' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='co_cellvars' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='co_cell2arg' type-id='type-id-172' visibility='default' filepath='../gpshead/Include/code.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='co_filename' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='co_name' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='co_lnotab' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='co_zombieframe' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/code.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='co_weakreflist' type-id='type-id-52' visibility='default' filepath='../gpshead/Include/code.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='co_extra' type-id='type-id-56' visibility='default' filepath='../gpshead/Include/code.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCodeObject' type-id='type-id-271' filepath='../gpshead/Include/code.h' line='51' column='1' id='type-id-270'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' id='type-id-272'/>
    <class-decl name='_addr_pair' size-in-bits='64' is-struct='yes' visibility='default' filepath='../gpshead/Include/code.h' line='120' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ap_lower' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ap_upper' type-id='type-id-7' visibility='default' filepath='../gpshead/Include/code.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyAddrPair' type-id='type-id-273' filepath='../gpshead/Include/code.h' line='123' column='1' id='type-id-274'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <function-decl name='_PyCode_CheckLineNumber' mangled-name='_PyCode_CheckLineNumber' filepath='../gpshead/Objects/codeobject.c' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_CheckLineNumber'>
      <parameter type-id='type-id-272' name='co' filepath='../gpshead/Objects/codeobject.c' line='792' column='1'/>
      <parameter type-id='type-id-7' name='lasti' filepath='../gpshead/Objects/codeobject.c' line='792' column='1'/>
      <parameter type-id='type-id-275' name='bounds' filepath='../gpshead/Objects/codeobject.c' line='792' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='PyCode_Addr2Line' mangled-name='PyCode_Addr2Line' filepath='../gpshead/Objects/codeobject.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_Addr2Line'>
      <parameter type-id='type-id-272' name='co' filepath='../gpshead/Objects/codeobject.c' line='773' column='1'/>
      <parameter type-id='type-id-7' name='addrq' filepath='../gpshead/Objects/codeobject.c' line='773' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='_PyCode_ConstantKey' mangled-name='_PyCode_ConstantKey' filepath='../gpshead/Objects/codeobject.c' line='499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyCode_ConstantKey'>
      <parameter type-id='type-id-52' name='op' filepath='../gpshead/Objects/codeobject.c' line='499' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyCode_NewEmpty' mangled-name='PyCode_NewEmpty' filepath='../gpshead/Objects/codeobject.c' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_NewEmpty'>
      <parameter type-id='type-id-3' name='filename' filepath='../gpshead/Objects/codeobject.c' line='225' column='1'/>
      <parameter type-id='type-id-3' name='funcname' filepath='../gpshead/Objects/codeobject.c' line='225' column='1'/>
      <parameter type-id='type-id-7' name='firstlineno' filepath='../gpshead/Objects/codeobject.c' line='225' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-decl name='PyCode_New' mangled-name='PyCode_New' filepath='../gpshead/Objects/codeobject.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyCode_New'>
      <parameter type-id='type-id-7' name='argcount' filepath='../gpshead/Objects/codeobject.c' line='97' column='1'/>
      <parameter type-id='type-id-7' name='kwonlyargcount' filepath='../gpshead/Objects/codeobject.c' line='97' column='1'/>
      <parameter type-id='type-id-7' name='nlocals' filepath='../gpshead/Objects/codeobject.c' line='98' column='1'/>
      <parameter type-id='type-id-7' name='stacksize' filepath='../gpshead/Objects/codeobject.c' line='98' column='1'/>
      <parameter type-id='type-id-7' name='flags' filepath='../gpshead/Objects/codeobject.c' line='98' column='1'/>
      <parameter type-id='type-id-52' name='code' filepath='../gpshead/Objects/codeobject.c' line='99' column='1'/>
      <parameter type-id='type-id-52' name='consts' filepath='../gpshead/Objects/codeobject.c' line='99' column='1'/>
      <parameter type-id='type-id-52' name='names' filepath='../gpshead/Objects/codeobject.c' line='99' column='1'/>
      <parameter type-id='type-id-52' name='varnames' filepath='../gpshead/Objects/codeobject.c' line='100' column='1'/>
      <parameter type-id='type-id-52' name='freevars' filepath='../gpshead/Objects/codeobject.c' line='100' column='1'/>
      <parameter type-id='type-id-52' name='cellvars' filepath='../gpshead/Objects/codeobject.c' line='100' column='1'/>
      <parameter type-id='type-id-52' name='filename' filepath='../gpshead/Objects/codeobject.c' line='101' column='1'/>
      <parameter type-id='type-id-52' name='name' filepath='../gpshead/Objects/codeobject.c' line='101' column='1'/>
      <parameter type-id='type-id-7' name='firstlineno' filepath='../gpshead/Objects/codeobject.c' line='101' column='1'/>
      <parameter type-id='type-id-52' name='lnotab' filepath='../gpshead/Objects/codeobject.c' line='102' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/complexobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <var-decl name='PyComplex_Type' type-id='type-id-245' mangled-name='PyComplex_Type' visibility='default' filepath='../gpshead/Include/complexobject.h' line='39' column='1' elf-symbol-id='PyComplex_Type'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-276' visibility='default' filepath='../gpshead/Include/complexobject.h' line='10' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='real' type-id='type-id-278' visibility='default' filepath='../gpshead/Include/complexobject.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='imag' type-id='type-id-278' visibility='default' filepath='../gpshead/Include/complexobject.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-278'/>
    <typedef-decl name='Py_complex' type-id='type-id-277' filepath='../gpshead/Include/complexobject.h' line='13' column='1' id='type-id-276'/>
    <function-decl name='PyComplex_AsCComplex' mangled-name='PyComplex_AsCComplex' filepath='../gpshead/Objects/complexobject.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_AsCComplex'>
      <parameter type-id='type-id-52' name='op' filepath='../gpshead/Objects/complexobject.c' line='311' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
    <function-decl name='PyComplex_ImagAsDouble' mangled-name='PyComplex_ImagAsDouble' filepath='../gpshead/Objects/complexobject.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_ImagAsDouble'>
      <parameter type-id='type-id-52' name='op' filepath='../gpshead/Objects/complexobject.c' line='266' column='1'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='PyComplex_RealAsDouble' mangled-name='PyComplex_RealAsDouble' filepath='../gpshead/Objects/complexobject.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_RealAsDouble'>
      <parameter type-id='type-id-52' name='op' filepath='../gpshead/Objects/complexobject.c' line='266' column='1'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='PyComplex_FromDoubles' mangled-name='PyComplex_FromDoubles' filepath='../gpshead/Objects/complexobject.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_FromDoubles'>
      <parameter type-id='type-id-278' name='real' filepath='../gpshead/Objects/complexobject.c' line='246' column='1'/>
      <parameter type-id='type-id-278' name='imag' filepath='../gpshead/Objects/complexobject.c' line='246' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='PyComplex_FromCComplex' mangled-name='PyComplex_FromCComplex' filepath='../gpshead/Objects/complexobject.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyComplex_FromCComplex'>
      <parameter type-id='type-id-276' name='cval' filepath='../gpshead/Objects/complexobject.c' line='223' column='1'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='_Py_c_abs' mangled-name='_Py_c_abs' filepath='../gpshead/Objects/complexobject.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_abs'>
      <parameter type-id='type-id-276' name='z' filepath='../gpshead/Objects/complexobject.c' line='180' column='1'/>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='_Py_c_pow' mangled-name='_Py_c_pow' filepath='../gpshead/Objects/complexobject.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_pow'>
      <parameter type-id='type-id-276' name='a' filepath='../gpshead/Objects/complexobject.c' line='117' column='1'/>
      <parameter type-id='type-id-276' name='b' filepath='../gpshead/Objects/complexobject.c' line='117' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
    <function-decl name='_Py_c_quot' mangled-name='_Py_c_quot' filepath='../gpshead/Objects/complexobject.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_quot'>
      <parameter type-id='type-id-276' name='a' filepath='../gpshead/Objects/complexobject.c' line='59' column='1'/>
      <parameter type-id='type-id-276' name='b' filepath='../gpshead/Objects/complexobject.c' line='59' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
    <function-decl name='_Py_c_prod' mangled-name='_Py_c_prod' filepath='../gpshead/Objects/complexobject.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_prod'>
      <parameter type-id='type-id-276' name='a' filepath='../gpshead/Objects/complexobject.c' line='50' column='1'/>
      <parameter type-id='type-id-276' name='b' filepath='../gpshead/Objects/complexobject.c' line='50' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
    <function-decl name='_Py_c_neg' mangled-name='_Py_c_neg' filepath='../gpshead/Objects/complexobject.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_neg'>
      <parameter type-id='type-id-276' name='a' filepath='../gpshead/Objects/complexobject.c' line='41' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
    <function-decl name='_Py_c_diff' mangled-name='_Py_c_diff' filepath='../gpshead/Objects/complexobject.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_diff'>
      <parameter type-id='type-id-276' name='a' filepath='../gpshead/Objects/complexobject.c' line='50' column='1'/>
      <parameter type-id='type-id-276' name='b' filepath='../gpshead/Objects/complexobject.c' line='50' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
    <function-decl name='_Py_c_sum' mangled-name='_Py_c_sum' filepath='../gpshead/Objects/complexobject.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_c_sum'>
      <parameter type-id='type-id-276' name='a' filepath='../gpshead/Objects/complexobject.c' line='50' column='1'/>
      <parameter type-id='type-id-276' name='b' filepath='../gpshead/Objects/complexobject.c' line='50' column='1'/>
      <return type-id='type-id-276'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../gpshead/Objects/descrobject.c' comp-dir-path='/home/greg/oss/python/cpython/fresh37' language='LANG_C99'>
    <var-decl name='PyMethodDescr_Type' type-id='type-id-245' mangled-name='PyMethodDescr_Type' visibility='default' filepath='../gpshead/Include/descrobject.h' line='78' column='1' elf-symbol-id='PyMethodDescr_Type'/>
    <var-decl name='PyClassMethodDescr_Type' type-id='type-id-245' mangled-name='PyClassMethodDescr_Type' visibility='default' filepath='../gpshead/Include/descrobject.h' line='75' column='1' elf-symbol-id='PyClassMethodDescr_Type'/>
    <var-decl name='PyMemberDescr_Type' type-id='type-id-245' mangled-name='PyMemberDescr_Type' visibility='default' filepath='../gpshead/Include/descrobject.h' line='77' column='1' elf-symbol-id='PyMemberDescr_Type'/>
    <var-decl name='PyGetSetDescr_Type' type-id='type-id-245' mangled-name='PyGetSetDescr_Type' visibility='default' filepath='../gpshead/Include/descrobject.h' line='76' column='1' elf-symbol-id='PyGetSetDescr_Type'/>
