<abi-corpus path='libpython3.11.so' soname='libpython3.11.so.1.0'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libdl.so.2'/>
    <dependency name='libutil.so.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAIter_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_Parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_UnpackTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ValidateKeywordArguments' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_PyParser_TokenNames' size='520' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyRuntime' size='166688' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PySet_Dummy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_CallableProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_ProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_RefType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_EllipsisObject' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_FalseStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HasFileSystemDefaultEncodeErrors' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HashSecret' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NoneStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NotImplementedStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/src' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-3'/>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='_Py_gitversion' mangled-name='_Py_gitversion' filepath='./Modules/getbuildinfo.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitversion'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/token.c' comp-dir-path='/src' language='LANG_C99'>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-4'/>

    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='infinite' id='type-id-5'>
      <subrange length='infinite' id='type-id-6'/>

    </array-type-def>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-7'/>
    <var-decl name='_PyParser_TokenNames' type-id='type-id-7' mangled-name='_PyParser_TokenNames' visibility='default' filepath='./Include/token.h' line='88' column='1' elf-symbol-id='_PyParser_TokenNames'/>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <function-decl name='PyToken_ThreeChars' mangled-name='PyToken_ThreeChars' filepath='Parser/token.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_ThreeChars'>
      <parameter type-id='type-id-8' name='c1' filepath='Parser/token.c' line='194' column='1'/>
      <parameter type-id='type-id-8' name='c2' filepath='Parser/token.c' line='194' column='1'/>
      <parameter type-id='type-id-8' name='c3' filepath='Parser/token.c' line='194' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyToken_TwoChars' mangled-name='PyToken_TwoChars' filepath='Parser/token.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_TwoChars'>
      <parameter type-id='type-id-8' name='c1' filepath='Parser/token.c' line='110' column='1'/>
      <parameter type-id='type-id-8' name='c2' filepath='Parser/token.c' line='110' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyToken_OneChar' mangled-name='PyToken_OneChar' filepath='Parser/token.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyToken_OneChar'>
      <parameter type-id='type-id-8' name='c1' filepath='Parser/token.c' line='79' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='Parser/myreadline.c' comp-dir-path='/src' language='LANG_C99'>
    <class-decl name='_ts' size-in-bits='2880' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='82' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-10' visibility='default' filepath='./Include/cpython/pystate.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-10' visibility='default' filepath='./Include/cpython/pystate.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-11' visibility='default' filepath='./Include/cpython/pystate.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_initialized' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='_static' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_remaining' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='recursion_limit' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recursion_headroom' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tracing' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tracing_what' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cframe' type-id='type-id-12' visibility='default' filepath='./Include/cpython/pystate.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_profilefunc' type-id='type-id-13' visibility='default' filepath='./Include/cpython/pystate.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_tracefunc' type-id='type-id-13' visibility='default' filepath='./Include/cpython/pystate.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_profileobj' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='c_traceobj' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_type' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='curexc_value' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='curexc_traceback' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='exc_info' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dict' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='gilstate_counter' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='async_exc' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='thread_id' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='native_thread_id' type-id='type-id-16' visibility='default' filepath='./Include/cpython/pystate.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='trash_delete_nesting' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='trash_delete_later' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='on_delete' type-id='type-id-17' visibility='default' filepath='./Include/cpython/pystate.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='on_delete_data' type-id='type-id-18' visibility='default' filepath='./Include/cpython/pystate.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pystate.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='async_gen_firstiter' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='async_gen_finalizer' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='context' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='context_ver' type-id='type-id-19' visibility='default' filepath='./Include/cpython/pystate.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='id' type-id='type-id-19' visibility='default' filepath='./Include/cpython/pystate.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='trace_info' type-id='type-id-20' visibility='default' filepath='./Include/cpython/pystate.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='datastack_chunk' type-id='type-id-21' visibility='default' filepath='./Include/cpython/pystate.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='datastack_top' type-id='type-id-22' visibility='default' filepath='./Include/cpython/pystate.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='datastack_limit' type-id='type-id-22' visibility='default' filepath='./Include/cpython/pystate.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='exc_state' type-id='type-id-23' visibility='default' filepath='./Include/cpython/pystate.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='root_cframe' type-id='type-id-24' visibility='default' filepath='./Include/cpython/pystate.h' line='202' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyThreadState' type-id='type-id-9' filepath='./Include/pytypedefs.h' line='24' column='1' id='type-id-25'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-10'/>
    <class-decl name='_is' size-in-bits='862016' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='78' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-11' visibility='default' filepath='./Include/internal/pycore_interp.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='threads' type-id='type-id-27' visibility='default' filepath='./Include/internal/pycore_interp.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='runtime' type-id='type-id-28' visibility='default' filepath='./Include/internal/pycore_interp.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='id' type-id='type-id-29' visibility='default' filepath='./Include/internal/pycore_interp.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='id_refcount' type-id='type-id-29' visibility='default' filepath='./Include/internal/pycore_interp.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='requires_idref' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='id_mutex' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_interp.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_initialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='finalizing' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_static' type-id='type-id-31' visibility='default' filepath='./Include/internal/pycore_interp.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ceval' type-id='type-id-32' visibility='default' filepath='./Include/internal/pycore_interp.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='gc' type-id='type-id-33' visibility='default' filepath='./Include/internal/pycore_interp.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='modules' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='modules_by_index' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='sysdict' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='builtins' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='importlib' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='override_frozen_modules' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7488'>
        <var-decl name='codec_search_path' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7552'>
        <var-decl name='codec_search_cache' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='codec_error_registry' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='codecs_initialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='config' type-id='type-id-34' visibility='default' filepath='./Include/internal/pycore_interp.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='dlopenflags' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='dict' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='builtins_copy' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='import_func' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='eval_frame' type-id='type-id-35' visibility='default' filepath='./Include/internal/pycore_interp.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11456'>
        <var-decl name='co_extra_user_count' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_interp.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-37' visibility='default' filepath='./Include/internal/pycore_interp.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27840'>
        <var-decl name='before_forkers' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27904'>
        <var-decl name='after_forkers_parent' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27968'>
        <var-decl name='after_forkers_child' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28032'>
        <var-decl name='warnings' type-id='type-id-38' visibility='default' filepath='./Include/internal/pycore_interp.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28288'>
        <var-decl name='atexit' type-id='type-id-39' visibility='default' filepath='./Include/internal/pycore_interp.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28416'>
        <var-decl name='audit_hooks' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28480'>
        <var-decl name='unicode' type-id='type-id-40' visibility='default' filepath='./Include/internal/pycore_interp.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28864'>
        <var-decl name='float_state' type-id='type-id-41' visibility='default' filepath='./Include/internal/pycore_interp.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28992'>
        <var-decl name='slice_cache' type-id='type-id-42' visibility='default' filepath='./Include/internal/pycore_interp.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29056'>
        <var-decl name='tuple' type-id='type-id-43' visibility='default' filepath='./Include/internal/pycore_interp.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30976'>
        <var-decl name='list' type-id='type-id-44' visibility='default' filepath='./Include/internal/pycore_interp.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36160'>
        <var-decl name='dict_state' type-id='type-id-45' visibility='default' filepath='./Include/internal/pycore_interp.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46528'>
        <var-decl name='async_gen' type-id='type-id-46' visibility='default' filepath='./Include/internal/pycore_interp.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56896'>
        <var-decl name='context' type-id='type-id-47' visibility='default' filepath='./Include/internal/pycore_interp.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57024'>
        <var-decl name='exc_state' type-id='type-id-48' visibility='default' filepath='./Include/internal/pycore_interp.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57280'>
        <var-decl name='ast' type-id='type-id-49' visibility='default' filepath='./Include/internal/pycore_interp.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72448'>
        <var-decl name='type_cache' type-id='type-id-50' visibility='default' filepath='./Include/internal/pycore_interp.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='858880'>
        <var-decl name='callable_cache' type-id='type-id-51' visibility='default' filepath='./Include/internal/pycore_interp.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='859072'>
        <var-decl name='int_max_str_digits' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='859136'>
        <var-decl name='_initial_thread' type-id='type-id-25' visibility='default' filepath='./Include/internal/pycore_interp.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyInterpreterState' type-id='type-id-26' filepath='./Include/pytypedefs.h' line='25' column='1' id='type-id-52'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-11'/>
    <class-decl name='pythreads' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='82' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_unique_id' type-id='type-id-19' visibility='default' filepath='./Include/internal/pycore_interp.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-10' visibility='default' filepath='./Include/internal/pycore_interp.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='count' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_interp.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stacksize' type-id='type-id-54' visibility='default' filepath='./Include/internal/pycore_interp.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-16'/>
    <typedef-decl name='__uint64_t' type-id='type-id-16' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-55'/>
    <typedef-decl name='uint64_t' type-id='type-id-55' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-19'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-53'/>
    <typedef-decl name='size_t' type-id='type-id-16' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-54'/>
    <class-decl name='pyruntimestate' size-in-bits='1333504' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='59' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_initialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='preinitializing' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='preinitialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='core_initialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='initialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_finalizing' type-id='type-id-57' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='interpreters' type-id='type-id-58' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='xidregistry' type-id='type-id-59' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='main_thread' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='exitfuncs' type-id='type-id-60' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='nexitfuncs' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ceval' type-id='type-id-61' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='gilstate' type-id='type-id-62' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='preconfig' type-id='type-id-63' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='open_code_hook' type-id='type-id-64' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='open_code_userdata' type-id='type-id-18' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='audit_hook_head' type-id='type-id-65' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='unicode_ids' type-id='type-id-66' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='global_objects' type-id='type-id-67' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='471488'>
        <var-decl name='_main_interpreter' type-id='type-id-52' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_address' size-in-bits='64' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='45' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-69' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='atomic_uintptr_t' size-in-bits='64' id='type-id-69'/>
    <typedef-decl name='_Py_atomic_address' type-id='type-id-68' filepath='./Include/internal/pycore_atomic.h' line='47' column='1' id='type-id-57'/>
    <class-decl name='pyinterpreters' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='85' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-11' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='main' type-id='type-id-11' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_id' type-id='type-id-29' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-18'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-18' filepath='./Include/pythread.h' line='4' column='1' id='type-id-30'/>
    <typedef-decl name='__int64_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-71'/>
    <typedef-decl name='int64_t' type-id='type-id-71' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-29'/>
    <class-decl name='_xidregistry' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='104' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='head' type-id='type-id-72' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_xidregitem' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='210' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cls' type-id='type-id-74' visibility='default' filepath='./Include/internal/pycore_interp.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='getdata' type-id='type-id-75' visibility='default' filepath='./Include/internal/pycore_interp.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-72' visibility='default' filepath='./Include/internal/pycore_interp.h' line='213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' size-in-bits='3264' is-struct='yes' visibility='default' filepath='./Include/cpython/object.h' line='148' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-36' visibility='default' filepath='./Include/cpython/object.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-36' visibility='default' filepath='./Include/cpython/object.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-36' visibility='default' filepath='./Include/cpython/object.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-80' visibility='default' filepath='./Include/cpython/object.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-81' visibility='default' filepath='./Include/cpython/object.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-83' visibility='default' filepath='./Include/cpython/object.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-84' visibility='default' filepath='./Include/cpython/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-85' visibility='default' filepath='./Include/cpython/object.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-86' visibility='default' filepath='./Include/cpython/object.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-88' visibility='default' filepath='./Include/cpython/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-90' visibility='default' filepath='./Include/cpython/object.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-16' visibility='default' filepath='./Include/cpython/object.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-3' visibility='default' filepath='./Include/cpython/object.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-93' visibility='default' filepath='./Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-36' visibility='default' filepath='./Include/cpython/object.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-94' visibility='default' filepath='./Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-95' visibility='default' filepath='./Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-96' visibility='default' filepath='./Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-97' visibility='default' filepath='./Include/cpython/object.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-98' visibility='default' filepath='./Include/cpython/object.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-74' visibility='default' filepath='./Include/cpython/object.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-14' visibility='default' filepath='./Include/cpython/object.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-99' visibility='default' filepath='./Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-36' visibility='default' filepath='./Include/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-102' visibility='default' filepath='./Include/cpython/object.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-103' visibility='default' filepath='./Include/cpython/object.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-104' visibility='default' filepath='./Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-14' visibility='default' filepath='./Include/cpython/object.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-14' visibility='default' filepath='./Include/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-14' visibility='default' filepath='./Include/cpython/object.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-14' visibility='default' filepath='./Include/cpython/object.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-14' visibility='default' filepath='./Include/cpython/object.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-105' visibility='default' filepath='./Include/cpython/object.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-106' visibility='default' filepath='./Include/cpython/object.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-77' visibility='default' filepath='./Include/object.h' line='109' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/object.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-36' visibility='default' filepath='./Include/object.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_object' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/object.h' line='100' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-36' visibility='default' filepath='./Include/object.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-74' visibility='default' filepath='./Include/object.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-110'/>
    <typedef-decl name='ssize_t' type-id='type-id-110' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-111'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-111' filepath='./Include/pyport.h' line='131' column='1' id='type-id-36'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-76' filepath='./Include/pytypedefs.h' line='20' column='1' id='type-id-112'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-74'/>
    <typedef-decl name='PyObject' type-id='type-id-109' filepath='./Include/pytypedefs.h' line='18' column='1' id='type-id-108'/>
    <typedef-decl name='PyVarObject' type-id='type-id-107' filepath='./Include/object.h' line='112' column='1' id='type-id-77'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <typedef-decl name='destructor' type-id='type-id-114' filepath='./Include/object.h' line='213' column='1' id='type-id-78'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
    <typedef-decl name='getattrfunc' type-id='type-id-117' filepath='./Include/object.h' line='214' column='1' id='type-id-79'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-119'/>
    <typedef-decl name='setattrfunc' type-id='type-id-119' filepath='./Include/object.h' line='216' column='1' id='type-id-80'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-120' visibility='default' filepath='./Include/cpython/object.h' line='130' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='am_send' type-id='type-id-123' visibility='default' filepath='./Include/cpython/object.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
    <typedef-decl name='unaryfunc' type-id='type-id-125' filepath='./Include/object.h' line='196' column='1' id='type-id-122'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-126'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='./Include/object.h' line='676' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-126'/>
      <enumerator name='PYGEN_RETURN' value='0'/>
      <enumerator name='PYGEN_ERROR' value='-1'/>
      <enumerator name='PYGEN_NEXT' value='1'/>
    </enum-decl>
    <typedef-decl name='PySendResult' type-id='type-id-127' filepath='./Include/object.h' line='680' column='1' id='type-id-128'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <typedef-decl name='sendfunc' type-id='type-id-130' filepath='./Include/cpython/object.h' line='128' column='1' id='type-id-123'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-121' filepath='./Include/cpython/object.h' line='135' column='1' id='type-id-120'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-81'/>
    <typedef-decl name='reprfunc' type-id='type-id-125' filepath='./Include/object.h' line='218' column='1' id='type-id-82'/>
    <class-decl name='__anonymous_struct__' size-in-bits='2304' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-131' visibility='default' filepath='./Include/cpython/object.h' line='61' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-18' visibility='default' filepath='./Include/cpython/object.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-122' visibility='default' filepath='./Include/cpython/object.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <typedef-decl name='binaryfunc' type-id='type-id-135' filepath='./Include/object.h' line='197' column='1' id='type-id-133'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-137' filepath='./Include/object.h' line='198' column='1' id='type-id-87'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-139'/>
    <typedef-decl name='inquiry' type-id='type-id-139' filepath='./Include/object.h' line='199' column='1' id='type-id-92'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-132' filepath='./Include/cpython/object.h' line='106' column='1' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-83'/>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-140' visibility='default' filepath='./Include/cpython/object.h' line='108' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-142' visibility='default' filepath='./Include/cpython/object.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-143' visibility='default' filepath='./Include/cpython/object.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-143' visibility='default' filepath='./Include/cpython/object.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-18' visibility='default' filepath='./Include/cpython/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-144' visibility='default' filepath='./Include/cpython/object.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-18' visibility='default' filepath='./Include/cpython/object.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-145' visibility='default' filepath='./Include/cpython/object.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-143' visibility='default' filepath='./Include/cpython/object.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' id='type-id-147'/>
    <typedef-decl name='lenfunc' type-id='type-id-147' filepath='./Include/object.h' line='200' column='1' id='type-id-142'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-149' filepath='./Include/object.h' line='201' column='1' id='type-id-143'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-151' filepath='./Include/object.h' line='203' column='1' id='type-id-144'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-153'/>
    <typedef-decl name='objobjproc' type-id='type-id-153' filepath='./Include/object.h' line='207' column='1' id='type-id-145'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-141' filepath='./Include/cpython/object.h' line='120' column='1' id='type-id-140'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-84'/>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-154' visibility='default' filepath='./Include/cpython/object.h' line='122' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-142' visibility='default' filepath='./Include/cpython/object.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-133' visibility='default' filepath='./Include/cpython/object.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-156' visibility='default' filepath='./Include/cpython/object.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-158'/>
    <typedef-decl name='objobjargproc' type-id='type-id-158' filepath='./Include/object.h' line='205' column='1' id='type-id-156'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-155' filepath='./Include/cpython/object.h' line='126' column='1' id='type-id-154'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-85'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-36' filepath='./Include/pyport.h' line='145' column='1' id='type-id-159'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-161'/>
    <typedef-decl name='hashfunc' type-id='type-id-161' filepath='./Include/object.h' line='219' column='1' id='type-id-86'/>
    <typedef-decl name='getattrofunc' type-id='type-id-135' filepath='./Include/object.h' line='215' column='1' id='type-id-88'/>
    <typedef-decl name='setattrofunc' type-id='type-id-158' filepath='./Include/object.h' line='217' column='1' id='type-id-89'/>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-162' visibility='default' filepath='./Include/cpython/object.h' line='137' column='1' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-164' visibility='default' filepath='./Include/cpython/object.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-165' visibility='default' filepath='./Include/cpython/object.h' line='139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-166' visibility='default' filepath='./Include/pybuffer.h' line='20' column='1' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-18' visibility='default' filepath='./Include/pybuffer.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-14' visibility='default' filepath='./Include/pybuffer.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-36' visibility='default' filepath='./Include/pybuffer.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-36' visibility='default' filepath='./Include/pybuffer.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-8' visibility='default' filepath='./Include/pybuffer.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-8' visibility='default' filepath='./Include/pybuffer.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-115' visibility='default' filepath='./Include/pybuffer.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-168' visibility='default' filepath='./Include/pybuffer.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-168' visibility='default' filepath='./Include/pybuffer.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-168' visibility='default' filepath='./Include/pybuffer.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-18' visibility='default' filepath='./Include/pybuffer.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-168'/>
    <typedef-decl name='Py_buffer' type-id='type-id-167' filepath='./Include/pybuffer.h' line='33' column='1' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-171'/>
    <typedef-decl name='getbufferproc' type-id='type-id-171' filepath='./Include/cpython/object.h' line='54' column='1' id='type-id-164'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-173'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-173' filepath='./Include/cpython/object.h' line='55' column='1' id='type-id-165'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-163' filepath='./Include/cpython/object.h' line='140' column='1' id='type-id-162'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <typedef-decl name='visitproc' type-id='type-id-175' filepath='./Include/object.h' line='208' column='1' id='type-id-176'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-178'/>
    <typedef-decl name='traverseproc' type-id='type-id-178' filepath='./Include/object.h' line='209' column='1' id='type-id-91'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-180'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-180' filepath='./Include/object.h' line='220' column='1' id='type-id-93'/>
    <typedef-decl name='getiterfunc' type-id='type-id-125' filepath='./Include/object.h' line='221' column='1' id='type-id-94'/>
    <typedef-decl name='iternextfunc' type-id='type-id-125' filepath='./Include/object.h' line='222' column='1' id='type-id-95'/>
    <class-decl name='PyMethodDef' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/methodobject.h' line='54' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-182' visibility='default' filepath='./Include/methodobject.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-8' visibility='default' filepath='./Include/methodobject.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCFunction' type-id='type-id-135' filepath='./Include/methodobject.h' line='19' column='1' id='type-id-182'/>
    <typedef-decl name='PyMethodDef' type-id='type-id-181' filepath='./Include/pytypedefs.h' line='14' column='1' id='type-id-183'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-96'/>
    <class-decl name='PyMemberDef' size-in-bits='320' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <typedef-decl name='PyMemberDef' type-id='type-id-184' filepath='./Include/pytypedefs.h' line='16' column='1' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-97'/>
    <class-decl name='PyGetSetDef' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/descrobject.h' line='11' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-187' visibility='default' filepath='./Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-188' visibility='default' filepath='./Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-18' visibility='default' filepath='./Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-190'/>
    <typedef-decl name='getter' type-id='type-id-190' filepath='./Include/descrobject.h' line='8' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <typedef-decl name='setter' type-id='type-id-192' filepath='./Include/descrobject.h' line='9' column='1' id='type-id-188'/>
    <typedef-decl name='PyGetSetDef' type-id='type-id-186' filepath='./Include/pytypedefs.h' line='15' column='1' id='type-id-193'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-98'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-137' filepath='./Include/object.h' line='223' column='1' id='type-id-99'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-158' filepath='./Include/object.h' line='224' column='1' id='type-id-100'/>
    <typedef-decl name='initproc' type-id='type-id-158' filepath='./Include/object.h' line='225' column='1' id='type-id-101'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <typedef-decl name='allocfunc' type-id='type-id-195' filepath='./Include/object.h' line='227' column='1' id='type-id-102'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-197'/>
    <typedef-decl name='newfunc' type-id='type-id-197' filepath='./Include/object.h' line='226' column='1' id='type-id-103'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-17'/>
    <typedef-decl name='freefunc' type-id='type-id-17' filepath='./Include/object.h' line='212' column='1' id='type-id-104'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-105'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-199'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-202'/>
    <typedef-decl name='vectorcallfunc' type-id='type-id-202' filepath='./Include/cpython/object.h' line='57' column='1' id='type-id-106'/>
    <class-decl name='_xid' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/cpython/pystate.h' line='316' column='1' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-18' visibility='default' filepath='./Include/cpython/pystate.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pystate.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-29' visibility='default' filepath='./Include/cpython/pystate.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='new_object' type-id='type-id-204' visibility='default' filepath='./Include/cpython/pystate.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='free' type-id='type-id-17' visibility='default' filepath='./Include/cpython/pystate.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyCrossInterpreterData' type-id='type-id-203' filepath='./Include/cpython/pystate.h' line='314' column='1' id='type-id-205'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-204'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-209'/>
    <typedef-decl name='crossinterpdatafunc' type-id='type-id-209' filepath='./Include/cpython/pystate.h' line='363' column='1' id='type-id-75'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>

    <array-type-def dimensions='1' type-id='type-id-211' size-in-bits='2048' id='type-id-60'>
      <subrange length='32' type-id='type-id-16' id='type-id-212'/>

    </array-type-def>
    <class-decl name='_ceval_runtime_state' size-in-bits='1728' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='20' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signals_pending' type-id='type-id-213' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gil' type-id='type-id-214' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_int' size-in-bits='32' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='49' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-216' visibility='default' filepath='./Include/internal/pycore_atomic.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='atomic_int' size-in-bits='32' id='type-id-216'/>
    <typedef-decl name='_Py_atomic_int' type-id='type-id-215' filepath='./Include/internal/pycore_atomic.h' line='51' column='1' id='type-id-213'/>
    <class-decl name='_gil_runtime_state' size-in-bits='1664' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_gil.h' line='23' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interval' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_gil.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last_holder' type-id='type-id-57' visibility='default' filepath='./Include/internal/pycore_gil.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='locked' type-id='type-id-213' visibility='default' filepath='./Include/internal/pycore_gil.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='switch_number' type-id='type-id-16' visibility='default' filepath='./Include/internal/pycore_gil.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cond' type-id='type-id-217' visibility='default' filepath='./Include/internal/pycore_gil.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mutex' type-id='type-id-218' visibility='default' filepath='./Include/internal/pycore_gil.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='switch_cond' type-id='type-id-217' visibility='default' filepath='./Include/internal/pycore_gil.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='switch_mutex' type-id='type-id-218' visibility='default' filepath='./Include/internal/pycore_gil.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-219'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-220' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-221' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-222' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='92' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='type-id-224' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='type-id-224' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='type-id-105' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='type-id-105' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='type-id-224' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='94' column='1' id='type-id-223'>
      <data-member access='private'>
        <var-decl name='__wseq' type-id='type-id-225' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__wseq32' type-id='type-id-226' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-225'/>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='97' column='1' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='type-id-105' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='type-id-105' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-105' size-in-bits='64' id='type-id-224'>
      <subrange length='2' type-id='type-id-16' id='type-id-227'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-221'>
      <subrange length='48' type-id='type-id-16' id='type-id-228'/>

    </array-type-def>
    <type-decl name='long long int' size-in-bits='64' id='type-id-222'/>
    <typedef-decl name='pthread_cond_t' type-id='type-id-219' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-217'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-229'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-230' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-231' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-53' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-105' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-105' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-232' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-232' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-233' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-232'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='49' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-235' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-235' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-234' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1' id='type-id-233'/>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-231'>
      <subrange length='40' type-id='type-id-16' id='type-id-236'/>

    </array-type-def>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-229' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-218'/>
    <class-decl name='_gilstate_runtime_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='31' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='check_enabled' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_current' type-id='type-id-57' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='autoInterpreterState' type-id='type-id-11' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='autoTSSkey' type-id='type-id-237' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_tss_t' size-in-bits='64' is-struct='yes' visibility='default' filepath='./Include/cpython/pythread.h' line='31' column='1' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_is_initialized' type-id='type-id-8' visibility='default' filepath='./Include/cpython/pythread.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='_key' type-id='type-id-239' visibility='default' filepath='./Include/cpython/pythread.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='pthread_key_t' type-id='type-id-105' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='49' column='1' id='type-id-239'/>
    <typedef-decl name='Py_tss_t' type-id='type-id-238' filepath='./Include/pythread.h' line='111' column='1' id='type-id-237'/>
    <class-decl name='PyPreConfig' size-in-bits='320' is-struct='yes' visibility='default' filepath='./Include/cpython/initconfig.h' line='47' column='1' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='parse_argv' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='isolated' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='use_environment' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='configure_locale' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='coerce_c_locale' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='coerce_c_locale_warn' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='utf8_mode' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dev_mode' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='allocator' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyPreConfig' type-id='type-id-240' filepath='./Include/cpython/initconfig.h' line='125' column='1' id='type-id-63'/>
    <typedef-decl name='Py_OpenCodeHookFunction' type-id='type-id-190' filepath='./Include/cpython/fileobject.h' line='12' column='1' id='type-id-64'/>
    <class-decl name='_Py_AuditHookEntry' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='48' column='1' id='type-id-241'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-65' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hookCFunction' type-id='type-id-242' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='userData' type-id='type-id-18' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <typedef-decl name='Py_AuditHookFunction' type-id='type-id-244' filepath='./Include/cpython/sysmodule.h' line='10' column='1' id='type-id-242'/>
    <typedef-decl name='_Py_AuditHookEntry' type-id='type-id-241' filepath='./Include/internal/pycore_runtime.h' line='52' column='1' id='type-id-245'/>
    <class-decl name='_Py_unicode_runtime_ids' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='28' column='1' id='type-id-66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next_index' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_global_objects' size-in-bits='466048' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='28' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='singletons' type-id='type-id-246' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='466048' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='29' column='1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small_ints' type-id='type-id-247' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67072'>
        <var-decl name='bytes_empty' type-id='type-id-248' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67392'>
        <var-decl name='bytes_characters' type-id='type-id-249' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='165696'>
        <var-decl name='strings' type-id='type-id-250' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='465664'>
        <var-decl name='_tuple_empty_gc_not_used' type-id='type-id-251' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='465792'>
        <var-decl name='tuple_empty' type-id='type-id-252' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/cpython/longintrepr.h' line='79' column='1' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/longintrepr.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-254' visibility='default' filepath='./Include/cpython/longintrepr.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-105' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-255'/>
    <typedef-decl name='uint32_t' type-id='type-id-255' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-256'/>
    <typedef-decl name='digit' type-id='type-id-256' filepath='./Include/cpython/longintrepr.h' line='43' column='1' id='type-id-257'/>

    <array-type-def dimensions='1' type-id='type-id-257' size-in-bits='32' id='type-id-254'>
      <subrange length='1' type-id='type-id-16' id='type-id-258'/>

    </array-type-def>
    <typedef-decl name='PyLongObject' type-id='type-id-253' filepath='./Include/pytypedefs.h' line='19' column='1' id='type-id-259'/>

    <array-type-def dimensions='1' type-id='type-id-259' size-in-bits='67072' id='type-id-247'>
      <subrange length='262' type-id='type-id-16' id='type-id-260'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-248' visibility='default' filepath='./Include/cpython/bytesobject.h' line='5' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/bytesobject.h' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_shash' type-id='type-id-159' visibility='default' filepath='./Include/cpython/bytesobject.h' line='7' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ob_sval' type-id='type-id-262' visibility='default' filepath='./Include/cpython/bytesobject.h' line='8' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-262'>
      <subrange length='1' type-id='type-id-16' id='type-id-258'/>

    </array-type-def>
    <typedef-decl name='PyBytesObject' type-id='type-id-261' filepath='./Include/cpython/bytesobject.h' line='15' column='1' id='type-id-248'/>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='38' column='1' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob' type-id='type-id-248' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='eos' type-id='type-id-1' visibility='default' filepath='./Include/internal/pycore_global_objects.h' line='40' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-263' size-in-bits='98304' id='type-id-249'>
      <subrange length='256' type-id='type-id-16' id='type-id-264'/>

    </array-type-def>
    <class-decl name='_Py_global_strings' size-in-bits='299968' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='29' column='1' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='literals' type-id='type-id-265' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10112'>
        <var-decl name='identifiers' type-id='type-id-266' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160704'>
        <var-decl name='ascii' type-id='type-id-267' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='218048'>
        <var-decl name='latin1' type-id='type-id-268' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='367' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='10112' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='30' column='1' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_anon_dictcomp' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_anon_genexpr' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_anon_lambda' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_anon_listcomp' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='_anon_module' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='_anon_setcomp' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='_anon_string' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='_anon_unknown' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='_close_br' type-id='type-id-272' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='_comma_sep' type-id='type-id-273' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='_dbl_close_br' type-id='type-id-273' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='_dbl_open_br' type-id='type-id-273' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='_dbl_percent' type-id='type-id-273' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='_dot' type-id='type-id-272' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='_dot_locals' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='_empty' type-id='type-id-274' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='_list_err' type-id='type-id-275' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='_newline' type-id='type-id-272' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='_open_br' type-id='type-id-272' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='_percent' type-id='type-id-272' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='_utf_8' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='31' column='1' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-278' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-277' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='72' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-36' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash' type-id='type-id-159' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='state' type-id='type-id-280' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='wstr' type-id='type-id-281' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='205' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='149' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='interned' type-id='type-id-105' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='kind' type-id='type-id-105' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='compact' type-id='type-id-105' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='ascii' type-id='type-id-105' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ready' type-id='type-id-105' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wchar_t' type-id='type-id-8' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='321' column='1' id='type-id-282'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' id='type-id-281'/>
    <typedef-decl name='PyASCIIObject' type-id='type-id-279' filepath='./Include/cpython/unicodeobject.h' line='206' column='1' id='type-id-277'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-283'/>
    <typedef-decl name='__uint8_t' type-id='type-id-283' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-284'/>
    <typedef-decl name='uint8_t' type-id='type-id-284' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-285'/>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='88' id='type-id-278'>
      <subrange length='11' type-id='type-id-16' id='type-id-286'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='32' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-287' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='32' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='80' id='type-id-287'>
      <subrange length='10' type-id='type-id-16' id='type-id-288'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='33' column='1' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-289' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='33' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='72' id='type-id-289'>
      <subrange length='9' type-id='type-id-16' id='type-id-290'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='39' column='1' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-291' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='39' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='16' id='type-id-291'>
      <subrange length='2' type-id='type-id-16' id='type-id-227'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='40' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-292' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='40' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='24' id='type-id-292'>
      <subrange length='3' type-id='type-id-16' id='type-id-293'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='46' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-294' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='46' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='8' id='type-id-294'>
      <subrange length='1' type-id='type-id-16' id='type-id-258'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='47' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-295' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='47' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='192' id='type-id-295'>
      <subrange length='24' type-id='type-id-16' id='type-id-296'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='51' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-297' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='51' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='48' id='type-id-297'>
      <subrange length='6' type-id='type-id-16' id='type-id-298'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='150592' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='54' column='1' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_False' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_Py_Repr' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_TextIOWrapper' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_True' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='_WarningMessage' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='__' type-id='type-id-272' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='___IOBase_closed' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='___abc_tpflags__' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='___abs__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='___abstractmethods__' type-id='type-id-304' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='___add__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='___aenter__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='___aexit__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='___aiter__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='___all__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='___and__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='___anext__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='___annotations__' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='___args__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='___await__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='___bases__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='___bool__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10816'>
        <var-decl name='___build_class__' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='___builtins__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11840'>
        <var-decl name='___bytes__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12352'>
        <var-decl name='___call__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12864'>
        <var-decl name='___cantrace__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13376'>
        <var-decl name='___class__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13888'>
        <var-decl name='___class_getitem__' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14464'>
        <var-decl name='___classcell__' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14976'>
        <var-decl name='___complex__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15488'>
        <var-decl name='___contains__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16000'>
        <var-decl name='___copy__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16512'>
        <var-decl name='___del__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16960'>
        <var-decl name='___delattr__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17472'>
        <var-decl name='___delete__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17984'>
        <var-decl name='___delitem__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18496'>
        <var-decl name='___dict__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19008'>
        <var-decl name='___dir__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19456'>
        <var-decl name='___divmod__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19968'>
        <var-decl name='___doc__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20416'>
        <var-decl name='___enter__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20928'>
        <var-decl name='___eq__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21376'>
        <var-decl name='___exit__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21888'>
        <var-decl name='___file__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22400'>
        <var-decl name='___float__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22912'>
        <var-decl name='___floordiv__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23424'>
        <var-decl name='___format__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='23936'>
        <var-decl name='___fspath__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24448'>
        <var-decl name='___ge__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24896'>
        <var-decl name='___get__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25344'>
        <var-decl name='___getattr__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25856'>
        <var-decl name='___getattribute__' type-id='type-id-309' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26432'>
        <var-decl name='___getinitargs__' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26944'>
        <var-decl name='___getitem__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27456'>
        <var-decl name='___getnewargs__' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27968'>
        <var-decl name='___getnewargs_ex__' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28544'>
        <var-decl name='___getstate__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29056'>
        <var-decl name='___gt__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29504'>
        <var-decl name='___hash__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30016'>
        <var-decl name='___iadd__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30528'>
        <var-decl name='___iand__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31040'>
        <var-decl name='___ifloordiv__' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31552'>
        <var-decl name='___ilshift__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32064'>
        <var-decl name='___imatmul__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32576'>
        <var-decl name='___imod__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33088'>
        <var-decl name='___import__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33600'>
        <var-decl name='___imul__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34112'>
        <var-decl name='___index__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34624'>
        <var-decl name='___init__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35136'>
        <var-decl name='___init_subclass__' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='35712'>
        <var-decl name='___instancecheck__' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36288'>
        <var-decl name='___int__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36736'>
        <var-decl name='___invert__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37248'>
        <var-decl name='___ior__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37696'>
        <var-decl name='___ipow__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38208'>
        <var-decl name='___irshift__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38720'>
        <var-decl name='___isabstractmethod__' type-id='type-id-310' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39296'>
        <var-decl name='___isub__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39808'>
        <var-decl name='___iter__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40320'>
        <var-decl name='___itruediv__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40832'>
        <var-decl name='___ixor__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41344'>
        <var-decl name='___le__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='41792'>
        <var-decl name='___len__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42240'>
        <var-decl name='___length_hint__' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='42752'>
        <var-decl name='___lltrace__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='43264'>
        <var-decl name='___loader__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='43776'>
        <var-decl name='___lshift__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44288'>
        <var-decl name='___lt__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44736'>
        <var-decl name='___main__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45248'>
        <var-decl name='___matmul__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45760'>
        <var-decl name='___missing__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46272'>
        <var-decl name='___mod__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46720'>
        <var-decl name='___module__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47232'>
        <var-decl name='___mro_entries__' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='47744'>
        <var-decl name='___mul__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48192'>
        <var-decl name='___name__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48704'>
        <var-decl name='___ne__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49152'>
        <var-decl name='___neg__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49600'>
        <var-decl name='___new__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50048'>
        <var-decl name='___newobj__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='50560'>
        <var-decl name='___newobj_ex__' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51072'>
        <var-decl name='___next__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51584'>
        <var-decl name='___notes__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52096'>
        <var-decl name='___or__' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52544'>
        <var-decl name='___orig_class__' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53056'>
        <var-decl name='___origin__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53568'>
        <var-decl name='___package__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54080'>
        <var-decl name='___parameters__' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='54592'>
        <var-decl name='___path__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55104'>
        <var-decl name='___pos__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='55552'>
        <var-decl name='___pow__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56000'>
        <var-decl name='___prepare__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56512'>
        <var-decl name='___qualname__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57024'>
        <var-decl name='___radd__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57536'>
        <var-decl name='___rand__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58048'>
        <var-decl name='___rdivmod__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58560'>
        <var-decl name='___reduce__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59072'>
        <var-decl name='___reduce_ex__' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59584'>
        <var-decl name='___repr__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60096'>
        <var-decl name='___reversed__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60608'>
        <var-decl name='___rfloordiv__' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61120'>
        <var-decl name='___rlshift__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61632'>
        <var-decl name='___rmatmul__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='62144'>
        <var-decl name='___rmod__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='62656'>
        <var-decl name='___rmul__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='63168'>
        <var-decl name='___ror__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='63616'>
        <var-decl name='___round__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64128'>
        <var-decl name='___rpow__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64640'>
        <var-decl name='___rrshift__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65152'>
        <var-decl name='___rshift__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65664'>
        <var-decl name='___rsub__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66176'>
        <var-decl name='___rtruediv__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66688'>
        <var-decl name='___rxor__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67200'>
        <var-decl name='___set__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67648'>
        <var-decl name='___set_name__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68160'>
        <var-decl name='___setattr__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68672'>
        <var-decl name='___setitem__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='69184'>
        <var-decl name='___setstate__' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='69696'>
        <var-decl name='___sizeof__' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='70208'>
        <var-decl name='___slotnames__' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='70720'>
        <var-decl name='___slots__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='71232'>
        <var-decl name='___spec__' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='71744'>
        <var-decl name='___str__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72192'>
        <var-decl name='___sub__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72640'>
        <var-decl name='___subclasscheck__' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73216'>
        <var-decl name='___subclasshook__' type-id='type-id-309' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='73792'>
        <var-decl name='___truediv__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74304'>
        <var-decl name='___trunc__' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='74816'>
        <var-decl name='___typing_is_unpacked_typevartuple__' type-id='type-id-311' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='75520'>
        <var-decl name='___typing_prepare_subst__' type-id='type-id-312' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='76160'>
        <var-decl name='___typing_subst__' type-id='type-id-309' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='76736'>
        <var-decl name='___typing_unpacked_tuple_args__' type-id='type-id-313' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='77376'>
        <var-decl name='___warningregistry__' type-id='type-id-304' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='77952'>
        <var-decl name='___weakref__' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78464'>
        <var-decl name='___xor__' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='78912'>
        <var-decl name='__abc_impl' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79424'>
        <var-decl name='__annotation' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='79936'>
        <var-decl name='__blksize' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80448'>
        <var-decl name='__bootstrap' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80960'>
        <var-decl name='__dealloc_warn' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='81472'>
        <var-decl name='__finalizing' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='81984'>
        <var-decl name='__find_and_load' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='82496'>
        <var-decl name='__fix_up_module' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='83008'>
        <var-decl name='__get_sourcefile' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='83520'>
        <var-decl name='__handle_fromlist' type-id='type-id-309' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84096'>
        <var-decl name='__initializing' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84608'>
        <var-decl name='__is_text_encoding' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85184'>
        <var-decl name='__lock_unlock_module' type-id='type-id-304' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85760'>
        <var-decl name='__showwarnmsg' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86272'>
        <var-decl name='__shutdown' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86784'>
        <var-decl name='__slotnames' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='87296'>
        <var-decl name='__strptime_time' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='87808'>
        <var-decl name='__uninitialized_submodules' type-id='type-id-314' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88448'>
        <var-decl name='__warn_unawaited_coroutine' type-id='type-id-314' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='89088'>
        <var-decl name='__xoptions' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='89600'>
        <var-decl name='_add' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='90048'>
        <var-decl name='_append' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='90496'>
        <var-decl name='_big' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='90944'>
        <var-decl name='_buffer' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='91392'>
        <var-decl name='_builtins' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='91904'>
        <var-decl name='_c_call' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='92352'>
        <var-decl name='_c_exception' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='92864'>
        <var-decl name='_c_return' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='93376'>
        <var-decl name='_call' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='93824'>
        <var-decl name='_clear' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='94272'>
        <var-decl name='_close' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='94720'>
        <var-decl name='_closed' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='95168'>
        <var-decl name='_code' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='95616'>
        <var-decl name='_copy' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96064'>
        <var-decl name='_copyreg' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96512'>
        <var-decl name='_decode' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96960'>
        <var-decl name='_default' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='97408'>
        <var-decl name='_defaultaction' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='97920'>
        <var-decl name='_dictcomp' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98432'>
        <var-decl name='_difference_update' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99008'>
        <var-decl name='_dispatch_table' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='99520'>
        <var-decl name='_displayhook' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100032'>
        <var-decl name='_enable' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100480'>
        <var-decl name='_encode' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100928'>
        <var-decl name='_encoding' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101440'>
        <var-decl name='_end_lineno' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101952'>
        <var-decl name='_end_offset' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='102464'>
        <var-decl name='_errors' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='102912'>
        <var-decl name='_excepthook' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103424'>
        <var-decl name='_exception' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='103936'>
        <var-decl name='_extend' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104384'>
        <var-decl name='_filename' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104896'>
        <var-decl name='_fileno' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='105344'>
        <var-decl name='_fillvalue' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='105856'>
        <var-decl name='_filters' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106304'>
        <var-decl name='_find_class' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='106816'>
        <var-decl name='_flush' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='107264'>
        <var-decl name='_genexpr' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='107712'>
        <var-decl name='_get' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='108160'>
        <var-decl name='_get_source' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='108672'>
        <var-decl name='_getattr' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109120'>
        <var-decl name='_getstate' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109632'>
        <var-decl name='_ignore' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='110080'>
        <var-decl name='_importlib' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='110592'>
        <var-decl name='_inf' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='111040'>
        <var-decl name='_intersection' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='111552'>
        <var-decl name='_isatty' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112000'>
        <var-decl name='_isinstance' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112512'>
        <var-decl name='_items' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112960'>
        <var-decl name='_iter' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='113408'>
        <var-decl name='_join' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='113856'>
        <var-decl name='_keys' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='114304'>
        <var-decl name='_lambda' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='114752'>
        <var-decl name='_last_traceback' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='115264'>
        <var-decl name='_last_type' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='115776'>
        <var-decl name='_last_value' type-id='type-id-269' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='116288'>
        <var-decl name='_latin1' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='116736'>
        <var-decl name='_len' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117184'>
        <var-decl name='_line' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117632'>
        <var-decl name='_lineno' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='118080'>
        <var-decl name='_listcomp' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='118592'>
        <var-decl name='_little' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='119040'>
        <var-decl name='_locale' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='119488'>
        <var-decl name='_match' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='119936'>
        <var-decl name='_metaclass' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120448'>
        <var-decl name='_mode' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120896'>
        <var-decl name='_modules' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='121344'>
        <var-decl name='_mro' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='121792'>
        <var-decl name='_msg' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='122240'>
        <var-decl name='_n_fields' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='122752'>
        <var-decl name='_n_sequence_fields' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='123328'>
        <var-decl name='_n_unnamed_fields' type-id='type-id-309' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='123904'>
        <var-decl name='_name' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='124352'>
        <var-decl name='_newlines' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='124864'>
        <var-decl name='_next' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125312'>
        <var-decl name='_obj' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125760'>
        <var-decl name='_offset' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='126208'>
        <var-decl name='_onceregistry' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='126720'>
        <var-decl name='_opcode' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='127168'>
        <var-decl name='_open' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='127616'>
        <var-decl name='_parent' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128064'>
        <var-decl name='_partial' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128512'>
        <var-decl name='_path' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128960'>
        <var-decl name='_peek' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129408'>
        <var-decl name='_persistent_id' type-id='type-id-300' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='129920'>
        <var-decl name='_persistent_load' type-id='type-id-303' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='130432'>
        <var-decl name='_print_file_and_line' type-id='type-id-304' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131008'>
        <var-decl name='_ps1' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131456'>
        <var-decl name='_ps2' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131904'>
        <var-decl name='_raw' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132352'>
        <var-decl name='_read' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132800'>
        <var-decl name='_read1' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133248'>
        <var-decl name='_readable' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133760'>
        <var-decl name='_readall' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='134208'>
        <var-decl name='_readinto' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='134720'>
        <var-decl name='_readinto1' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='135232'>
        <var-decl name='_readline' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='135744'>
        <var-decl name='_reducer_override' type-id='type-id-309' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136320'>
        <var-decl name='_reload' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136768'>
        <var-decl name='_replace' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='137216'>
        <var-decl name='_reset' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='137664'>
        <var-decl name='_return' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='138112'>
        <var-decl name='_reversed' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='138624'>
        <var-decl name='_seek' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139072'>
        <var-decl name='_seekable' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='139584'>
        <var-decl name='_send' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140032'>
        <var-decl name='_setcomp' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140480'>
        <var-decl name='_setstate' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140992'>
        <var-decl name='_sort' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='141440'>
        <var-decl name='_stderr' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='141888'>
        <var-decl name='_stdin' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='142336'>
        <var-decl name='_stdout' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='142784'>
        <var-decl name='_strict' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='143232'>
        <var-decl name='_symmetric_difference_update' type-id='type-id-316' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='143872'>
        <var-decl name='_tell' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144320'>
        <var-decl name='_text' type-id='type-id-301' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144768'>
        <var-decl name='_threading' type-id='type-id-270' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='145280'>
        <var-decl name='_throw' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='145728'>
        <var-decl name='_top' type-id='type-id-315' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='146176'>
        <var-decl name='_truncate' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='146688'>
        <var-decl name='_unraisablehook' type-id='type-id-302' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='147200'>
        <var-decl name='_values' type-id='type-id-308' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='147648'>
        <var-decl name='_version' type-id='type-id-299' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='148096'>
        <var-decl name='_warnings' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='148608'>
        <var-decl name='_warnoptions' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='149120'>
        <var-decl name='_writable' type-id='type-id-271' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='149632'>
        <var-decl name='_write' type-id='type-id-276' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150080'>
        <var-decl name='_zipimporter' type-id='type-id-307' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='358' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='56' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-317' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='56' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='64' id='type-id-317'>
      <subrange length='8' type-id='type-id-16' id='type-id-318'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='57' column='1' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-319' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='57' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='112' id='type-id-319'>
      <subrange length='14' type-id='type-id-16' id='type-id-320'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='58' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-321' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='58' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='40' id='type-id-321'>
      <subrange length='5' type-id='type-id-16' id='type-id-322'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='59' column='1' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-323' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='59' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='120' id='type-id-323'>
      <subrange length='15' type-id='type-id-16' id='type-id-324'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='61' column='1' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-325' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='61' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='128' id='type-id-325'>
      <subrange length='16' type-id='type-id-16' id='type-id-326'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='64' column='1' id='type-id-304'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-327' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='64' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='160' id='type-id-327'>
      <subrange length='20' type-id='type-id-16' id='type-id-328'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='78' column='1' id='type-id-305'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-329' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='78' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='104' id='type-id-329'>
      <subrange length='13' type-id='type-id-16' id='type-id-330'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='83' column='1' id='type-id-306'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-331' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='83' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='144' id='type-id-331'>
      <subrange length='18' type-id='type-id-16' id='type-id-332'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='85' column='1' id='type-id-307'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-333' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='85' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='96' id='type-id-333'>
      <subrange length='12' type-id='type-id-16' id='type-id-334'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='97' column='1' id='type-id-308'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-335' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='97' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='56' id='type-id-335'>
      <subrange length='7' type-id='type-id-16' id='type-id-336'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='107' column='1' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-337' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='107' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='136' id='type-id-337'>
      <subrange length='17' type-id='type-id-16' id='type-id-338'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='132' column='1' id='type-id-310'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='132' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='168' id='type-id-339'>
      <subrange length='21' type-id='type-id-16' id='type-id-340'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='204' column='1' id='type-id-311'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-341' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='204' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='288' id='type-id-341'>
      <subrange length='36' type-id='type-id-16' id='type-id-342'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='205' column='1' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-343' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='205' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='200' id='type-id-343'>
      <subrange length='25' type-id='type-id-16' id='type-id-344'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='207' column='1' id='type-id-313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='207' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='248' id='type-id-345'>
      <subrange length='31' type-id='type-id-16' id='type-id-346'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='228' column='1' id='type-id-314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-347' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='228' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='208' id='type-id-347'>
      <subrange length='26' type-id='type-id-16' id='type-id-348'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='231' column='1' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-349' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='231' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='32' id='type-id-349'>
      <subrange length='4' type-id='type-id-16' id='type-id-350'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='344' column='1' id='type-id-316'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ascii' type-id='type-id-277' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_data' type-id='type-id-351' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='344' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-285' size-in-bits='224' id='type-id-351'>
      <subrange length='28' type-id='type-id-16' id='type-id-352'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-272' size-in-bits='57344' id='type-id-267'>
      <subrange length='128' type-id='type-id-16' id='type-id-353'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='364' column='1' id='type-id-354'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_latin1' type-id='type-id-355' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_data' type-id='type-id-291' visibility='default' filepath='./Include/internal/pycore_global_strings.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-355' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='211' column='1' id='type-id-356'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_base' type-id='type-id-277' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='utf8_length' type-id='type-id-36' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='utf8' type-id='type-id-115' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='wstr_length' type-id='type-id-36' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyCompactUnicodeObject' type-id='type-id-356' filepath='./Include/cpython/unicodeobject.h' line='218' column='1' id='type-id-355'/>

    <array-type-def dimensions='1' type-id='type-id-354' size-in-bits='81920' id='type-id-268'>
      <subrange length='128' type-id='type-id-16' id='type-id-353'/>

    </array-type-def>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-251' visibility='default' filepath='./Include/internal/pycore_gc.h' line='12' column='1' id='type-id-357'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_gc_next' type-id='type-id-358' visibility='default' filepath='./Include/internal/pycore_gc.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_gc_prev' type-id='type-id-358' visibility='default' filepath='./Include/internal/pycore_gc.h' line='19' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-16' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-358'/>
    <typedef-decl name='PyGC_Head' type-id='type-id-357' filepath='./Include/internal/pycore_gc.h' line='20' column='1' id='type-id-251'/>
    <class-decl name='__anonymous_struct__' size-in-bits='256' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-252' visibility='default' filepath='./Include/cpython/tupleobject.h' line='5' column='1' id='type-id-359'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/tupleobject.h' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_item' type-id='type-id-360' visibility='default' filepath='./Include/cpython/tupleobject.h' line='10' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='64' id='type-id-360'>
      <subrange length='1' type-id='type-id-16' id='type-id-258'/>

    </array-type-def>
    <typedef-decl name='PyTupleObject' type-id='type-id-359' filepath='./Include/cpython/tupleobject.h' line='11' column='1' id='type-id-252'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-28'/>
    <type-decl name='bool' size-in-bits='8' id='type-id-31'/>
    <class-decl name='_ceval_state' size-in-bits='4416' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='46' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='recursion_limit' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eval_breaker' type-id='type-id-213' visibility='default' filepath='./Include/internal/pycore_interp.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gil_drop_request' type-id='type-id-213' visibility='default' filepath='./Include/internal/pycore_interp.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending' type-id='type-id-361' visibility='default' filepath='./Include/internal/pycore_interp.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_pending_calls' size-in-bits='4288' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='29' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-30' visibility='default' filepath='./Include/internal/pycore_interp.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='calls_to_do' type-id='type-id-213' visibility='default' filepath='./Include/internal/pycore_interp.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='async_exc' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='calls' type-id='type-id-362' visibility='default' filepath='./Include/internal/pycore_interp.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='first' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='last' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='38' column='1' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-364' visibility='default' filepath='./Include/internal/pycore_interp.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-18' visibility='default' filepath='./Include/internal/pycore_interp.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-364'/>

    <array-type-def dimensions='1' type-id='type-id-363' size-in-bits='4096' id='type-id-362'>
      <subrange length='32' type-id='type-id-16' id='type-id-212'/>

    </array-type-def>
    <class-decl name='_gc_runtime_state' size-in-bits='1920' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_gc.h' line='131' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trash_delete_later' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_gc.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='trash_delete_nesting' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_gc.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='enabled' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_gc.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='debug' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_gc.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='generations' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_gc.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='generation0' type-id='type-id-367' visibility='default' filepath='./Include/internal/pycore_gc.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='permanent_generation' type-id='type-id-368' visibility='default' filepath='./Include/internal/pycore_gc.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='generation_stats' type-id='type-id-369' visibility='default' filepath='./Include/internal/pycore_gc.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='collecting' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_gc.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='garbage' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_gc.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='callbacks' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_gc.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='long_lived_total' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_gc.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='long_lived_pending' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_gc.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gc_generation' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_gc.h' line='114' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-251' visibility='default' filepath='./Include/internal/pycore_gc.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='threshold' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_gc.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='count' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_gc.h' line='117' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-368' size-in-bits='576' id='type-id-366'>
      <subrange length='3' type-id='type-id-16' id='type-id-293'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-367'/>
    <class-decl name='gc_generation_stats' size-in-bits='192' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_gc.h' line='122' column='1' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='collections' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_gc.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='collected' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_gc.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uncollectable' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_gc.h' line='128' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-370' size-in-bits='576' id='type-id-369'>
      <subrange length='3' type-id='type-id-16' id='type-id-293'/>

    </array-type-def>
    <class-decl name='PyConfig' size-in-bits='3392' is-struct='yes' visibility='default' filepath='./Include/cpython/initconfig.h' line='134' column='1' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isolated' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_environment' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dev_mode' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='install_signal_handlers' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_hash_seed' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_seed' type-id='type-id-16' visibility='default' filepath='./Include/cpython/initconfig.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='faulthandler' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tracemalloc' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='import_time' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='code_debug_ranges' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_ref_count' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='dump_refs' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dump_refs_file' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='malloc_stats' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='filesystem_encoding' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='filesystem_errors' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pycache_prefix' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='parse_argv' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='orig_argv' type-id='type-id-372' visibility='default' filepath='./Include/cpython/initconfig.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='argv' type-id='type-id-372' visibility='default' filepath='./Include/cpython/initconfig.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='xoptions' type-id='type-id-372' visibility='default' filepath='./Include/cpython/initconfig.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='warnoptions' type-id='type-id-372' visibility='default' filepath='./Include/cpython/initconfig.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='site_import' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='bytes_warning' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='warn_default_encoding' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='inspect' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='interactive' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='optimization_level' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='parser_debug' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='write_bytecode' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='verbose' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='quiet' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='user_site_directory' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='configure_c_stdio' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='buffered_stdio' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='stdio_encoding' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='stdio_errors' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='check_hash_pycs_mode' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='use_frozen_modules' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='safe_path' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='pathconfig_warnings' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='program_name' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='pythonpath_env' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='home' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='platlibdir' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='module_search_paths_set' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='module_search_paths' type-id='type-id-372' visibility='default' filepath='./Include/cpython/initconfig.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='stdlib_dir' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='executable' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='base_executable' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='prefix' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='base_prefix' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='exec_prefix' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='base_exec_prefix' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='skip_source_first_line' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='run_command' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='run_module' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='run_filename' type-id='type-id-281' visibility='default' filepath='./Include/cpython/initconfig.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='_install_importlib' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3296'>
        <var-decl name='_init_main' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='_isolated_interpreter' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3360'>
        <var-decl name='_is_python_build' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='219' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-372' visibility='default' filepath='./Include/cpython/initconfig.h' line='31' column='1' id='type-id-373'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-36' visibility='default' filepath='./Include/cpython/initconfig.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='items' type-id='type-id-374' visibility='default' filepath='./Include/cpython/initconfig.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-374'/>
    <typedef-decl name='PyWideStringList' type-id='type-id-373' filepath='./Include/cpython/initconfig.h' line='36' column='1' id='type-id-372'/>
    <typedef-decl name='PyConfig' type-id='type-id-371' filepath='./Include/cpython/initconfig.h' line='220' column='1' id='type-id-34'/>
    <class-decl name='_PyInterpreterFrame' size-in-bits='640' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-375'/>
    <pointer-type-def type-id='type-id-375' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-378'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-378' filepath='./Include/cpython/pystate.h' line='264' column='1' id='type-id-35'/>

    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='16320' id='type-id-37'>
      <subrange length='255' type-id='type-id-16' id='type-id-379'/>

    </array-type-def>
    <class-decl name='_warnings_runtime_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='11' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='filters' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='once_registry' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='default_action' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='filters_version' type-id='type-id-53' visibility='default' filepath='./Include/internal/pycore_warnings.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='atexit_state' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_interp.h' line='64' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='callbacks' type-id='type-id-380' visibility='default' filepath='./Include/internal/pycore_interp.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncallbacks' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='callback_len' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_interp.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-381' visibility='default' filepath='./Include/internal/pycore_interp.h' line='58' column='1' id='type-id-382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='args' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='kwargs' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_interp.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='atexit_callback' type-id='type-id-382' filepath='./Include/internal/pycore_interp.h' line='62' column='1' id='type-id-381'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-380'/>
    <class-decl name='_Py_unicode_state' size-in-bits='384' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='49' column='1' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fs_codec' type-id='type-id-384' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ids' type-id='type-id-385' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_unicode_fs_codec' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='37' column='1' id='type-id-384'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-115' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='utf8' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='errors' type-id='type-id-115' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='error_handler' type-id='type-id-386' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='./Include/internal/pycore_fileutils.h' line='13' column='1' id='type-id-387'>
      <underlying-type type-id='type-id-126'/>
      <enumerator name='_Py_ERROR_UNKNOWN' value='0'/>
      <enumerator name='_Py_ERROR_STRICT' value='1'/>
      <enumerator name='_Py_ERROR_SURROGATEESCAPE' value='2'/>
      <enumerator name='_Py_ERROR_REPLACE' value='3'/>
      <enumerator name='_Py_ERROR_IGNORE' value='4'/>
      <enumerator name='_Py_ERROR_BACKSLASHREPLACE' value='5'/>
      <enumerator name='_Py_ERROR_SURROGATEPASS' value='6'/>
      <enumerator name='_Py_ERROR_XMLCHARREFREPLACE' value='7'/>
      <enumerator name='_Py_ERROR_OTHER' value='8'/>
    </enum-decl>
    <typedef-decl name='_Py_error_handler' type-id='type-id-387' filepath='./Include/internal/pycore_fileutils.h' line='23' column='1' id='type-id-386'/>
    <class-decl name='_Py_unicode_ids' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='44' column='1' id='type-id-385'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='array' type-id='type-id-22' visibility='default' filepath='./Include/internal/pycore_unicodeobject.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_float_state' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_floatobject.h' line='31' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_floatobject.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free_list' type-id='type-id-388' visibility='default' filepath='./Include/internal/pycore_floatobject.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-389' visibility='default' filepath='./Include/cpython/floatobject.h' line='5' column='1' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/cpython/floatobject.h' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_fval' type-id='type-id-391' visibility='default' filepath='./Include/cpython/floatobject.h' line='7' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='double' size-in-bits='64' id='type-id-391'/>
    <typedef-decl name='PyFloatObject' type-id='type-id-390' filepath='./Include/cpython/floatobject.h' line='8' column='1' id='type-id-389'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-388'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-392' visibility='default' filepath='./Include/sliceobject.h' line='22' column='1' id='type-id-393'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/sliceobject.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start' type-id='type-id-14' visibility='default' filepath='./Include/sliceobject.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stop' type-id='type-id-14' visibility='default' filepath='./Include/sliceobject.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='step' type-id='type-id-14' visibility='default' filepath='./Include/sliceobject.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PySliceObject' type-id='type-id-393' filepath='./Include/sliceobject.h' line='25' column='1' id='type-id-392'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-42'/>
    <class-decl name='_Py_tuple_state' size-in-bits='1920' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_tuple.h' line='48' column='1' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_list' type-id='type-id-394' visibility='default' filepath='./Include/internal/pycore_tuple.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='numfree' type-id='type-id-395' visibility='default' filepath='./Include/internal/pycore_tuple.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-396'/>

    <array-type-def dimensions='1' type-id='type-id-396' size-in-bits='1280' id='type-id-394'>
      <subrange length='20' type-id='type-id-16' id='type-id-328'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='640' id='type-id-395'>
      <subrange length='20' type-id='type-id-16' id='type-id-328'/>

    </array-type-def>
    <class-decl name='_Py_list_state' size-in-bits='5184' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_list.h' line='31' column='1' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_list' type-id='type-id-397' visibility='default' filepath='./Include/internal/pycore_list.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_list.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-398' visibility='default' filepath='./Include/cpython/listobject.h' line='5' column='1' id='type-id-399'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/listobject.h' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_item' type-id='type-id-22' visibility='default' filepath='./Include/cpython/listobject.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='allocated' type-id='type-id-36' visibility='default' filepath='./Include/cpython/listobject.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyListObject' type-id='type-id-399' filepath='./Include/cpython/listobject.h' line='22' column='1' id='type-id-398'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-400'/>

    <array-type-def dimensions='1' type-id='type-id-400' size-in-bits='5120' id='type-id-397'>
      <subrange length='80' type-id='type-id-16' id='type-id-401'/>

    </array-type-def>
    <class-decl name='_Py_dict_state' size-in-bits='10368' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_dict.h' line='29' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='free_list' type-id='type-id-402' visibility='default' filepath='./Include/internal/pycore_dict.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_dict.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='keys_free_list' type-id='type-id-403' visibility='default' filepath='./Include/internal/pycore_dict.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='keys_numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_dict.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='384' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-404' visibility='default' filepath='./Include/cpython/dictobject.h' line='11' column='1' id='type-id-405'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/cpython/dictobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ma_used' type-id='type-id-36' visibility='default' filepath='./Include/cpython/dictobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ma_version_tag' type-id='type-id-19' visibility='default' filepath='./Include/cpython/dictobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ma_keys' type-id='type-id-406' visibility='default' filepath='./Include/cpython/dictobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ma_values' type-id='type-id-407' visibility='default' filepath='./Include/cpython/dictobject.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_dictkeysobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_dict.h' line='87' column='1' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dk_refcnt' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_dict.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dk_log2_size' type-id='type-id-285' visibility='default' filepath='./Include/internal/pycore_dict.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='dk_log2_index_bytes' type-id='type-id-285' visibility='default' filepath='./Include/internal/pycore_dict.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='dk_kind' type-id='type-id-285' visibility='default' filepath='./Include/internal/pycore_dict.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dk_version' type-id='type-id-256' visibility='default' filepath='./Include/internal/pycore_dict.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dk_usable' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_dict.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dk_nentries' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_dict.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dk_indices' type-id='type-id-409' visibility='default' filepath='./Include/internal/pycore_dict.h' line='121' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='infinite' id='type-id-409'>
      <subrange length='infinite' type-id='type-id-16' id='type-id-6'/>

    </array-type-def>
    <typedef-decl name='PyDictKeysObject' type-id='type-id-408' filepath='./Include/cpython/dictobject.h' line='5' column='1' id='type-id-410'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' id='type-id-406'/>
    <class-decl name='_dictvalues' size-in-bits='64' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_dict.h' line='137' column='1' id='type-id-411'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='values' type-id='type-id-360' visibility='default' filepath='./Include/internal/pycore_dict.h' line='138' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyDictValues' type-id='type-id-411' filepath='./Include/cpython/dictobject.h' line='6' column='1' id='type-id-412'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-407'/>
    <typedef-decl name='PyDictObject' type-id='type-id-405' filepath='./Include/cpython/dictobject.h' line='29' column='1' id='type-id-404'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' id='type-id-413'/>

    <array-type-def dimensions='1' type-id='type-id-413' size-in-bits='5120' id='type-id-402'>
      <subrange length='80' type-id='type-id-16' id='type-id-401'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-406' size-in-bits='5120' id='type-id-403'>
      <subrange length='80' type-id='type-id-16' id='type-id-401'/>

    </array-type-def>
    <class-decl name='_Py_async_gen_state' size-in-bits='10368' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_genobject.h' line='31' column='1' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_freelist' type-id='type-id-414' visibility='default' filepath='./Include/internal/pycore_genobject.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='value_numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_genobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='asend_freelist' type-id='type-id-415' visibility='default' filepath='./Include/internal/pycore_genobject.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10304'>
        <var-decl name='asend_numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_genobject.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_PyAsyncGenWrappedValue' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-416'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-417'/>

    <array-type-def dimensions='1' type-id='type-id-417' size-in-bits='5120' id='type-id-414'>
      <subrange length='80' type-id='type-id-16' id='type-id-401'/>

    </array-type-def>
    <class-decl name='PyAsyncGenASend' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-418'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' id='type-id-419'/>

    <array-type-def dimensions='1' type-id='type-id-419' size-in-bits='5120' id='type-id-415'>
      <subrange length='80' type-id='type-id-16' id='type-id-401'/>

    </array-type-def>
    <class-decl name='_Py_context_state' size-in-bits='128' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_context.h' line='30' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='freelist' type-id='type-id-420' visibility='default' filepath='./Include/internal/pycore_context.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_context.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_pycontextobject' size-in-bits='384' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_context.h' line='38' column='1' id='type-id-421'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/internal/pycore_context.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctx_prev' type-id='type-id-420' visibility='default' filepath='./Include/internal/pycore_context.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctx_vars' type-id='type-id-422' visibility='default' filepath='./Include/internal/pycore_context.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctx_weakreflist' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_context.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ctx_entered' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_context.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyContext' type-id='type-id-421' filepath='./Include/cpython/context.h' line='9' column='1' id='type-id-423'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-420'/>
    <class-decl name='__anonymous_struct__' size-in-bits='320' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-424' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='48' column='1' id='type-id-425'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='h_root' type-id='type-id-426' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='h_weakreflist' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='h_count' type-id='type-id-36' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-427' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='42' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/internal/pycore_hamt.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyHamtNode' type-id='type-id-428' filepath='./Include/internal/pycore_hamt.h' line='44' column='1' id='type-id-427'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' id='type-id-426'/>
    <typedef-decl name='PyHamtObject' type-id='type-id-425' filepath='./Include/internal/pycore_hamt.h' line='53' column='1' id='type-id-424'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-422'/>
    <class-decl name='_Py_exc_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_exceptions.h' line='22' column='1' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='errnomap' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_exceptions.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memerrors_freelist' type-id='type-id-429' visibility='default' filepath='./Include/internal/pycore_exceptions.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memerrors_numfree' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_exceptions.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='PyExc_ExceptionGroup' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_exceptions.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='576' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-430' visibility='default' filepath='./Include/cpython/pyerrors.h' line='13' column='1' id='type-id-431'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-108' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dict' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='args' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='notes' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='traceback' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='context' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cause' type-id='type-id-14' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suppress_context' type-id='type-id-1' visibility='default' filepath='./Include/cpython/pyerrors.h' line='14' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyBaseExceptionObject' type-id='type-id-431' filepath='./Include/cpython/pyerrors.h' line='15' column='1' id='type-id-430'/>
    <pointer-type-def type-id='type-id-430' size-in-bits='64' id='type-id-429'/>
    <class-decl name='ast_state' size-in-bits='15168' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='13' column='1' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='recursion_depth' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='recursion_limit' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='AST_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='Add_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='Add_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='And_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='And_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='AnnAssign_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='Assert_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='Assign_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='AsyncFor_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='AsyncFunctionDef_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='AsyncWith_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='Attribute_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='AugAssign_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='Await_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='BinOp_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='BitAnd_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='BitAnd_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='BitOr_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='BitOr_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='BitXor_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='BitXor_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='BoolOp_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='Break_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='Call_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='ClassDef_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='Compare_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='Constant_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='Continue_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='Del_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='Del_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='Delete_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='DictComp_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='Dict_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='Div_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='Div_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='Eq_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='Eq_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='ExceptHandler_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='Expr_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='Expression_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='FloorDiv_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='FloorDiv_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='For_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='FormattedValue_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='FunctionDef_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='FunctionType_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='GeneratorExp_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='Global_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='GtE_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='GtE_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='Gt_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='Gt_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='IfExp_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='If_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='ImportFrom_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='Import_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='In_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='In_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='Interactive_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='Invert_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='Invert_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='IsNot_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='IsNot_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='Is_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='Is_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='JoinedStr_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='LShift_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='LShift_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='Lambda_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='ListComp_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='List_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='Load_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='Load_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='LtE_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='LtE_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='Lt_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='Lt_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='MatMult_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='MatMult_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='MatchAs_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='MatchClass_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='MatchMapping_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='MatchOr_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='MatchSequence_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='MatchSingleton_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='MatchStar_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='MatchValue_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='Match_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='Mod_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='Mod_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='Module_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='Mult_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='Mult_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='Name_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='NamedExpr_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='Nonlocal_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='NotEq_singleton' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='NotEq_type' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_ast_state.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
