<abi-corpus version='2.4' path='libpython3.14.so' soname='libpython3.14.so.1.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAIter_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_Parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_UnpackTuple' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_VaParseTupleAndKeywords' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArg_ValidateKeywordArguments' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAsyncGen_New' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='wcschr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscoll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcslen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcstok' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcstombs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsxfrm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wmemchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wmemcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdin' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='./Modules/_abc.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='_Py_FalseStruct' type-id='type-id-1' visibility='default' filepath='./Include/boolobject.h' line='17' column='1'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-1' visibility='default' filepath='./Include/boolobject.h' line='18' column='1'/>
    <var-decl name='_PyRuntime' type-id='type-id-2' visibility='default' filepath='./Include/internal/pycore_runtime.h' line='19' column='1'/>
    <var-decl name='PyLong_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='279' column='1'/>
    <var-decl name='_Py_NoneStruct' type-id='type-id-4' visibility='default' filepath='./Include/object.h' line='645' column='1'/>
    <var-decl name='_Py_NotImplementedStruct' type-id='type-id-4' visibility='default' filepath='./Include/object.h' line='664' column='1'/>
    <var-decl name='PyExc_AssertionError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='87' column='1'/>
    <var-decl name='PyExc_RuntimeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='103' column='1'/>
    <var-decl name='PyExc_TypeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='114' column='1'/>
    <function-decl name='PyInit__abc' mangled-name='PyInit__abc' filepath='./Modules/_abc.c' line='994' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__abc' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='8759147de6871040' id='type-id-6'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='fe9af27801a63d1d' id='type-id-7'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='2e839175b6f0d64e' id='type-id-10'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='9b79932cbc51c9a6' id='type-id-11'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='037d575bc520db4e' id='type-id-13'>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='21e5a2f6e2b75eff' id='type-id-14'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='c4e1b837fccfe2d0' id='type-id-16'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='63c03439f3e9ae1a' id='type-id-17'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='037d575bc520db4e' id='type-id-18'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-20'>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-21'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_codecsmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='Py_hexdigits' type-id='type-id-23' visibility='default' filepath='./Include/codecs.h' line='170' column='1'/>
    <var-decl name='PyExc_OverflowError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='102' column='1'/>
    <var-decl name='PyExc_ValueError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='120' column='1'/>
    <var-decl name='PyTuple_Type' type-id='type-id-3' visibility='default' filepath='./Include/tupleobject.h' line='23' column='1'/>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='./Modules/_codecsmodule.c' line='1096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' hash='c7b354fc0c814775' id='type-id-24'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_collectionsmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='PyODict_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/odictobject.h' line='15' column='1'/>
    <var-decl name='PyDict_Type' type-id='type-id-3' visibility='default' filepath='./Include/dictobject.h' line='15' column='1'/>
    <var-decl name='_Py_tss_tstate' type-id='type-id-26' visibility='default' filepath='./Include/internal/pycore_pystate.h' line='92' column='1'/>
    <var-decl name='PyExc_StopIteration' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='82' column='1'/>
    <var-decl name='PyExc_AttributeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='88' column='1'/>
    <var-decl name='PyExc_IndexError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='97' column='1'/>
    <var-decl name='PyExc_KeyError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='98' column='1'/>
    <var-decl name='PyUnicode_Type' type-id='type-id-3' visibility='default' filepath='./Include/unicodeobject.h' line='103' column='1'/>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='./Modules/_collectionsmodule.c' line='2874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='8119002290a1399f' id='type-id-27'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='616dbb5e7e171881' id='type-id-29'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-30'/>
    </function-type>
    <function-type size-in-bits='64' hash='616dbb5e7e171881' id='type-id-31'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-32'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_functoolsmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <var-decl name='PyBaseObject_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='428' column='1'/>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='./Modules/_functoolsmodule.c' line='1916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' hash='a8fa4819a02c2400' id='type-id-34'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='7736598d5f603cb3' id='type-id-35'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='8759147de6871040' id='type-id-36'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='7fe8cff47581c705' id='type-id-37'>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='c4e1b837fccfe2d0' id='type-id-38'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/_iomodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='PyType_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='427' column='1'/>
    <var-decl name='PyExc_OSError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='92' column='1'/>
    <var-decl name='PyExc_BlockingIOError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='124' column='1'/>
    <var-decl name='PyExc_RuntimeWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='155' column='1'/>
    <var-decl name='PyExc_EncodingWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='160' column='1'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='./Modules/_io/_iomodule.c' line='742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='bufferediobase_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='12' column='1'/>
    <var-decl name='bufferedrandom_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='13' column='1'/>
    <var-decl name='bufferedreader_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='14' column='1'/>
    <var-decl name='bufferedrwpair_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='15' column='1'/>
    <var-decl name='bufferedwriter_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='16' column='1'/>
    <var-decl name='bytesio_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='17' column='1'/>
    <var-decl name='bytesiobuf_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='18' column='1'/>
    <var-decl name='fileio_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='19' column='1'/>
    <var-decl name='iobase_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='20' column='1'/>
    <var-decl name='nldecoder_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='21' column='1'/>
    <var-decl name='rawiobase_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='22' column='1'/>
    <var-decl name='stringio_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='23' column='1'/>
    <var-decl name='textiobase_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='24' column='1'/>
    <var-decl name='textiowrapper_spec' type-id='type-id-39' visibility='default' filepath='./Modules/_io/_iomodule.h' line='25' column='1'/>
    <var-decl name='_PyIO_Module' type-id='type-id-40' visibility='default' filepath='./Modules/_io/_iomodule.h' line='143' column='1'/>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-41'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bufferedio.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <typedef-decl name='Py_off_t' type-id='type-id-42' size-in-bits='64' filepath='./Modules/_io/_iomodule.h' line='109' column='1' hash='b119fe0931d2ee10' id='type-id-43'/>
    <typedef-decl name='off_t' type-id='type-id-44' size-in-bits='64' filepath='/usr/include/sys/types.h' line='87' column='1' hash='b119fe0931d2ee10' id='type-id-42'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-22' filepath='./Include/pythread.h' line='4' column='1' id='type-id-45'/>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='memchr' filepath='/usr/include/string.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memchr' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' hash='21e5a2f6e2b75eff' id='type-id-47'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-48'>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bytesio.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <var-decl name='PyBytes_Type' type-id='type-id-3' visibility='default' filepath='./Include/bytesobject.h' line='24' column='1'/>
    <var-decl name='PyExc_BufferError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='89' column='1'/>
    <var-decl name='PyExc_SystemError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='112' column='1'/>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-22'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/fileio.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='PyBool_Type' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='280' column='1'/>
    <var-decl name='PyExc_Warning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='150' column='1'/>
    <var-decl name='_Py_open_cloexec_works' type-id='type-id-15' visibility='default' filepath='./Modules/_io/fileio.c' line='218' column='1'/>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64' hash='1d81aff51c388187'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64' hash='e90b592389225111'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='isatty' filepath='/usr/include/unistd.h' line='809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isatty' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ftruncate' mangled-name='ftruncate64' filepath='/usr/include/unistd.h' line='1052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftruncate64' hash='d0e3d68beb2b6d4f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/iobase.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <class-decl name='_io_state' is-struct='yes' visibility='default' size-in-bits='1024' filepath='./Modules/_io/_iomodule.h' line='145' column='1' hash='b60f8c5a51238fb9' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-15' visibility='default' filepath='./Modules/_io/_iomodule.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unsupported_operation' type-id='type-id-5' visibility='default' filepath='./Modules/_io/_iomodule.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='PyIOBase_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='PyRawIOBase_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='PyBufferedIOBase_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='PyBufferedRWPair_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='PyBufferedRandom_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='PyBufferedReader_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='PyBufferedWriter_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='PyBytesIOBuffer_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='PyBytesIO_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='PyFileIO_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='PyStringIO_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='PyTextIOBase_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='PyTextIOWrapper_Type' type-id='type-id-28' visibility='default' filepath='./Modules/_io/_iomodule.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyIO_State' type-id='type-id-49' size-in-bits='1024' filepath='./Modules/_io/_iomodule.h' line='35' column='1' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' hash='0f723dac149497a2' id='type-id-51'/>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-52' visibility='default' filepath='./Include/cpython/bytearrayobject.h' line='14' column='1'/>
    <var-decl name='PyExc_NotImplementedError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='107' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/stringio.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-54'/>
    <class-decl name='PyUnicodeWriter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-55'/>
    <typedef-decl name='PyUnicodeWriter' type-id='type-id-55' filepath='./Include/cpython/unicodeobject.h' line='468' column='1' id='type-id-53'/>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-56'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/textio.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='PyList_Type' type-id='type-id-3' visibility='default' filepath='./Include/listobject.h' line='20' column='1'/>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_localemodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='./Modules/_localemodule.c' line='1014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nl_langinfo' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dcgettext' hash='f0cb0c0d760b1174'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='textdomain' filepath='/usr/include/libintl.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='textdomain' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='bindtextdomain' filepath='/usr/include/libintl.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bindtextdomain' hash='21babdbcb7a34ebe'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='bind_textdomain_codeset' filepath='/usr/include/libintl.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bind_textdomain_codeset' hash='21babdbcb7a34ebe'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='setlocale' filepath='/usr/include/locale.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setlocale' hash='63f13efed1e26e48'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='localeconv' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='localeconv' hash='f396762dd02ed27b'>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscoll' hash='8d011970848592f8'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsxfrm' hash='be3bd198fe033ce3'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='wcslen' filepath='/usr/include/wchar.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcslen' hash='3df1bfc94027e171'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_opcode.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='PyCode_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/code.h' line='162' column='1'/>
    <var-decl name='_Py_SpecialMethods' type-id='type-id-62' visibility='default' filepath='./Include/internal/pycore_ceval.h' line='261' column='1'/>
    <var-decl name='_PyOpcode_opcode_metadata' type-id='type-id-63' visibility='default' filepath='./Include/internal/pycore_opcode_metadata.h' line='1078' column='1'/>
    <function-decl name='PyInit__opcode' mangled-name='PyInit__opcode' filepath='./Modules/_opcode.c' line='449' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__opcode' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_operator.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='./Modules/_operator.c' line='2029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_sre/sre.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <qualified-type-def type-id='type-id-64' const='yes' hash='3aaf0f2479f2834c' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' hash='96e1bfcb27b9d6ed' id='type-id-66'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' hash='dd656235ffa53591' id='type-id-67'/>
    <qualified-type-def type-id='type-id-68' const='yes' hash='8f60dd2f0b8834b6#3' id='type-id-69'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='7da4750c0c4a7ea5' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' hash='fd89690d624a6590' id='type-id-71'/>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <var-decl name='_Py_ctype_table' type-id='type-id-72' visibility='default' filepath='./Include/cpython/pyctype.h' line='16' column='1'/>
    <var-decl name='_Py_ctype_tolower' type-id='type-id-73' visibility='default' filepath='./Include/cpython/pyctype.h' line='29' column='1'/>
    <var-decl name='_Py_ascii_whitespace' type-id='type-id-74' visibility='default' filepath='./Include/cpython/unicodeobject.h' line='724' column='1'/>
    <var-decl name='PyExc_RecursionError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='105' column='1'/>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='./Modules/_sre/sre.c' line='3447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc' hash='2d54aef0745cb1f9'>
      <return type-id='type-id-71'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_tolower_loc' hash='3fcff62f9c828526'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='__ctype_toupper_loc' filepath='/usr/include/ctype.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_toupper_loc' hash='3fcff62f9c828526'>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-type size-in-bits='64' hash='b1dcd91100b153bb' id='type-id-75'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-30'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_stat.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <class-decl name='_typeobject' is-struct='yes' visibility='default' size-in-bits='3328' filepath='./Include/cpython/object.h' line='148' column='1' hash='09a7720a56dea2df' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/object.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-23' visibility='default' filepath='./Include/cpython/object.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-12' visibility='default' filepath='./Include/cpython/object.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-12' visibility='default' filepath='./Include/cpython/object.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_vectorcall_offset' type-id='type-id-12' visibility='default' filepath='./Include/cpython/object.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-79' visibility='default' filepath='./Include/cpython/object.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-80' visibility='default' filepath='./Include/cpython/object.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-81' visibility='default' filepath='./Include/cpython/object.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-83' visibility='default' filepath='./Include/cpython/object.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-84' visibility='default' filepath='./Include/cpython/object.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-85' visibility='default' filepath='./Include/cpython/object.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-86' visibility='default' filepath='./Include/cpython/object.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-87' visibility='default' filepath='./Include/cpython/object.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-82' visibility='default' filepath='./Include/cpython/object.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-88' visibility='default' filepath='./Include/cpython/object.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-89' visibility='default' filepath='./Include/cpython/object.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-90' visibility='default' filepath='./Include/cpython/object.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-33' visibility='default' filepath='./Include/cpython/object.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-23' visibility='default' filepath='./Include/cpython/object.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-91' visibility='default' filepath='./Include/cpython/object.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-93' visibility='default' filepath='./Include/cpython/object.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-12' visibility='default' filepath='./Include/cpython/object.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-94' visibility='default' filepath='./Include/cpython/object.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-95' visibility='default' filepath='./Include/cpython/object.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-96' visibility='default' filepath='./Include/cpython/object.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-97' visibility='default' filepath='./Include/cpython/object.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-98' visibility='default' filepath='./Include/cpython/object.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-28' visibility='default' filepath='./Include/cpython/object.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-5' visibility='default' filepath='./Include/cpython/object.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-99' visibility='default' filepath='./Include/cpython/object.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-100' visibility='default' filepath='./Include/cpython/object.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-12' visibility='default' filepath='./Include/cpython/object.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-101' visibility='default' filepath='./Include/cpython/object.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-102' visibility='default' filepath='./Include/cpython/object.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-103' visibility='default' filepath='./Include/cpython/object.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-104' visibility='default' filepath='./Include/cpython/object.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-92' visibility='default' filepath='./Include/cpython/object.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-5' visibility='default' filepath='./Include/cpython/object.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-5' visibility='default' filepath='./Include/cpython/object.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-5' visibility='default' filepath='./Include/cpython/object.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-22' visibility='default' filepath='./Include/cpython/object.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-5' visibility='default' filepath='./Include/cpython/object.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-105' visibility='default' filepath='./Include/cpython/object.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-78' visibility='default' filepath='./Include/cpython/object.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='tp_vectorcall' type-id='type-id-106' visibility='default' filepath='./Include/cpython/object.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='tp_watched' type-id='type-id-107' visibility='default' filepath='./Include/cpython/object.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3280'>
        <var-decl name='tp_versions_used' type-id='type-id-108' visibility='default' filepath='./Include/cpython/object.h' line='241' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='./Modules/_stat.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_suggestions.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit__suggestions' mangled-name='PyInit__suggestions' filepath='./Modules/_suggestions.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__suggestions' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_sysconfig.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit__sysconfig' mangled-name='PyInit__sysconfig' filepath='./Modules/_sysconfig.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sysconfig' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_threadmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwrite' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <var-decl name='PyExc_PythonFinalizationError' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pyerrors.h' line='130' column='1'/>
    <var-decl name='PY_TIMEOUT_MAX' type-id='type-id-109' visibility='default' filepath='./Include/cpython/pythread.h' line='11' column='1'/>
    <var-decl name='PyExc_SystemExit' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='113' column='1'/>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='./Modules/_threadmodule.c' line='2797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='floor' filepath='/usr/include/bits/mathcalls.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floor' hash='fc29fb400cf17181'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-110'/>
    </function-decl>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_self' hash='e0055d99adb0e173'>
      <return type-id='type-id-111'/>
    </function-decl>
    <function-decl name='pthread_getname_np' filepath='/usr/include/pthread.h' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_getname_np' hash='aa14619222a1f740'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pthread_setname_np' filepath='/usr/include/pthread.h' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_setname_np' hash='060631f163ac4382'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <var-decl name='stderr' type-id='type-id-112' visibility='default' filepath='/usr/include/stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-113'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_tracemalloc.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='./Modules/_tracemalloc.c' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_typesmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='PyCell_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/cellobject.h' line='16' column='1'/>
    <var-decl name='PyMethod_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/classobject.h' line='20' column='1'/>
    <var-decl name='PyFunction_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/funcobject.h' line='66' column='1'/>
    <var-decl name='PyGen_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/genobject.h' line='14' column='1'/>
    <var-decl name='PyCoro_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/genobject.h' line='29' column='1'/>
    <var-decl name='PyAsyncGen_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/genobject.h' line='40' column='1'/>
    <var-decl name='PyFrame_Type' type-id='type-id-3' visibility='default' filepath='./Include/cpython/pyframe.h' line='5' column='1'/>
    <var-decl name='PyClassMethodDescr_Type' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='19' column='1'/>
    <var-decl name='PyGetSetDescr_Type' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='20' column='1'/>
    <var-decl name='PyMemberDescr_Type' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='21' column='1'/>
    <var-decl name='PyMethodDescr_Type' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='22' column='1'/>
    <var-decl name='PyWrapperDescr_Type' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='23' column='1'/>
    <var-decl name='PyDictProxy_Type' type-id='type-id-3' visibility='default' filepath='./Include/descrobject.h' line='24' column='1'/>
    <var-decl name='Py_GenericAliasType' type-id='type-id-3' visibility='default' filepath='./Include/genericaliasobject.h' line='9' column='1'/>
    <var-decl name='_PyMethodWrapper_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_descrobject.h' line='23' column='1'/>
    <var-decl name='_PyNamespace_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_namespace.h' line='13' column='1'/>
    <var-decl name='_PyNone_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_object.h' line='994' column='1'/>
    <var-decl name='_PyNotImplemented_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_object.h' line='995' column='1'/>
    <var-decl name='_PyUnion_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_unionobject.h' line='12' column='1'/>
    <var-decl name='PyCFunction_Type' type-id='type-id-3' visibility='default' filepath='./Include/methodobject.h' line='14' column='1'/>
    <var-decl name='PyModule_Type' type-id='type-id-3' visibility='default' filepath='./Include/moduleobject.h' line='10' column='1'/>
    <var-decl name='PyCapsule_Type' type-id='type-id-3' visibility='default' filepath='./Include/pycapsule.h' line='21' column='1'/>
    <var-decl name='PyEllipsis_Type' type-id='type-id-3' visibility='default' filepath='./Include/sliceobject.h' line='33' column='1'/>
    <var-decl name='PyTraceBack_Type' type-id='type-id-3' visibility='default' filepath='./Include/traceback.h' line='13' column='1'/>
    <function-decl name='PyInit__types' mangled-name='PyInit__types' filepath='./Modules/_typesmodule.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__types' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_typingmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='_PyTypeAlias_Type' type-id='type-id-3' visibility='default' filepath='./Include/internal/pycore_typevarobject.h' line='21' column='1'/>
    <var-decl name='_Py_NoDefaultStruct' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_typevarobject.h' line='23' column='1'/>
    <function-decl name='PyInit__typing' mangled-name='PyInit__typing' filepath='./Modules/_typingmodule.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__typing' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_weakref.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='_PyWeakref_RefType' type-id='type-id-3' visibility='default' filepath='./Include/weakrefobject.h' line='11' column='1'/>
    <var-decl name='_PyWeakref_ProxyType' type-id='type-id-3' visibility='default' filepath='./Include/weakrefobject.h' line='12' column='1'/>
    <var-decl name='_PyWeakref_CallableProxyType' type-id='type-id-3' visibility='default' filepath='./Include/weakrefobject.h' line='13' column='1'/>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='./Modules/_weakref.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/atexitmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyUnstable_AtExit' mangled-name='PyUnstable_AtExit' filepath='./Modules/atexitmodule.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_AtExit' hash='88da1cce80a41472'>
      <parameter type-id='type-id-114' name='interp' filepath='./Modules/atexitmodule.c' line='27' column='1'/>
      <parameter type-id='type-id-115' name='func' filepath='./Modules/atexitmodule.c' line='28' column='1'/>
      <parameter type-id='type-id-22' name='data' filepath='./Modules/atexitmodule.c' line='28' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='./Modules/atexitmodule.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='b4ea4a9949b53d1b' id='type-id-116'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/errnomodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='./Modules/errnomodule.c' line='985' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='607077c8457ff8da' id='type-id-117'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/faulthandler.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <enum-decl name='__rlimit_resource' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/bits/resource.h' line='31' column='1' hash='f1198e13beef0532' id='type-id-119'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='RLIMIT_CPU' value='0'/>
      <enumerator name='RLIMIT_FSIZE' value='1'/>
      <enumerator name='RLIMIT_DATA' value='2'/>
      <enumerator name='RLIMIT_STACK' value='3'/>
      <enumerator name='RLIMIT_CORE' value='4'/>
      <enumerator name='__RLIMIT_RSS' value='5'/>
      <enumerator name='RLIMIT_NOFILE' value='7'/>
      <enumerator name='__RLIMIT_OFILE' value='7'/>
      <enumerator name='RLIMIT_AS' value='9'/>
      <enumerator name='__RLIMIT_NPROC' value='6'/>
      <enumerator name='__RLIMIT_MEMLOCK' value='8'/>
      <enumerator name='__RLIMIT_LOCKS' value='10'/>
      <enumerator name='__RLIMIT_SIGPENDING' value='11'/>
      <enumerator name='__RLIMIT_MSGQUEUE' value='12'/>
      <enumerator name='__RLIMIT_NICE' value='13'/>
      <enumerator name='__RLIMIT_RTPRIO' value='14'/>
      <enumerator name='__RLIMIT_RTTIME' value='15'/>
      <enumerator name='__RLIMIT_NLIMITS' value='16'/>
      <enumerator name='__RLIM_NLIMITS' value='16'/>
    </enum-decl>
    <class-decl name='rlimit' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/resource.h' line='139' column='1' hash='ebb1d584abada756' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rlim_cur' type-id='type-id-122' visibility='default' filepath='/usr/include/bits/resource.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rlim_max' type-id='type-id-122' visibility='default' filepath='/usr/include/bits/resource.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__rlim64_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/types.h' line='158' column='1' hash='8fdc5eea2983a729' id='type-id-123'/>
    <typedef-decl name='__rlimit_resource_t' type-id='type-id-119' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/sys/resource.h' line='38' column='1' hash='f1198e13beef0532' id='type-id-124'/>
    <typedef-decl name='rlim_t' type-id='type-id-123' size-in-bits='64' filepath='/usr/include/bits/resource.h' line='133' column='1' hash='8fdc5eea2983a729' id='type-id-122'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' hash='555fc4bca5fe84c7' id='type-id-126'/>
    <qualified-type-def type-id='type-id-126' restrict='yes' hash='44bc700b0795901e' id='type-id-127'/>
    <qualified-type-def type-id='type-id-125' const='yes' hash='e7101e81b3a1c79a' id='type-id-128'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' hash='cb258e8b0236a189' id='type-id-129'/>
    <qualified-type-def type-id='type-id-129' restrict='yes' hash='9e59d76337e3faeb' id='type-id-130'/>
    <qualified-type-def type-id='type-id-121' const='yes' hash='9172abf1d29bca7d' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' hash='1338b009d1566512' id='type-id-132'/>
    <qualified-type-def type-id='type-id-133' const='yes' hash='f6bb46ae7e1688ff' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' hash='e2b3d47e46551033' id='type-id-135'/>
    <qualified-type-def type-id='type-id-135' restrict='yes' hash='7190b2e911bb4cb9' id='type-id-136'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' hash='f743556fb3a37c0b' id='type-id-137'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='3a74fed78e9e6b37' id='type-id-138'/>
    <qualified-type-def type-id='type-id-138' restrict='yes' hash='94aea4acf9419229' id='type-id-139'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-22' filepath='./Include/pythread.h' line='4' column='1' id='type-id-140'/>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='./Modules/faulthandler.c' line='1397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_sigmask' filepath='/usr/include/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_sigmask' hash='7ebcce9ba6f5d0e4'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='raise' filepath='/usr/include/signal.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='raise' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigemptyset' filepath='/usr/include/signal.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigemptyset' hash='531c1522f306288c'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigfillset' filepath='/usr/include/signal.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigfillset' hash='531c1522f306288c'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigaction' filepath='/usr/include/signal.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaction' hash='424e4a85c065210d'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigaltstack' filepath='/usr/include/signal.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaltstack' hash='ac606f9c77e0b6bb'>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='9e970561a213ee08'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getauxval' filepath='/usr/include/sys/auxv.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getauxval' hash='91495cdf6321a116#2'>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='getrlimit' mangled-name='getrlimit64' filepath='/usr/include/sys/resource.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrlimit64' hash='28e3cf53cac014e3'>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setrlimit' mangled-name='setrlimit64' filepath='/usr/include/sys/resource.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setrlimit64' hash='9bbf9a3b0034bff6'>
      <parameter type-id='type-id-124'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_exit' filepath='/usr/include/unistd.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_exit' hash='388da3fa973fde78'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysconf' hash='683f2cc4e918c0b3#2'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-145'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-146'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-15'/>
    <typedef-decl name='size_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-9'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-33'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-41'/>
    <qualified-type-def type-id='type-id-146' const='yes' hash='3e50fd33f9bb78d9' id='type-id-147'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' hash='c44743f354f6a443' id='type-id-23'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo' hash='53885bde0aa65efe'>
      <return type-id='type-id-23'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-148'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getpath.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <qualified-type-def type-id='type-id-22' restrict='yes' id='type-id-149'/>
    <var-decl name='PyExc_MemoryError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='100' column='1'/>
    <function-decl name='_Py_Get_Getpath_CodeObject' mangled-name='_Py_Get_Getpath_CodeObject' filepath='./Modules/getpath.c' line='833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Get_Getpath_CodeObject' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='dladdr' filepath='/usr/include/dlfcn.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dladdr' hash='b1b4616e01fa8582'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-150'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fprintf' filepath='/usr/include/stdio.h' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fprintf' hash='31c19dfde3fac410'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fread' filepath='/usr/include/stdio.h' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread' hash='b41d7fe688a81bb5'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='unsetenv' filepath='/usr/include/stdlib.h' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unsetenv' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscpy' hash='0da07344a69989b9'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-152'/>
    </function-decl>
    <function-decl name='wcscmp' filepath='/usr/include/wchar.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscmp' hash='8d011970848592f8'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcschr' filepath='/usr/include/wchar.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcschr' hash='db84d20d1973acb1'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-152'/>
    </function-decl>
    <function-decl name='wcsrchr' filepath='/usr/include/wchar.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsrchr' hash='db84d20d1973acb1'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-152'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/itertoolsmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='./Modules/itertoolsmodule.c' line='4077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/posixmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='1024' hash='3f0209c3c9694f78' id='type-id-155'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-157' size-in-bits='256' hash='a0785e5c9e99adb8' id='type-id-158'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-146' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-160'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-161'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-146' size-in-bits='520' hash='5b11e0ff30e6fbfa' id='type-id-162'>
      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='ba3b86918ae00425' id='type-id-163'/>
    </array-type-def>
    <enum-decl name='__priority_which' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/bits/resource.h' line='187' column='1' hash='63804f9287e7d739' id='type-id-164'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='PRIO_PROCESS' value='0'/>
      <enumerator name='PRIO_PGRP' value='1'/>
      <enumerator name='PRIO_USER' value='2'/>
    </enum-decl>
    <enum-decl name='idtype_t' naming-typedef-id='type-id-165' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/bits/types/idtype_t.h' line='6' column='1' hash='e1fb3bd10dff08fe' id='type-id-166'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='P_ALL' value='0'/>
      <enumerator name='P_PID' value='1'/>
      <enumerator name='P_PGID' value='2'/>
      <enumerator name='P_PIDFD' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='480' hash='56cfe75511ed015b' id='type-id-167'>
      <subrange length='15' lower-bound='0' upper-bound='14' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='853801d50611c72b' id='type-id-168'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='512' hash='ce7f2efdc14fc568' id='type-id-169'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='160' hash='f6adbc622c614e05' id='type-id-170'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-33' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-171'/>
    </array-type-def>
    <class-decl name='cpu_set_t' is-struct='yes' naming-typedef-id='type-id-172' visibility='default' size-in-bits='1024' filepath='/usr/include/bits/cpu-set.h' line='39' column='1' hash='320ffe1e673199fd' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='/usr/include/bits/dirent.h' line='22' column='1' hash='f8f1acd4a88a2190' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-175' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-107' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-160' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='itimerspec' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/bits/types/struct_itimerspec.h' line='8' column='1' hash='e10515550014d7a1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='it_interval' type-id='type-id-177' visibility='default' filepath='/usr/include/bits/types/struct_itimerspec.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='it_value' type-id='type-id-177' visibility='default' filepath='/usr/include/bits/types/struct_itimerspec.h' line='11' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='posix_spawn_file_actions_t' is-struct='yes' naming-typedef-id='type-id-178' visibility='default' size-in-bits='640' filepath='/usr/include/spawn.h' line='44' column='1' hash='780159dd06d64f07' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__allocated' type-id='type-id-15' visibility='default' filepath='/usr/include/spawn.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__used' type-id='type-id-15' visibility='default' filepath='/usr/include/spawn.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__actions' type-id='type-id-180' visibility='default' filepath='/usr/include/spawn.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__pad' type-id='type-id-169' visibility='default' filepath='/usr/include/spawn.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='posix_spawnattr_t' is-struct='yes' naming-typedef-id='type-id-181' visibility='default' size-in-bits='2688' filepath='/usr/include/spawn.h' line='29' column='1' hash='b37604c1de16bef2' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__flags' type-id='type-id-183' visibility='default' filepath='/usr/include/spawn.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__pgrp' type-id='type-id-184' visibility='default' filepath='/usr/include/spawn.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__sd' type-id='type-id-185' visibility='default' filepath='/usr/include/spawn.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__ss' type-id='type-id-185' visibility='default' filepath='/usr/include/spawn.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='__sp' type-id='type-id-186' visibility='default' filepath='/usr/include/spawn.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='__policy' type-id='type-id-15' visibility='default' filepath='/usr/include/spawn.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='__cgroup' type-id='type-id-15' visibility='default' filepath='/usr/include/spawn.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='__pad' type-id='type-id-167' visibility='default' filepath='/usr/include/spawn.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sched_param' is-struct='yes' visibility='default' size-in-bits='32' filepath='/usr/include/bits/types/struct_sched_param.h' line='23' column='1' hash='c8d5170b2e12a3bd' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-15' visibility='default' filepath='/usr/include/bits/types/struct_sched_param.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='statvfs' is-struct='yes' visibility='default' size-in-bits='896' filepath='/usr/include/bits/statvfs.h' line='29' column='1' hash='add54f064c970b13' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_bsize' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/statvfs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_frsize' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/statvfs.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/statvfs.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/statvfs.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/statvfs.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/statvfs.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/statvfs.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_favail' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/statvfs.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_fsid' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/statvfs.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_flag' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/statvfs.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_namemax' type-id='type-id-33' visibility='default' filepath='/usr/include/bits/statvfs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_type' type-id='type-id-105' visibility='default' filepath='/usr/include/bits/statvfs.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='__f_spare' type-id='type-id-170' visibility='default' filepath='/usr/include/bits/statvfs.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='termios' is-struct='yes' visibility='default' size-in-bits='480' filepath='/usr/include/bits/termios-struct.h' line='24' column='1' hash='3141cf6ba9862321' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-157' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-158' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/termios-struct.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tms' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/sys/times.h' line='32' column='1' hash='26b6913839a334e6' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tms_utime' type-id='type-id-194' visibility='default' filepath='/usr/include/sys/times.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tms_stime' type-id='type-id-194' visibility='default' filepath='/usr/include/sys/times.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tms_cutime' type-id='type-id-194' visibility='default' filepath='/usr/include/sys/times.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tms_cstime' type-id='type-id-194' visibility='default' filepath='/usr/include/sys/times.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='utsname' is-struct='yes' visibility='default' size-in-bits='3120' filepath='/usr/include/sys/utsname.h' line='48' column='1' hash='e8c5f4e1269cd961' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-162' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-162' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-162' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-162' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-162' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='type-id-162' visibility='default' filepath='/usr/include/sys/utsname.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='winsize' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/bits/ioctl-types.h' line='27' column='1' hash='d5558bb7d1307ae2' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ws_row' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ws_col' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ws_xpixel' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ws_ypixel' type-id='type-id-68' visibility='default' filepath='/usr/include/bits/ioctl-types.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__cpu_mask' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/cpu-set.h' line='32' column='1' hash='8fdc5eea2983a729' id='type-id-154'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/types.h' line='185' column='1' hash='8fdc5eea2983a729' id='type-id-188'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-33' size-in-bits='64' filepath='/usr/include/bits/types.h' line='189' column='1' hash='8fdc5eea2983a729' id='type-id-189'/>
    <typedef-decl name='__id_t' type-id='type-id-105' size-in-bits='32' filepath='/usr/include/bits/types.h' line='159' column='1' hash='e66b43f97c38e87a' id='type-id-197'/>
    <typedef-decl name='__priority_which_t' type-id='type-id-164' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/sys/resource.h' line='40' column='1' hash='63804f9287e7d739' id='type-id-198'/>
    <typedef-decl name='cc_t' type-id='type-id-107' size-in-bits='8' filepath='/usr/include/bits/termios.h' line='23' column='1' hash='6ebac62b3366db68' id='type-id-157'/>
    <typedef-decl name='clock_t' type-id='type-id-199' size-in-bits='64' filepath='/usr/include/bits/types/clock_t.h' line='7' column='1' hash='b119fe0931d2ee10' id='type-id-194'/>
    <typedef-decl name='cpu_set_t' type-id='type-id-173' size-in-bits='1024' filepath='/usr/include/bits/cpu-set.h' line='42' column='1' id='type-id-172'/>
    <typedef-decl name='eventfd_t' type-id='type-id-200' size-in-bits='64' filepath='/usr/include/sys/eventfd.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-201'/>
    <typedef-decl name='gid_t' type-id='type-id-202' size-in-bits='32' filepath='/usr/include/sys/types.h' line='64' column='1' hash='e66b43f97c38e87a' id='type-id-203'/>
    <typedef-decl name='id_t' type-id='type-id-197' size-in-bits='32' filepath='/usr/include/sys/types.h' line='103' column='1' hash='e66b43f97c38e87a' id='type-id-204'/>
    <typedef-decl name='idtype_t' type-id='type-id-166' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/bits/types/idtype_t.h' line='12' column='1' hash='e1fb3bd10dff08fe' id='type-id-165'/>
    <typedef-decl name='mode_t' type-id='type-id-205' size-in-bits='32' filepath='/usr/include/sys/types.h' line='69' column='1' hash='e66b43f97c38e87a' id='type-id-206'/>
    <typedef-decl name='posix_spawn_file_actions_t' type-id='type-id-179' size-in-bits='640' filepath='/usr/include/spawn.h' line='50' column='1' id='type-id-178'/>
    <typedef-decl name='posix_spawnattr_t' type-id='type-id-182' size-in-bits='2688' filepath='/usr/include/spawn.h' line='39' column='1' id='type-id-181'/>
    <typedef-decl name='speed_t' type-id='type-id-105' size-in-bits='32' filepath='/usr/include/bits/termios.h' line='24' column='1' hash='e66b43f97c38e87a' id='type-id-192'/>
    <typedef-decl name='tcflag_t' type-id='type-id-105' size-in-bits='32' filepath='/usr/include/bits/termios.h' line='25' column='1' hash='e66b43f97c38e87a' id='type-id-191'/>
    <typedef-decl name='uid_t' type-id='type-id-207' size-in-bits='32' filepath='/usr/include/sys/types.h' line='79' column='1' hash='e66b43f97c38e87a' id='type-id-208'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' hash='73a7b6995d893694' id='type-id-209'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' hash='58e8e30156c6cb9b' id='type-id-210'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' hash='99e769d4daeec28b' id='type-id-211'/>
    <qualified-type-def type-id='type-id-212' restrict='yes' hash='4c4a2d51b8487849' id='type-id-213'/>
    <qualified-type-def type-id='type-id-202' const='yes' hash='811921508ce10dab' id='type-id-214'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' hash='0a4f3866f097d7fa' id='type-id-215'/>
    <qualified-type-def type-id='type-id-172' const='yes' hash='74b753259a2ac36a' id='type-id-216'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' hash='b11851f865e088e6' id='type-id-217'/>
    <qualified-type-def type-id='type-id-176' const='yes' hash='3251afcefdd1c5cc' id='type-id-218'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='f63c452a907ad4f9' id='type-id-219'/>
    <qualified-type-def type-id='type-id-178' const='yes' hash='7be4fc5723ddd6b6' id='type-id-220'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' hash='eab7556ad4b98364' id='type-id-221'/>
    <qualified-type-def type-id='type-id-221' restrict='yes' hash='099e0fe400913c09' id='type-id-222'/>
    <qualified-type-def type-id='type-id-181' const='yes' hash='4daf2ee7175fb8cb' id='type-id-223'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' hash='4a1f5d04c73611b4' id='type-id-224'/>
    <qualified-type-def type-id='type-id-224' restrict='yes' hash='c60eba2ae499317a' id='type-id-225'/>
    <qualified-type-def type-id='type-id-186' const='yes' hash='9684d9337b2c537e' id='type-id-226'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' hash='ee6f52f145816004' id='type-id-227'/>
    <qualified-type-def type-id='type-id-227' restrict='yes' hash='89a7870bbba92869' id='type-id-228'/>
    <qualified-type-def type-id='type-id-185' const='yes' hash='4f70ad92edbd4b3c' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='2ac133677b71b2c0' id='type-id-230'/>
    <qualified-type-def type-id='type-id-230' restrict='yes' hash='5df9dc6f5c8d0766' id='type-id-231'/>
    <qualified-type-def type-id='type-id-190' const='yes' hash='fe5a3fef08691ae1' id='type-id-232'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' hash='0e457483258bddcd' id='type-id-233'/>
    <qualified-type-def type-id='type-id-196' const='yes' hash='2aa69ac28e855a3e' id='type-id-234'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='679dd77555d20a51' id='type-id-235'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' hash='a39fe32b4384bd03' id='type-id-236'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' hash='1ce54f87b39780f9' id='type-id-237'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='f8b718c28731c614' id='type-id-238'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' hash='052a4bfbf9bec03b' id='type-id-239'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' hash='5efb2f997fa57db7' id='type-id-240'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' hash='7e9a76962b5dc492' id='type-id-241'/>
    <qualified-type-def type-id='type-id-241' restrict='yes' hash='34ae521dcf7a88de' id='type-id-242'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' hash='e4edd9375cb5808a' id='type-id-243'/>
    <qualified-type-def type-id='type-id-243' restrict='yes' hash='41fc191cd2ddbef1' id='type-id-244'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='34f6234700fb6e56' id='type-id-245'/>
    <qualified-type-def type-id='type-id-245' restrict='yes' hash='f159a7286ec70555' id='type-id-246'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' hash='3b4dbcdcdc9e1374' id='type-id-247'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' hash='6f1a0fa1f59948e6' id='type-id-248'/>
    <qualified-type-def type-id='type-id-248' restrict='yes' hash='9819b69ede2aa380' id='type-id-249'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' hash='3b42b1ca402709a2' id='type-id-250'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='ebfb0f98d6b3ce95' id='type-id-251'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' hash='907e6270359c7eb6' id='type-id-252'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-180'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-256'/>
    <class-decl name='__spawn_action' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-255'/>
    <qualified-type-def type-id='type-id-22' restrict='yes' id='type-id-257'/>
    <var-decl name='PyFloat_Type' type-id='type-id-3' visibility='default' filepath='./Include/floatobject.h' line='14' column='1'/>
    <var-decl name='PyExc_FileNotFoundError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='132' column='1'/>
    <var-decl name='PyExc_DeprecationWarning' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='152' column='1'/>
    <var-decl name='PyOS_InputHook' type-id='type-id-258' visibility='default' filepath='./Include/pythonrun.h' line='22' column='1'/>
    <var-decl name='PyStructSequence_UnnamedField' type-id='type-id-259' visibility='default' filepath='./Include/structseq.h' line='22' column='1'/>
    <function-decl name='PyOS_BeforeFork' mangled-name='PyOS_BeforeFork' filepath='./Modules/posixmodule.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_BeforeFork' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Parent' mangled-name='PyOS_AfterFork_Parent' filepath='./Modules/posixmodule.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Parent' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Child' mangled-name='PyOS_AfterFork_Child' filepath='./Modules/posixmodule.c' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Child' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='./Modules/posixmodule.c' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='_PyLong_FromGid' mangled-name='_PyLong_FromGid' filepath='./Modules/posixmodule.c' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromGid' hash='45145aeba9822373'>
      <parameter type-id='type-id-203' name='gid' filepath='./Modules/posixmodule.c' line='804' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='./Modules/posixmodule.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter' hash='ea314829a743aad8'>
      <parameter type-id='type-id-5' name='obj' filepath='./Modules/posixmodule.c' line='812' column='1'/>
      <parameter type-id='type-id-251' name='p' filepath='./Modules/posixmodule.c' line='812' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='./Modules/posixmodule.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter' hash='32812fc504154f1d'>
      <parameter type-id='type-id-5' name='obj' filepath='./Modules/posixmodule.c' line='918' column='1'/>
      <parameter type-id='type-id-239' name='p' filepath='./Modules/posixmodule.c' line='918' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyOS_FSPath' mangled-name='PyOS_FSPath' filepath='./Modules/posixmodule.c' line='16553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FSPath' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='./Modules/posixmodule.c' line='18207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__sched_cpucount' filepath='/usr/include/bits/cpu-set.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpucount' hash='77deaf44f93ea8c2'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='__sched_cpualloc' filepath='/usr/include/bits/cpu-set.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpualloc' hash='dc829300b2e0f85c'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-236'/>
    </function-decl>
    <function-decl name='__sched_cpufree' filepath='/usr/include/bits/cpu-set.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpufree' hash='189039c0c884c623'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='splice' filepath='/usr/include/bits/fcntl-linux.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='splice' hash='2e759afd3423327b'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-260'/>
    </function-decl>
    <function-decl name='memfd_create' filepath='/usr/include/bits/mman-shared.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memfd_create' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='unshare' filepath='/usr/include/bits/sched.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unshare' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setns' filepath='/usr/include/bits/sched.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setns' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-256' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-253'/>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir' hash='388da3fa973fde78'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='fdopendir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdopendir' hash='388da3fa973fde78'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64' hash='8210c868a3f56bcd'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='rewinddir' filepath='/usr/include/dirent.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rewinddir' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='openat' mangled-name='openat64' filepath='/usr/include/fcntl.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openat64' hash='54d4a9aa53d4bded'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_fadvise' mangled-name='posix_fadvise64' filepath='/usr/include/fcntl.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_fadvise64' hash='8bf0c187456bdf89'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_fallocate' mangled-name='posix_fallocate64' filepath='/usr/include/fcntl.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_fallocate64' hash='dceefd4413948de2'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setgroups' filepath='/usr/include/grp.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setgroups' hash='e95416b436ee85d5'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-215'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getgrouplist' filepath='/usr/include/grp.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgrouplist' hash='19004af698d723f3'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='initgroups' filepath='/usr/include/grp.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initgroups' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='openpty' filepath='/usr/include/pty.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openpty' hash='cd3f7c7bf5ac2a70'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='forkpty' filepath='/usr/include/pty.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='forkpty' hash='e2a8da428550ed55'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_setparam' filepath='/usr/include/sched.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setparam' hash='84b61ee15c693dc1'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-227'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_getparam' filepath='/usr/include/sched.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getparam' hash='ffe5532b8936c652'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_setscheduler' filepath='/usr/include/sched.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setscheduler' hash='37c97bd75e276691'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-227'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_getscheduler' filepath='/usr/include/sched.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getscheduler' hash='d628501fd2223339'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_get_priority_max' filepath='/usr/include/sched.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_get_priority_max' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_get_priority_min' filepath='/usr/include/sched.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_get_priority_min' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_rr_get_interval' filepath='/usr/include/sched.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_rr_get_interval' hash='abb4abf77092cad6'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_setaffinity' filepath='/usr/include/sched.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setaffinity' hash='a8c3ccba20c8dbe7'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sched_getaffinity' filepath='/usr/include/sched.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getaffinity' hash='688b6fbda473dce1'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kill' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='killpg' filepath='/usr/include/signal.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='killpg' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigaddset' filepath='/usr/include/signal.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaddset' hash='ede84b2822c71f4d'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn' filepath='/usr/include/spawn.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn' hash='99bc2201600e2d8f'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnp' filepath='/usr/include/spawn.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnp' hash='40be9c17d235b6ba'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_init' filepath='/usr/include/spawn.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_init' hash='4fd8bd02f07f5f8a'>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_destroy' filepath='/usr/include/spawn.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_destroy' hash='4fd8bd02f07f5f8a'>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setsigdefault' filepath='/usr/include/spawn.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setsigdefault' hash='9ddf83a5b7028429'>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setsigmask' filepath='/usr/include/spawn.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setsigmask' hash='9ddf83a5b7028429'>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setflags' filepath='/usr/include/spawn.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setflags' hash='7fb5ccef1b8c5e55#2'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setpgroup' filepath='/usr/include/spawn.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setpgroup' hash='8545fa704271fd23'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setschedpolicy' filepath='/usr/include/spawn.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setschedpolicy' hash='8545fa704271fd23'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setschedparam' filepath='/usr/include/spawn.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawnattr_setschedparam' hash='da16649d110889f5'>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_init' filepath='/usr/include/spawn.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_init' hash='c6833ea395cce014'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_destroy' filepath='/usr/include/spawn.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_destroy' hash='c6833ea395cce014'>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addopen' filepath='/usr/include/spawn.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_addopen' hash='15f5a6f0d5a1ceb5'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-206'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addclose' filepath='/usr/include/spawn.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_addclose' hash='5eab6ef164826667'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_adddup2' filepath='/usr/include/spawn.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_adddup2' hash='0868d13ef46e0974'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addclosefrom_np' filepath='/usr/include/spawn.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_spawn_file_actions_addclosefrom_np' hash='5eab6ef164826667'>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <var-decl name='stdout' type-id='type-id-112' visibility='default' filepath='/usr/include/stdio.h' line='150' column='1' elf-symbol-id='stdout'/>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rename' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='renameat' filepath='/usr/include/stdio.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='renameat' hash='ad8fa68fbdb7548a'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen64' hash='6347265fef1b547c'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='fileno' filepath='/usr/include/stdio.h' line='873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ctermid' filepath='/usr/include/stdio.h' line='901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ctermid' hash='6faa8831d3af3ad4'>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='__isoc23_strtol' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtol' hash='52efcc9e902b4c3e'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='setenv' filepath='/usr/include/stdlib.h' line='792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setenv' hash='5e8eff0065f8d4dd'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='system' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='posix_openpt' filepath='/usr/include/stdlib.h' line='1110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_openpt' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='grantpt' filepath='/usr/include/stdlib.h' line='1118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='grantpt' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='unlockpt' filepath='/usr/include/stdlib.h' line='1122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlockpt' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ptsname_r' filepath='/usr/include/stdlib.h' line='1134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ptsname_r' hash='6c170ffb8f9786e8'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getloadavg' filepath='/usr/include/stdlib.h' line='1145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getloadavg' hash='599238a4797c349c'>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='d2c49d83b30fb50c'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='strtok_r' filepath='/usr/include/string.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strtok_r' hash='6b6e39e1a51c0d16'>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='eventfd' filepath='/usr/include/sys/eventfd.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='eventfd' hash='e9e27b1a25c85107'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='eventfd_read' filepath='/usr/include/sys/eventfd.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='eventfd_read' hash='d21f8036892c4042'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-238'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='eventfd_write' filepath='/usr/include/sys/eventfd.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='eventfd_write' hash='b03aa5f98a3a1499'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl' hash='b03aa5f98a3a1499'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-33'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getpriority' filepath='/usr/include/sys/resource.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpriority' hash='8e21568ed93f4419'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-204'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setpriority' filepath='/usr/include/sys/resource.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpriority' hash='4abe55f79448c935'>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-204'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sendfile' mangled-name='sendfile64' filepath='/usr/include/sys/sendfile.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sendfile64' hash='11cc7ffca774dc75'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64' hash='5ffe6a576201da98'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64' hash='5227d00433989f9c'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fstatat' mangled-name='fstatat64' filepath='/usr/include/sys/stat.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstatat64' hash='c6700694c83e25b5'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-268'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='lstat' mangled-name='lstat64' filepath='/usr/include/sys/stat.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lstat64' hash='5ffe6a576201da98'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-268'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='chmod' filepath='/usr/include/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chmod' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fchmod' filepath='/usr/include/sys/stat.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchmod' hash='87b255596f349675'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fchmodat' filepath='/usr/include/sys/stat.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchmodat' hash='920ea0a8bd308e3e'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='umask' filepath='/usr/include/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='umask' hash='0389e499374a3f97'>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-205'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/sys/stat.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdir' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mkdirat' filepath='/usr/include/sys/stat.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirat' hash='e8a92975e79b661a'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mknod' filepath='/usr/include/sys/stat.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mknod' hash='c07d62223f08aa11'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mknodat' filepath='/usr/include/sys/stat.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mknodat' hash='52dcfe633da414dd'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mkfifo' filepath='/usr/include/sys/stat.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkfifo' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='mkfifoat' filepath='/usr/include/sys/stat.h' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkfifoat' hash='e8a92975e79b661a'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-205'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='utimensat' filepath='/usr/include/sys/stat.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='utimensat' hash='38088643f63af91e'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='futimens' filepath='/usr/include/sys/stat.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='futimens' hash='9fe2e8c7182b87b6'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='statvfs' mangled-name='statvfs64' filepath='/usr/include/sys/statvfs.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statvfs64' hash='69b42edebd30e44b'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-249'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fstatvfs' mangled-name='fstatvfs64' filepath='/usr/include/sys/statvfs.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstatvfs64' hash='85579ecbf75705ef'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='timerfd_create' filepath='/usr/include/sys/timerfd.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timerfd_create' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='timerfd_settime' filepath='/usr/include/sys/timerfd.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timerfd_settime' hash='3c69bda14c4ec6d8'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='timerfd_gettime' filepath='/usr/include/sys/timerfd.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='timerfd_gettime' hash='901b0db96c9570c2'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='times' filepath='/usr/include/sys/times.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='times' hash='ec17cf9ad00ba020'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='readv' filepath='/usr/include/sys/uio.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readv' hash='76dcd21084089e04'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-273'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='writev' filepath='/usr/include/sys/uio.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='writev' hash='76dcd21084089e04'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-273'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='pwritev2' mangled-name='pwritev64v2' filepath='/usr/include/sys/uio.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pwritev64v2' hash='9f1784115ec09145'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-273'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='preadv2' mangled-name='preadv64v2' filepath='/usr/include/sys/uio.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='preadv64v2' hash='9f1784115ec09145'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-273'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname' hash='5024d1665fd35374'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wait' filepath='/usr/include/sys/wait.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait' hash='2bb270506719bb4b'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='waitpid' filepath='/usr/include/sys/wait.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='waitpid' hash='1cac1fbad1227152'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='waitid' filepath='/usr/include/sys/wait.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='waitid' hash='b1f35cf5293332c0'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-197'/>
      <parameter type-id='type-id-274'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wait3' filepath='/usr/include/sys/wait.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait3' hash='d93951931b7d2221'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='wait4' filepath='/usr/include/sys/wait.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait4' hash='532ee9e6eb162310'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='setxattr' filepath='/usr/include/sys/xattr.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setxattr' hash='6e23d2dad9b93aeb'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='lsetxattr' filepath='/usr/include/sys/xattr.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lsetxattr' hash='6e23d2dad9b93aeb'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fsetxattr' filepath='/usr/include/sys/xattr.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fsetxattr' hash='9ae9f84aed468493'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getxattr' filepath='/usr/include/sys/xattr.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getxattr' hash='4096d0998fb5a435'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='lgetxattr' filepath='/usr/include/sys/xattr.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lgetxattr' hash='4096d0998fb5a435'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='fgetxattr' filepath='/usr/include/sys/xattr.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgetxattr' hash='af144bf9a14e9d98'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='listxattr' filepath='/usr/include/sys/xattr.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='listxattr' hash='c7ec0fa0257f58ec'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='llistxattr' filepath='/usr/include/sys/xattr.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='llistxattr' hash='c7ec0fa0257f58ec'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='flistxattr' filepath='/usr/include/sys/xattr.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='flistxattr' hash='2b1a3f7a62191a73'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='removexattr' filepath='/usr/include/sys/xattr.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='removexattr' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='lremovexattr' filepath='/usr/include/sys/xattr.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lremovexattr' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fremovexattr' filepath='/usr/include/sys/xattr.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fremovexattr' hash='e4623ae51caf7651'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access' hash='1d81aff51c388187'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='faccessat' filepath='/usr/include/unistd.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='faccessat' hash='6d9036587be9cce7'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pread' mangled-name='pread64' filepath='/usr/include/unistd.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pread64' hash='7fa748be93332051'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='pwrite' mangled-name='pwrite64' filepath='/usr/include/unistd.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pwrite64' hash='7fa748be93332051'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='pipe' filepath='/usr/include/unistd.h' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pipe' hash='2bb270506719bb4b'>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pipe2' filepath='/usr/include/unistd.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pipe2' hash='d5a833aba721ca51'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='chown' filepath='/usr/include/unistd.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chown' hash='37db1e76c98a7dbc'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fchown' filepath='/usr/include/unistd.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchown' hash='2ea9e5686db6170b'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='lchown' filepath='/usr/include/unistd.h' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lchown' hash='37db1e76c98a7dbc'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fchownat' filepath='/usr/include/unistd.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchownat' hash='e27859f77ecc027f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='chdir' filepath='/usr/include/unistd.h' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chdir' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fchdir' filepath='/usr/include/unistd.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchdir' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getcwd' filepath='/usr/include/unistd.h' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getcwd' hash='8d96ff9a88b5c973'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='dup2' filepath='/usr/include/unistd.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dup2' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dup3' filepath='/usr/include/unistd.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dup3' hash='a3e40634f2a60824'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <var-decl name='environ' type-id='type-id-276' visibility='default' filepath='/usr/include/unistd.h' line='566' column='1' elf-symbol-id='environ'/>
    <function-decl name='execve' filepath='/usr/include/unistd.h' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execve' hash='2a0bee0f6f283d11'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fexecve' filepath='/usr/include/unistd.h' line='578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fexecve' hash='4898ab6fcb5576b1'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-212'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='execv' filepath='/usr/include/unistd.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execv' hash='dca24aa2bd4be2b5'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='nice' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nice' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pathconf' filepath='/usr/include/unistd.h' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pathconf' hash='f2690588a26e973f#2'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='fpathconf' filepath='/usr/include/unistd.h' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fpathconf' hash='eaa814eba3f6cfa0#2'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='confstr' filepath='/usr/include/unistd.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='confstr' hash='d4630893dd773bfd'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpid' hash='388da3fa973fde78'>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='getppid' filepath='/usr/include/unistd.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getppid' hash='388da3fa973fde78'>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='getpgrp' filepath='/usr/include/unistd.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpgrp' hash='388da3fa973fde78'>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='getpgid' filepath='/usr/include/unistd.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpgid' hash='d628501fd2223339'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='setpgid' filepath='/usr/include/unistd.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpgid' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setpgrp' filepath='/usr/include/unistd.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpgrp' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setsid' filepath='/usr/include/unistd.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setsid' hash='388da3fa973fde78'>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='getsid' filepath='/usr/include/unistd.h' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getsid' hash='d628501fd2223339'>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='getuid' filepath='/usr/include/unistd.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getuid' hash='2bb88322482ae81c'>
      <return type-id='type-id-207'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='geteuid' hash='2bb88322482ae81c'>
      <return type-id='type-id-207'/>
    </function-decl>
    <function-decl name='getgid' filepath='/usr/include/unistd.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgid' hash='2bb88322482ae81c'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='getegid' filepath='/usr/include/unistd.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getegid' hash='2bb88322482ae81c'>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='getgroups' filepath='/usr/include/unistd.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgroups' hash='031a1397b603611b'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setuid' filepath='/usr/include/unistd.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setuid' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setreuid' filepath='/usr/include/unistd.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setreuid' hash='54152ac49ee16d47'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='seteuid' filepath='/usr/include/unistd.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='seteuid' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setgid' filepath='/usr/include/unistd.h' line='739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setgid' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setregid' filepath='/usr/include/unistd.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setregid' hash='54152ac49ee16d47'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setegid' filepath='/usr/include/unistd.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setegid' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getresuid' filepath='/usr/include/unistd.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getresuid' hash='c2b157bac6095416'>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getresgid' filepath='/usr/include/unistd.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getresgid' hash='17120d30d4ca1567'>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-209'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setresuid' filepath='/usr/include/unistd.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setresuid' hash='9b5e3cc521d97890'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setresgid' filepath='/usr/include/unistd.h' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setresgid' hash='9b5e3cc521d97890'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fork' filepath='/usr/include/unistd.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fork' hash='388da3fa973fde78'>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='ttyname_r' filepath='/usr/include/unistd.h' line='803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ttyname_r' hash='6c170ffb8f9786e8'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='linkat' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='linkat' hash='5fe2617fa98a02ad'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='symlink' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='readlink' filepath='/usr/include/unistd.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink' hash='f237a668886d5b45'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='symlinkat' filepath='/usr/include/unistd.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='symlinkat' hash='2b95cb2b1713a38e'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='readlinkat' filepath='/usr/include/unistd.h' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlinkat' hash='85f5ca5f146f6d9c'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlink' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='unlinkat' filepath='/usr/include/unistd.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlinkat' hash='54d4a9aa53d4bded'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='rmdir' filepath='/usr/include/unistd.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rmdir' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='tcgetpgrp' filepath='/usr/include/unistd.h' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tcgetpgrp' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-261'/>
    </function-decl>
    <function-decl name='tcsetpgrp' filepath='/usr/include/unistd.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tcsetpgrp' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-261'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getlogin' filepath='/usr/include/unistd.h' line='881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getlogin' hash='02a096d257a5e00d'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='chroot' filepath='/usr/include/unistd.h' line='977' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chroot' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fsync' filepath='/usr/include/unistd.h' line='989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fsync' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sync' filepath='/usr/include/unistd.h' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sync' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='truncate' mangled-name='truncate64' filepath='/usr/include/unistd.h' line='1030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='truncate64' hash='057e94ea03773b7d'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='syscall' filepath='/usr/include/unistd.h' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='syscall' hash='b1dcd91100b153bb'>
      <parameter type-id='type-id-144'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-144'/>
    </function-decl>
    <function-decl name='lockf' mangled-name='lockf64' filepath='/usr/include/unistd.h' line='1117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lockf64' hash='c2ab6da712caebc1'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='copy_file_range' filepath='/usr/include/unistd.h' line='1142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='copy_file_range' hash='2e759afd3423327b'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-267'/>
    </function-decl>
    <function-decl name='fdatasync' filepath='/usr/include/unistd.h' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdatasync' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='login_tty' filepath='/usr/include/utmp.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='login_tty' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/pwdmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <class-decl name='passwd' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/include/pwd.h' line='49' column='1' hash='40d9f3c502622677' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-41' visibility='default' filepath='/usr/include/pwd.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-41' visibility='default' filepath='/usr/include/pwd.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-207' visibility='default' filepath='/usr/include/pwd.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-202' visibility='default' filepath='/usr/include/pwd.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-41' visibility='default' filepath='/usr/include/pwd.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-41' visibility='default' filepath='/usr/include/pwd.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-41' visibility='default' filepath='/usr/include/pwd.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='514d09e2bcf19021' id='type-id-278'/>
    <qualified-type-def type-id='type-id-278' restrict='yes' hash='354f276fc81125e7' id='type-id-279'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' hash='adf3fe006de47d78' id='type-id-280'/>
    <qualified-type-def type-id='type-id-280' restrict='yes' hash='64a405f90589f372' id='type-id-281'/>
    <class-decl name='_ts' is-struct='yes' visibility='default' size-in-bits='6592' filepath='./Include/cpython/pystate.h' line='64' column='1' hash='970086a259bdbb28' id='type-id-282'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-26' visibility='default' filepath='./Include/cpython/pystate.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-26' visibility='default' filepath='./Include/cpython/pystate.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-114' visibility='default' filepath='./Include/cpython/pystate.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='eval_breaker' type-id='type-id-283' visibility='default' filepath='./Include/cpython/pystate.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_status' type-id='type-id-284' visibility='default' filepath='./Include/cpython/pystate.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='holds_gil' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_whence' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='state' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='py_recursion_remaining' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='py_recursion_limit' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='recursion_headroom' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='tracing' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='what_event' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='current_frame' type-id='type-id-285' visibility='default' filepath='./Include/cpython/pystate.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='c_profilefunc' type-id='type-id-286' visibility='default' filepath='./Include/cpython/pystate.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='c_tracefunc' type-id='type-id-286' visibility='default' filepath='./Include/cpython/pystate.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='c_profileobj' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='c_traceobj' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='current_exception' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='exc_info' type-id='type-id-287' visibility='default' filepath='./Include/cpython/pystate.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dict' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='gilstate_counter' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='async_exc' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='thread_id' type-id='type-id-33' visibility='default' filepath='./Include/cpython/pystate.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='native_thread_id' type-id='type-id-33' visibility='default' filepath='./Include/cpython/pystate.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='delete_later' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='critical_section' type-id='type-id-283' visibility='default' filepath='./Include/cpython/pystate.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='coroutine_origin_tracking_depth' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pystate.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='async_gen_firstiter' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='async_gen_finalizer' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='context' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='context_ver' type-id='type-id-200' visibility='default' filepath='./Include/cpython/pystate.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='id' type-id='type-id-200' visibility='default' filepath='./Include/cpython/pystate.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='datastack_chunk' type-id='type-id-288' visibility='default' filepath='./Include/cpython/pystate.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='datastack_top' type-id='type-id-289' visibility='default' filepath='./Include/cpython/pystate.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='datastack_limit' type-id='type-id-289' visibility='default' filepath='./Include/cpython/pystate.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='exc_state' type-id='type-id-290' visibility='default' filepath='./Include/cpython/pystate.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='current_executor' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='dict_global_version' type-id='type-id-200' visibility='default' filepath='./Include/cpython/pystate.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='threading_local_key' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='threading_local_sentinel' type-id='type-id-5' visibility='default' filepath='./Include/cpython/pystate.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='remote_debugger_support' type-id='type-id-291' visibility='default' filepath='./Include/cpython/pystate.h' line='208' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='./Modules/pwdmodule.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='setpwent' filepath='/usr/include/pwd.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpwent' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='endpwent' filepath='/usr/include/pwd.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endpwent' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getpwent' filepath='/usr/include/pwd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwent' hash='a964c7de1de90202'>
      <return type-id='type-id-278'/>
    </function-decl>
    <function-decl name='getpwuid_r' filepath='/usr/include/pwd.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwuid_r' hash='949175306c944248'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getpwnam_r' filepath='/usr/include/pwd.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwnam_r' hash='4c8375aa6dd7ef2f'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-281'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/signalmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <enum-decl name='__itimer_which' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/sys/time.h' line='114' column='1' hash='9ed91e0fafd8c51e' id='type-id-292'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='ITIMER_REAL' value='0'/>
      <enumerator name='ITIMER_VIRTUAL' value='1'/>
      <enumerator name='ITIMER_PROF' value='2'/>
    </enum-decl>
    <class-decl name='itimerval' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/sys/time.h' line='130' column='1' hash='9b49c7c6e8aa6f70' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='it_interval' type-id='type-id-294' visibility='default' filepath='/usr/include/sys/time.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='it_value' type-id='type-id-294' visibility='default' filepath='/usr/include/sys/time.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__itimer_which_t' type-id='type-id-292' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/sys/time.h' line='141' column='1' hash='9ed91e0fafd8c51e' id='type-id-295'/>
    <qualified-type-def type-id='type-id-293' const='yes' hash='41e7612745e40f92' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='827424f3d1d5af37' id='type-id-297'/>
    <qualified-type-def type-id='type-id-297' restrict='yes' hash='6104b3fa11b39884' id='type-id-298'/>
    <qualified-type-def type-id='type-id-46' restrict='yes' hash='1cc704142fa3e087' id='type-id-299'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='e63bbc9b5438ccba' id='type-id-300'/>
    <qualified-type-def type-id='type-id-300' restrict='yes' hash='00735ba4cdecfa42' id='type-id-301'/>
    <qualified-type-def type-id='type-id-274' restrict='yes' hash='73ec69a4b4511a39' id='type-id-302'/>
    <class-decl name='_frame' is-struct='yes' visibility='default' size-in-bits='640' filepath='./Include/internal/pycore_frame.h' line='18' column='1' hash='4401828e255afbb7' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-4' visibility='default' filepath='./Include/internal/pycore_frame.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_back' type-id='type-id-304' visibility='default' filepath='./Include/internal/pycore_frame.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_frame' type-id='type-id-305' visibility='default' filepath='./Include/internal/pycore_frame.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_trace' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_lineno' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_frame.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='f_trace_lines' type-id='type-id-146' visibility='default' filepath='./Include/internal/pycore_frame.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='f_trace_opcodes' type-id='type-id-146' visibility='default' filepath='./Include/internal/pycore_frame.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_extra_locals' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_locals_cache' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_overwritten_fast_locals' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_frame.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_f_frame_data' type-id='type-id-306' visibility='default' filepath='./Include/internal/pycore_frame.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='PyExc_KeyboardInterrupt' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='99' column='1'/>
    <function-decl name='PySignal_SetWakeupFd' mangled-name='PySignal_SetWakeupFd' filepath='./Modules/signalmodule.c' line='835' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySignal_SetWakeupFd' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='./Modules/signalmodule.c' line='1725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='./Modules/signalmodule.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyErr_SetInterruptEx' mangled-name='PyErr_SetInterruptEx' filepath='./Modules/signalmodule.c' line='1895' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterruptEx' hash='d628501fd2223339'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='./Modules/signalmodule.c' line='1911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='_Py_RestoreSignals' mangled-name='_Py_RestoreSignals' filepath='./Modules/signalmodule.c' line='1949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_RestoreSignals' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='2021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='./Modules/signalmodule.c' line='2054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='pthread_kill' filepath='/usr/include/bits/sigthread.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_kill' hash='3c22fdaad7e0fe35'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigismember' filepath='/usr/include/signal.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigismember' hash='e13bea38a6c1b950'>
      <parameter type-id='type-id-230'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigpending' filepath='/usr/include/signal.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigpending' hash='531c1522f306288c'>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigwait' filepath='/usr/include/signal.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigwait' hash='4e2431bacb8e3cdc'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigwaitinfo' filepath='/usr/include/signal.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigwaitinfo' hash='18ae52721a030ed6'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-302'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='sigtimedwait' filepath='/usr/include/signal.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigtimedwait' hash='c16168fe43cf68c3'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmin' filepath='/usr/include/signal.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_current_sigrtmin' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmax' filepath='/usr/include/signal.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_current_sigrtmax' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strstr' filepath='/usr/include/string.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strstr' hash='21babdbcb7a34ebe'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='strsignal' filepath='/usr/include/string.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strsignal' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='getitimer' filepath='/usr/include/sys/time.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getitimer' hash='63e8a90112d87871'>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-300'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setitimer' filepath='/usr/include/sys/time.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setitimer' hash='0e5862f68b06b113'>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-301'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='alarm' filepath='/usr/include/unistd.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alarm' hash='0389e499374a3f97'>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='pause' filepath='/usr/include/unistd.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pause' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/symtablemodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='./Modules/symtablemodule.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/timemodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <class-decl name='_PyTimeFraction' is-struct='yes' naming-typedef-id='type-id-308' visibility='default' size-in-bits='128' filepath='./Include/internal/pycore_runtime_structs.h' line='89' column='1' hash='4d2d7632b041d60f' id='type-id-309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numer' type-id='type-id-310' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='denom' type-id='type-id-310' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyTimeFraction' type-id='type-id-309' size-in-bits='128' filepath='./Include/internal/pycore_runtime_structs.h' line='92' column='1' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' hash='f2dffc4210618d10' id='type-id-311'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' hash='64c18e8b339fdfe9' id='type-id-312'/>
    <qualified-type-def type-id='type-id-308' const='yes' hash='f61a9bc1c1db508e' id='type-id-313'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' hash='51e8d829a635c8b2' id='type-id-314'/>
    <qualified-type-def type-id='type-id-315' const='yes' hash='6d30d2c0485b21b8' id='type-id-316'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' hash='934b82f269d593b3' id='type-id-317'/>
    <qualified-type-def type-id='type-id-317' restrict='yes' hash='eb8bfc989b1d24fd' id='type-id-318'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-320'/>
    <class-decl name='PyUnicodeWriter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-321'/>
    <typedef-decl name='PyUnicodeWriter' type-id='type-id-321' filepath='./Include/cpython/unicodeobject.h' line='468' column='1' id='type-id-319'/>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='./Modules/timemodule.c' line='2206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='pthread_getcpuclockid' filepath='/usr/include/pthread.h' line='1315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_getcpuclockid' hash='d19791ded4561a0e'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-312'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='2da84c559242300d'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-33'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='getrusage' filepath='/usr/include/sys/resource.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrusage' hash='909aead4128404f5'>
      <parameter type-id='type-id-322'/>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='clock' filepath='/usr/include/time.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock' hash='52c0efb08d2aa513'>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='time' hash='dfbf0d86b5e56f45'>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-324'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mktime' hash='93e83c388da365bd'>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-324'/>
    </function-decl>
    <function-decl name='tzset' filepath='/usr/include/time.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tzset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='clock_getres' filepath='/usr/include/time.h' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_getres' hash='abb4abf77092cad6'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_gettime' hash='abb4abf77092cad6'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='clock_settime' filepath='/usr/include/time.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_settime' hash='9fe2e8c7182b87b6'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='clock_nanosleep' filepath='/usr/include/time.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_nanosleep' hash='70c76e90bf069234'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-262'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='1043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsftime' hash='2de04a16fcbd1870'>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-61'/>
      <parameter type-id='type-id-318'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/dynload_shlib.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <qualified-type-def type-id='type-id-22' restrict='yes' id='type-id-327'/>
    <var-decl name='_PyImport_DynLoadFiletab' type-id='type-id-328' visibility='default' filepath='./Include/internal/pycore_importdl.h' line='15' column='1'/>
    <function-decl name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym' hash='fa9b01215069aed9'>
      <parameter type-id='type-id-327'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='dlerror' filepath='/usr/include/dlfcn.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlerror' hash='02a096d257a5e00d'>
      <return type-id='type-id-41'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/getplatform.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <function-decl name='Py_GetPlatform' mangled-name='Py_GetPlatform' filepath='./Python/getplatform.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPlatform' hash='53885bde0aa65efe'>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/importdl.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <typedef-decl name='dl_funcptr' type-id='type-id-329' size-in-bits='64' filepath='./Include/internal/pycore_importdl.h' line='132' column='1' hash='fd7a63c0c6c822c4' id='type-id-330'/>
    <var-decl name='PyModuleDef_Type' type-id='type-id-3' visibility='default' filepath='./Include/moduleobject.h' line='36' column='1'/>
    <var-decl name='PyExc_UnicodeEncodeError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='117' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/sysmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <class-decl name='_is' is-struct='yes' visibility='default' size-in-bits='1806400' filepath='./Include/internal/pycore_interp_structs.h' line='760' column='1' hash='e1dc8c1d4979a3e0' id='type-id-331'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ceval' type-id='type-id-332' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58112'>
        <var-decl name='_malloced' type-id='type-id-22' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58176'>
        <var-decl name='next' type-id='type-id-114' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58240'>
        <var-decl name='id' type-id='type-id-333' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58304'>
        <var-decl name='id_refcount' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58368'>
        <var-decl name='requires_idref' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58432'>
        <var-decl name='_whence' type-id='type-id-144' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='779' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58496'>
        <var-decl name='_initialized' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58528'>
        <var-decl name='_ready' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58560'>
        <var-decl name='finalizing' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58624'>
        <var-decl name='last_restart_version' type-id='type-id-283' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58688'>
        <var-decl name='threads' type-id='type-id-334' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59072'>
        <var-decl name='runtime' type-id='type-id-335' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='810' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59136'>
        <var-decl name='_finalizing' type-id='type-id-26' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59200'>
        <var-decl name='_finalizing_id' type-id='type-id-33' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='59264'>
        <var-decl name='gc' type-id='type-id-336' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61184'>
        <var-decl name='sysdict' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61248'>
        <var-decl name='builtins' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='61312'>
        <var-decl name='imports' type-id='type-id-337' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='841' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='62080'>
        <var-decl name='_gil' type-id='type-id-338' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='63744'>
        <var-decl name='codecs' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64000'>
        <var-decl name='config' type-id='type-id-340' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67648'>
        <var-decl name='feature_flags' type-id='type-id-33' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67712'>
        <var-decl name='dict' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67776'>
        <var-decl name='sysdict_copy' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67840'>
        <var-decl name='builtins_copy' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67904'>
        <var-decl name='eval_frame' type-id='type-id-341' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67968'>
        <var-decl name='func_watchers' type-id='type-id-342' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68480'>
        <var-decl name='active_func_watchers' type-id='type-id-343' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68544'>
        <var-decl name='co_extra_user_count' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='68608'>
        <var-decl name='co_extra_freefuncs' type-id='type-id-344' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='868' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84928'>
        <var-decl name='xi' type-id='type-id-345' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85312'>
        <var-decl name='before_forkers' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85376'>
        <var-decl name='after_forkers_parent' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85440'>
        <var-decl name='after_forkers_child' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='876' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='85504'>
        <var-decl name='warnings' type-id='type-id-346' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86016'>
        <var-decl name='atexit' type-id='type-id-347' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86144'>
        <var-decl name='stoptheworld' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='881' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86336'>
        <var-decl name='qsbr' type-id='type-id-349' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86720'>
        <var-decl name='asyncio_tasks_head' type-id='type-id-350' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86848'>
        <var-decl name='asyncio_tasks_lock' type-id='type-id-351' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='897' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86912'>
        <var-decl name='obmalloc' type-id='type-id-352' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='909' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='86976'>
        <var-decl name='audit_hooks' type-id='type-id-5' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='87040'>
        <var-decl name='type_watchers' type-id='type-id-353' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='912' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='87552'>
        <var-decl name='code_watchers' type-id='type-id-354' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='913' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88064'>
        <var-decl name='context_watchers' type-id='type-id-355' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88576'>
        <var-decl name='active_code_watchers' type-id='type-id-343' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='916' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88584'>
        <var-decl name='active_context_watchers' type-id='type-id-343' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='917' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88640'>
        <var-decl name='object_state' type-id='type-id-356' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='919' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='93696'>
        <var-decl name='unicode' type-id='type-id-357' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='920' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='94144'>
        <var-decl name='long_state' type-id='type-id-358' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='921' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='94208'>
        <var-decl name='dtoa' type-id='type-id-359' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='922' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='113728'>
        <var-decl name='func_state' type-id='type-id-360' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='638080'>
        <var-decl name='code_state' type-id='type-id-361' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='638208'>
        <var-decl name='dict_state' type-id='type-id-362' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='638784'>
        <var-decl name='exc_state' type-id='type-id-363' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='639040'>
        <var-decl name='mem_free_queue' type-id='type-id-364' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='639232'>
        <var-decl name='ast' type-id='type-id-365' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='655040'>
        <var-decl name='types' type-id='type-id-366' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1784576'>
        <var-decl name='callable_cache' type-id='type-id-367' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1784832'>
        <var-decl name='common_consts' type-id='type-id-368' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785152'>
        <var-decl name='jit' type-id='type-id-369' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785216'>
        <var-decl name='executor_list_head' type-id='type-id-370' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785280'>
        <var-decl name='executor_deletion_list_head' type-id='type-id-370' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785344'>
        <var-decl name='executor_deletion_list_remaining_capacity' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785408'>
        <var-decl name='trace_run_counter' type-id='type-id-9' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785472'>
        <var-decl name='rare_events' type-id='type-id-371' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785536'>
        <var-decl name='builtins_dict_watcher' type-id='type-id-372' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785600'>
        <var-decl name='monitors' type-id='type-id-373' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785728'>
        <var-decl name='sys_profile_initialized' type-id='type-id-369' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785736'>
        <var-decl name='sys_trace_initialized' type-id='type-id-369' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785792'>
        <var-decl name='sys_profiling_threads' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785856'>
        <var-decl name='sys_tracing_threads' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1785920'>
        <var-decl name='monitoring_callables' type-id='type-id-374' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1795648'>
        <var-decl name='monitoring_tool_names' type-id='type-id-375' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1796160'>
        <var-decl name='monitoring_tool_versions' type-id='type-id-376' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1796672'>
        <var-decl name='cached_objects' type-id='type-id-377' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1797952'>
        <var-decl name='static_objects' type-id='type-id-378' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1799040'>
        <var-decl name='_interactive_src_count' type-id='type-id-12' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='954' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1799104'>
        <var-decl name='_initial_thread' type-id='type-id-379' visibility='default' filepath='./Include/internal/pycore_interp_structs.h' line='965' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pyruntimestate' is-struct='yes' visibility='default' size-in-bits='2530944' filepath='./Include/internal/pycore_runtime_structs.h' line='146' column='1' hash='847e8ee2e8e67e6a' id='type-id-380'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='debug_offsets' type-id='type-id-381' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='_initialized' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='preinitializing' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='preinitialized' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5792'>
        <var-decl name='core_initialized' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='initialized' type-id='type-id-15' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='_finalizing' type-id='type-id-26' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='_finalizing_id' type-id='type-id-33' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='interpreters' type-id='type-id-382' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='main_thread' type-id='type-id-33' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='main_tstate' type-id='type-id-26' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='xi' type-id='type-id-383' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='allocators' type-id='type-id-384' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9024'>
        <var-decl name='obmalloc' type-id='type-id-385' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='pyhash_state' type-id='type-id-386' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='threads' type-id='type-id-387' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='signals' type-id='type-id-388' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18304'>
        <var-decl name='autoTSSkey' type-id='type-id-389' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18368'>
        <var-decl name='trashTSSkey' type-id='type-id-389' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18432'>
        <var-decl name='orig_argv' type-id='type-id-390' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18560'>
        <var-decl name='parser' type-id='type-id-391' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19072'>
        <var-decl name='atexit' type-id='type-id-392' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21248'>
        <var-decl name='imports' type-id='type-id-393' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21568'>
        <var-decl name='ceval' type-id='type-id-394' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80128'>
        <var-decl name='gilstate' type-id='type-id-395' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80256'>
        <var-decl name='getargs' type-id='type-id-396' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80320'>
        <var-decl name='fileutils' type-id='type-id-397' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80384'>
        <var-decl name='faulthandler' type-id='type-id-398' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='81792'>
        <var-decl name='tracemalloc' type-id='type-id-399' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='83648'>
        <var-decl name='ref_tracer' type-id='type-id-400' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='83776'>
        <var-decl name='stoptheworld_mutex' type-id='type-id-401' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='83840'>
        <var-decl name='stoptheworld' type-id='type-id-348' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84032'>
        <var-decl name='preconfig' type-id='type-id-402' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84352'>
        <var-decl name='open_code_hook' type-id='type-id-403' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84416'>
        <var-decl name='open_code_userdata' type-id='type-id-22' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84480'>
        <var-decl name='audit_hooks' type-id='type-id-404' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84608'>
        <var-decl name='object_state' type-id='type-id-405' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84640'>
        <var-decl name='float_state' type-id='type-id-406' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84736'>
        <var-decl name='unicode_state' type-id='type-id-407' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='84864'>
        <var-decl name='types' type-id='type-id-408' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='111808'>
        <var-decl name='time' type-id='type-id-409' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='111872'>
        <var-decl name='cached_objects' type-id='type-id-410' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='111936'>
        <var-decl name='static_objects' type-id='type-id-411' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='724544'>
        <var-decl name='_main_interpreter' type-id='type-id-412' visibility='default' filepath='./Include/internal/pycore_runtime_structs.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-22' restrict='yes' id='type-id-413'/>
    <var-decl name='Py_IsolatedFlag' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pydebug.h' line='22' column='1'/>
    <var-decl name='_Py_perfmap_callbacks' type-id='type-id-414' visibility='default' filepath='./Include/internal/pycore_ceval.h' line='110' column='1'/>
    <var-decl name='_Py_perfmap_jit_callbacks' type-id='type-id-414' visibility='default' filepath='./Include/internal/pycore_ceval.h' line='111' column='1'/>
    <var-decl name='PyExc_Exception' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='77' column='1'/>
    <var-decl name='PyExc_ImportError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='93' column='1'/>
    <var-decl name='PyExc_PermissionError' type-id='type-id-5' visibility='default' filepath='./Include/pyerrors.h' line='136' column='1'/>
    <typedef-decl name='PyThread_type_lock' type-id='type-id-22' filepath='./Include/pythread.h' line='4' column='1' id='type-id-415'/>
    <var-decl name='PyFrozenSet_Type' type-id='type-id-3' visibility='default' filepath='./Include/setobject.h' line='10' column='1'/>
    <function-decl name='_PySys_GetRequiredAttr' mangled-name='_PySys_GetRequiredAttr' filepath='./Python/sysmodule.c' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetRequiredAttr' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PySys_GetRequiredAttrString' mangled-name='_PySys_GetRequiredAttrString' filepath='./Python/sysmodule.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetRequiredAttrString' hash='65b6095a7d5e0231'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_PySys_GetOptionalAttr' mangled-name='_PySys_GetOptionalAttr' filepath='./Python/sysmodule.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetOptionalAttr' hash='f176083bd0e67192'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_PySys_GetOptionalAttrString' mangled-name='_PySys_GetOptionalAttrString' filepath='./Python/sysmodule.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetOptionalAttrString' hash='e2cdc5ea58ba192b'>
      <parameter type-id='type-id-23' name='name' filepath='./Python/sysmodule.c' line='136' column='1'/>
      <parameter type-id='type-id-289' name='value' filepath='./Python/sysmodule.c' line='136' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySys_GetObject' mangled-name='PySys_GetObject' filepath='./Python/sysmodule.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetObject' hash='65b6095a7d5e0231'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySys_SetObject' mangled-name='PySys_SetObject' filepath='./Python/sysmodule.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetObject' hash='258b661d16198aff'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySys_Audit' mangled-name='PySys_Audit' filepath='./Python/sysmodule.c' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_Audit' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySys_AuditTuple' mangled-name='PySys_AuditTuple' filepath='./Python/sysmodule.c' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AuditTuple' hash='258b661d16198aff'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySys_AddAuditHook' mangled-name='PySys_AddAuditHook' filepath='./Python/sysmodule.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddAuditHook' hash='a7f99494147764a8'>
      <parameter type-id='type-id-416' name='hook' filepath='./Python/sysmodule.c' line='468' column='1'/>
      <parameter type-id='type-id-22' name='userData' filepath='./Python/sysmodule.c' line='468' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_PySys_GetSizeOf' mangled-name='_PySys_GetSizeOf' filepath='./Python/sysmodule.c' line='1919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetSizeOf' hash='243368eaa45734f1'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='PyUnstable_PerfMapState_Init' mangled-name='PyUnstable_PerfMapState_Init' filepath='./Python/sysmodule.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_PerfMapState_Init' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyUnstable_WritePerfMapEntry' mangled-name='PyUnstable_WritePerfMapEntry' filepath='./Python/sysmodule.c' line='2690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_WritePerfMapEntry' hash='e1b1dc733045e57a'>
      <parameter type-id='type-id-22' name='code_addr' filepath='./Python/sysmodule.c' line='2691' column='1'/>
      <parameter type-id='type-id-105' name='code_size' filepath='./Python/sysmodule.c' line='2692' column='1'/>
      <parameter type-id='type-id-23' name='entry_name' filepath='./Python/sysmodule.c' line='2693' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyUnstable_PerfMapState_Fini' mangled-name='PyUnstable_PerfMapState_Fini' filepath='./Python/sysmodule.c' line='2710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_PerfMapState_Fini' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyUnstable_CopyPerfMapFile' mangled-name='PyUnstable_CopyPerfMapFile' filepath='./Python/sysmodule.c' line='2725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnstable_CopyPerfMapFile' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySys_ResetWarnOptions' mangled-name='PySys_ResetWarnOptions' filepath='./Python/sysmodule.c' line='3034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_ResetWarnOptions' hash='7f32ffea222edbe7'>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOptionUnicode' mangled-name='PySys_AddWarnOptionUnicode' filepath='./Python/sysmodule.c' line='3071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOptionUnicode' hash='037d575bc520db4e'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOption' mangled-name='PySys_AddWarnOption' filepath='./Python/sysmodule.c' line='3084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOption' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-59' name='path' filepath='./Python/sysmodule.c' line='4188' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_HasWarnOptions' mangled-name='PySys_HasWarnOptions' filepath='./Python/sysmodule.c' line='3104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_HasWarnOptions' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySys_AddXOption' mangled-name='PySys_AddXOption' filepath='./Python/sysmodule.c' line='3194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddXOption' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-59' name='path' filepath='./Python/sysmodule.c' line='4188' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_GetXOptions' mangled-name='PySys_GetXOptions' filepath='./Python/sysmodule.c' line='3208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetXOptions' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySys_SetPath' mangled-name='PySys_SetPath' filepath='./Python/sysmodule.c' line='4188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetPath' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-59' name='path' filepath='./Python/sysmodule.c' line='4188' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_SetArgvEx' mangled-name='PySys_SetArgvEx' filepath='./Python/sysmodule.c' line='4220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgvEx' hash='bdd8dbc2bfd729da'>
      <parameter type-id='type-id-15' name='argc' filepath='./Python/sysmodule.c' line='4220' column='1'/>
      <parameter type-id='type-id-417' name='argv' filepath='./Python/sysmodule.c' line='4220' column='1'/>
      <parameter type-id='type-id-15' name='updatepath' filepath='./Python/sysmodule.c' line='4220' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_SetArgv' mangled-name='PySys_SetArgv' filepath='./Python/sysmodule.c' line='4267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgv' hash='207dd5f9cde56c6e'>
      <parameter type-id='type-id-15' name='argc' filepath='./Python/sysmodule.c' line='4267' column='1'/>
      <parameter type-id='type-id-417' name='argv' filepath='./Python/sysmodule.c' line='4267' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_WriteStdout' mangled-name='PySys_WriteStdout' filepath='./Python/sysmodule.c' line='4363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStdout' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_WriteStderr' mangled-name='PySys_WriteStderr' filepath='./Python/sysmodule.c' line='4373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStderr' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_FormatStdout' mangled-name='PySys_FormatStdout' filepath='./Python/sysmodule.c' line='4406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStdout' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_FormatStderr' mangled-name='PySys_FormatStderr' filepath='./Python/sysmodule.c' line='4416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStderr' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-23'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <var-decl name='stdin' type-id='type-id-112' visibility='default' filepath='/usr/include/stdio.h' line='149' column='1' elf-symbol-id='stdin'/>
    <function-decl name='fflush' filepath='/usr/include/stdio.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fflush' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fdopen' filepath='/usr/include/stdio.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdopen' hash='d349589486dab414'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='fputc' filepath='/usr/include/stdio.h' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc' hash='786b934284675a7b'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fputs' filepath='/usr/include/stdio.h' line='707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputs' hash='061050344b66951b'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fwrite' filepath='/usr/include/stdio.h' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwrite' hash='c5b905d4e2f958f3'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='feof' filepath='/usr/include/stdio.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-type size-in-bits='64' hash='8425e3fc2c69f417' id='type-id-418'>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='6ca0e27fceda7f0b' id='type-id-419'>
      <parameter type-id='type-id-420'/>
      <parameter type-id='type-id-421'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='fdf3aa2710b0cc20' id='type-id-422'>
      <parameter type-id='type-id-423'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='abcaa1d174ab30d7' id='type-id-424'>
      <parameter type-id='type-id-425'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='161cc593014d307b' id='type-id-426'>
      <parameter type-id='type-id-427'/>
      <parameter type-id='type-id-428'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='78f2840c9e11cc65' id='type-id-429'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='c69f684b85ad0d88' id='type-id-430'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='258b661d16198aff' id='type-id-431'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='52fe15b72ddd0f65' id='type-id-432'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-421'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-433'>
      <return type-id='type-id-22'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/config.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/gcmodule.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <enum-decl name='_PyGC_Reason' naming-typedef-id='type-id-434' size-in-bits='32' alignment-in-bits='32' filepath='./Include/internal/pycore_gc.h' line='148' column='1' hash='eb8572e8c20a3a45' id='type-id-435'>
      <underlying-type type-id='type-id-120'/>
      <enumerator name='_Py_GC_REASON_HEAP' value='0'/>
      <enumerator name='_Py_GC_REASON_SHUTDOWN' value='1'/>
      <enumerator name='_Py_GC_REASON_MANUAL' value='2'/>
    </enum-decl>
    <typedef-decl name='_PyGC_Reason' type-id='type-id-435' size-in-bits='32' alignment-in-bits='32' filepath='./Include/internal/pycore_gc.h' line='157' column='1' hash='eb8572e8c20a3a45' id='type-id-434'/>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='Modules/gcmodule.c' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc' hash='037d575bc520db4e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/main.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <var-decl name='Py_InspectFlag' type-id='type-id-15' visibility='default' filepath='./Include/cpython/pydebug.h' line='12' column='1'/>
    <function-decl name='getc' filepath='/usr/include/stdio.h' line='576' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getc' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='ungetc' filepath='/usr/include/stdio.h' line='721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ungetc' hash='786b934284675a7b'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='perror' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='Py_RunMain' mangled-name='Py_RunMain' filepath='Modules/main.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_RunMain' hash='388da3fa973fde78'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='Modules/main.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main' hash='c8f0b503d1c0fefb'>
      <parameter type-id='type-id-15' name='argc' filepath='Modules/main.c' line='802' column='1'/>
      <parameter type-id='type-id-417' name='argv' filepath='Modules/main.c' line='802' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='Py_BytesMain' mangled-name='Py_BytesMain' filepath='Modules/main.c' line='814' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_BytesMain' hash='98c8271a447e5c5c'>
      <parameter type-id='type-id-15' name='argc' filepath='Modules/main.c' line='814' column='1'/>
      <parameter type-id='type-id-276' name='argv' filepath='Modules/main.c' line='814' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/abstract.c' comp-dir-path='/home/zach/code/github.com/python/worktrees/cpython/review' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-146' size-in-bits='unknown' hash='6915b710ae33e54a' id='type-id-52'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-436'/>
    </array-type-def>
    <class-decl name='PyListObject' is-struct='yes' naming-typedef-id='type-id-437' visibility='default' size-in-bits='320' filepath='./Include/cpython/listobject.h' line='5' column='1' hash='e0fb44958a7de985' id='type-id-438'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-77' visibility='default' filepath='./Include/cpython/listobject.h' line='6' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_item' type-id='type-id-289' visibility='default' filepath='./Include/cpython/listobject.h' line='8' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='allocated' type-id='type-id-12' visibility='default' filepath='./Include/cpython/listobject.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyListObject' type-id='type-id-438' size-in-bits='320' filepath='./Include/cpython/listobject.h' line='22' column='1' id='type-id-437'/>
    <typedef-decl name='_Py_simple_func' type-id='type-id-439' size-in-bits='64' filepath='./Include/internal/pycore_crossinterp.h' line='26' column='1' hash='fd7a63c0c6c822c4' id='type-id-440'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' hash='97267f7dd4b39e75' id='type-id-441'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='10a23afeebb7488b' id='type-id-442'/>
    <qualified-type-def type-id='type-id-443' const='yes' hash='4f573491bd5a53e9' id='type-id-444'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' hash='13f8ca305bed7d7b' id='type-id-445'/>
    <qualified-type-def type-id='type-id-12' const='yes' hash='a94911d78f3431fd' id='type-id-446'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' hash='e2a7c3907994fdb5' id='type-id-447'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-3' visibility='default' filepath='./Include/bytearrayobject.h' line='20' column='1'/>
    <var-decl name='PyComplex_Type' type-id='type-id-3' visibility='default' filepath='./Include/complexobject.h' line='11' column='1'/>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='Objects/abstract.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint' hash='654c688c672be4c2'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyMapping_GetOptionalItem' mangled-name='PyMapping_GetOptionalItem' filepath='Objects/abstract.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetOptionalItem' hash='0807c43bd0df6a5a'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem' hash='63c03439f3e9ae1a'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString' hash='3b98d83926d2d2d8'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='Objects/abstract.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckBuffer' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer' hash='580f243fc519f291'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='372' column='1'/>
      <parameter type-id='type-id-448' name='buffer' filepath='Objects/abstract.c' line='373' column='1'/>
      <parameter type-id='type-id-449' name='buffer_len' filepath='Objects/abstract.c' line='374' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer' hash='4e8b341d97851d68'>
      <parameter type-id='type-id-5' name='obj' filepath='Objects/abstract.c' line='400' column='1'/>
      <parameter type-id='type-id-450' name='buffer' filepath='Objects/abstract.c' line='401' column='1'/>
      <parameter type-id='type-id-449' name='buffer_len' filepath='Objects/abstract.c' line='402' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer' hash='c7b354fc0c814775'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous' hash='f5271a693a76bf05'>
      <parameter type-id='type-id-445' name='view' filepath='Objects/abstract.c' line='518' column='1'/>
      <parameter type-id='type-id-146' name='order' filepath='Objects/abstract.c' line='518' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer' hash='3be4f7761e43ee7c'>
      <parameter type-id='type-id-445' name='view' filepath='Objects/abstract.c' line='534' column='1'/>
      <parameter type-id='type-id-447' name='indices' filepath='Objects/abstract.c' line='534' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='PyBuffer_SizeFromFormat' mangled-name='PyBuffer_SizeFromFormat' filepath='Objects/abstract.c' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_SizeFromFormat' hash='37acfa132d6f01f2'>
      <parameter type-id='type-id-23' name='format' filepath='Objects/abstract.c' line='582' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='617' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous' hash='96a7f9759f1d44f2'>
      <parameter type-id='type-id-445' name='view' filepath='Objects/abstract.c' line='617' column='1'/>
      <parameter type-id='type-id-22' name='buf' filepath='Objects/abstract.c' line='617' column='1'/>
      <parameter type-id='type-id-12' name='len' filepath='Objects/abstract.c' line='617' column='1'/>
      <parameter type-id='type-id-146' name='fort' filepath='Objects/abstract.c' line='617' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides' hash='aef32007a30c6530'>
      <parameter type-id='type-id-15' name='nd' filepath='Objects/abstract.c' line='740' column='1'/>
      <parameter type-id='type-id-449' name='shape' filepath='Objects/abstract.c' line='740' column='1'/>
      <parameter type-id='type-id-449' name='strides' filepath='Objects/abstract.c' line='741' column='1'/>
      <parameter type-id='type-id-15' name='itemsize' filepath='Objects/abstract.c' line='741' column='1'/>
      <parameter type-id='type-id-146' name='fort' filepath='Objects/abstract.c' line='742' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo' hash='2da70e1c36f66744'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release' hash='1a8614bcd1dd8acc'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='_PyBuffer_ReleaseInInterpreter' mangled-name='_PyBuffer_ReleaseInInterpreter' filepath='Objects/abstract.c' line='829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBuffer_ReleaseInInterpreter' hash='9e52ab48110a38e6'>
      <parameter type-id='type-id-114' name='interp' filepath='Objects/abstract.c' line='836' column='1'/>
      <parameter type-id='type-id-25' name='view' filepath='Objects/abstract.c' line='837' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_PyBuffer_ReleaseInInterpreterAndRawFree' mangled-name='_PyBuffer_ReleaseInInterpreterAndRawFree' filepath='Objects/abstract.c' line='836' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBuffer_ReleaseInInterpreterAndRawFree' hash='9e52ab48110a38e6'>
      <parameter type-id='type-id-114' name='interp' filepath='Objects/abstract.c' line='836' column='1'/>
      <parameter type-id='type-id-25' name='view' filepath='Objects/abstract.c' line='837' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='903' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='1119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='1120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='1121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='1122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='1123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='1124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='1166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='1184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='1185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='1186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='1187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='Objects/abstract.c' line='1288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='Objects/abstract.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='Objects/abstract.c' line='1290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='Objects/abstract.c' line='1291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='Objects/abstract.c' line='1292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='Objects/abstract.c' line='1293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='Objects/abstract.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='Objects/abstract.c' line='1297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='Objects/abstract.c' line='1320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='Objects/abstract.c' line='1349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='Objects/abstract.c' line='1381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='Objects/abstract.c' line='1382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='Objects/abstract.c' line='1383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='Objects/abstract.c' line='1384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='Objects/abstract.c' line='1388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_PyNumber_Index' mangled-name='_PyNumber_Index' filepath='Objects/abstract.c' line='1400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyNumber_Index' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='Objects/abstract.c' line='1446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='Objects/abstract.c' line='1458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t' hash='fb1738967c3f94b2'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='Objects/abstract.c' line='1509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='Objects/abstract.c' line='1592' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='Objects/abstract.c' line='1653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase' hash='e9303b5cae6b9508'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='Objects/abstract.c' line='1672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='Objects/abstract.c' line='1681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='Objects/abstract.c' line='1705' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='Objects/abstract.c' line='1712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='Objects/abstract.c' line='1738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat' hash='9b79932cbc51c9a6'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='Objects/abstract.c' line='1769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='Objects/abstract.c' line='1798' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat' hash='9b79932cbc51c9a6'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='Objects/abstract.c' line='1832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem' hash='9b79932cbc51c9a6'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='Objects/abstract.c' line='1862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice' hash='9abb5d4f1da618ef'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='Objects/abstract.c' line='1884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem' hash='b4ea4a9949b53d1b'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='Objects/abstract.c' line='1917' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem' hash='e42a80ecf1ee5bbb'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='Objects/abstract.c' line='1950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice' hash='23e90af314a8f60f'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='Objects/abstract.c' line='1973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice' hash='54412ea11b1cfe78'>
      <parameter type-id='type-id-5' name='s' filepath='Objects/abstract.c' line='1973' column='1'/>
      <parameter type-id='type-id-12' name='i1' filepath='Objects/abstract.c' line='1973' column='1'/>
      <parameter type-id='type-id-12' name='i2' filepath='Objects/abstract.c' line='1973' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='Objects/abstract.c' line='1996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='Objects/abstract.c' line='2072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List' hash='8759147de6871040'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='Objects/abstract.c' line='2095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast' hash='0de31c15d18813e8'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='Objects/abstract.c' line='2222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count' hash='fb1738967c3f94b2'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='Objects/abstract.c' line='2231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='Objects/abstract.c' line='2246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='Objects/abstract.c' line='2252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index' hash='fb1738967c3f94b2'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='Objects/abstract.c' line='2260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='Objects/abstract.c' line='2267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='Objects/abstract.c' line='2292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='Objects/abstract.c' line='2299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString' hash='0de31c15d18813e8'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='PyMapping_GetOptionalItemString' mangled-name='PyMapping_GetOptionalItemString' filepath='Objects/abstract.c' line='2316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetOptionalItemString' hash='b2069ba31279d3ef'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-289'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='Objects/abstract.c' line='2334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString' hash='dc433dc161735f10'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyStringWithError' mangled-name='PyMapping_HasKeyStringWithError' filepath='Objects/abstract.c' line='2353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyStringWithError' hash='3b98d83926d2d2d8'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyWithError' mangled-name='PyMapping_HasKeyWithError' filepath='Objects/abstract.c' line='2362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyWithError' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-15'/>
    </function-decl>
