<abi-corpus version='2.0' path='libpython3.9.so' soname='libpython3.9.so.1.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_AddPyObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_Free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_Malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyArena_New' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='_PyRuntime' size='656' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PySet_Dummy' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_CallableProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_ProxyType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_PyWeakref_RefType' size='408' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_CheckRecursionLimit' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_EllipsisObject' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_FalseStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_HashSecret' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NoneStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_NotImplementedStruct' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_PackageContext' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_SwappedOp' size='24' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_TrueStruct' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_UnhandledKeyboardInterrupt' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ascii_whitespace' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_table' size='1024' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_tolower' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_ctype_toupper' size='256' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_path_config' size='48' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Py_tracemalloc_config' size='12' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='./Modules/_functoolsmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='_PyDict_Pop_KnownHash' filepath='./Include/cpython/dictobject.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/_iomodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <var-decl name='_PyIO_Module' type-id='type-id-3' visibility='default' filepath='./Modules/_io/_iomodule.h' line='140' column='1'/>
    <var-decl name='_PyIO_str_close' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='159' column='1'/>
    <var-decl name='_PyIO_str_closed' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='160' column='1'/>
    <var-decl name='_PyIO_str_decode' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='161' column='1'/>
    <var-decl name='_PyIO_str_encode' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='162' column='1'/>
    <var-decl name='_PyIO_str_fileno' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='163' column='1'/>
    <var-decl name='_PyIO_str_flush' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='164' column='1'/>
    <var-decl name='_PyIO_str_getstate' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='165' column='1'/>
    <var-decl name='_PyIO_str_isatty' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='166' column='1'/>
    <var-decl name='_PyIO_str_newlines' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='167' column='1'/>
    <var-decl name='_PyIO_str_nl' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='168' column='1'/>
    <var-decl name='_PyIO_str_peek' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='169' column='1'/>
    <var-decl name='_PyIO_str_read' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='170' column='1'/>
    <var-decl name='_PyIO_str_read1' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='171' column='1'/>
    <var-decl name='_PyIO_str_readable' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='172' column='1'/>
    <var-decl name='_PyIO_str_readall' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='173' column='1'/>
    <var-decl name='_PyIO_str_readinto' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='174' column='1'/>
    <var-decl name='_PyIO_str_readline' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='175' column='1'/>
    <var-decl name='_PyIO_str_reset' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='176' column='1'/>
    <var-decl name='_PyIO_str_seek' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='177' column='1'/>
    <var-decl name='_PyIO_str_seekable' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='178' column='1'/>
    <var-decl name='_PyIO_str_setstate' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='179' column='1'/>
    <var-decl name='_PyIO_str_tell' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='180' column='1'/>
    <var-decl name='_PyIO_str_truncate' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='181' column='1'/>
    <var-decl name='_PyIO_str_writable' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='182' column='1'/>
    <var-decl name='_PyIO_str_write' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='183' column='1'/>
    <var-decl name='_PyIO_empty_str' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='185' column='1'/>
    <var-decl name='_PyIO_empty_bytes' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='186' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bufferedio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <typedef-decl name='Py_off_t' type-id='type-id-4' filepath='./Modules/_io/_iomodule.h' line='106' column='1' id='type-id-5'/>
    <typedef-decl name='off_t' type-id='type-id-6' filepath='/usr/include/stdio.h' line='65' column='1' id='type-id-4'/>
    <var-decl name='PyBufferedIOBase_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='10' column='1'/>
    <var-decl name='PyBufferedReader_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='17' column='1'/>
    <var-decl name='PyBufferedWriter_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='18' column='1'/>
    <var-decl name='PyBufferedRWPair_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='19' column='1'/>
    <var-decl name='PyBufferedRandom_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='20' column='1'/>
    <function-decl name='_PyIOBase_check_readable' filepath='./Modules/_io/_iomodule.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_writable' filepath='./Modules/_io/_iomodule.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_seekable' filepath='./Modules/_io/_iomodule.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyFileIO_closed' filepath='./Modules/_io/_iomodule.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNumber_AsOff_t' filepath='./Modules/_io/_iomodule.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bytesio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <var-decl name='PyBytesIO_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='15' column='1'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-7' mangled-name='_PyBytesIOBuffer_Type' visibility='default' filepath='./Modules/_io/_iomodule.h' line='188' column='1' elf-symbol-id='_PyBytesIOBuffer_Type'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/fileio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <var-decl name='PyFileIO_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='14' column='1'/>
    <function-decl name='_PyIOBase_finalize' filepath='./Modules/_io/_iomodule.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/iobase.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <class-decl name='_PyIO_State' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-9' visibility='default' filepath='./Modules/_io/_iomodule.h' line='142' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-8' visibility='default' filepath='./Modules/_io/_iomodule.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='locale_module' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unsupported_operation' type-id='type-id-1' visibility='default' filepath='./Modules/_io/_iomodule.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyIO_State' type-id='type-id-10' filepath='./Modules/_io/_iomodule.h' line='147' column='1' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-11'/>
    <var-decl name='PyIOBase_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='8' column='1'/>
    <var-decl name='PyRawIOBase_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='9' column='1'/>
    <function-decl name='_PyIO_trap_eintr' filepath='./Modules/_io/_iomodule.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyIO_get_module_state' filepath='./Modules/_io/_iomodule.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/stringio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <var-decl name='PyStringIO_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='16' column='1'/>
    <function-decl name='_PyIncrementalNewlineDecoder_decode' filepath='./Modules/_io/_iomodule.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_find_line_ending' filepath='./Modules/_io/_iomodule.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/textio.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <var-decl name='PyTextIOBase_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='11' column='1'/>
    <var-decl name='PyTextIOWrapper_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='21' column='1'/>
    <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-7' visibility='default' filepath='./Modules/_io/_iomodule.h' line='22' column='1'/>
    <function-decl name='_PyIOBase_check_closed' filepath='./Modules/_io/_iomodule.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_get_locale_module' filepath='./Modules/_io/_iomodule.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_localemodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='gettext' filepath='/usr/include/libintl.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dgettext' filepath='/usr/include/libintl.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='textdomain' filepath='/usr/include/libintl.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='bindtextdomain' filepath='/usr/include/libintl.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='bind_textdomain_codeset' filepath='/usr/include/libintl.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='wcscoll' filepath='/usr/include/wchar.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='wcsxfrm' filepath='/usr/include/wchar.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_sre.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='toupper' filepath='/usr/include/ctype.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_tracemalloc.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='_Py_DumpASCII' filepath='./Include/internal/pycore_traceback.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_DumpDecimal' filepath='./Include/internal/pycore_traceback.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Track' mangled-name='PyTraceMalloc_Track' filepath='./Modules/_tracemalloc.c' line='1733' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Track'>
      <parameter type-id='type-id-22' name='domain' filepath='./Modules/_tracemalloc.c' line='1733' column='1'/>
      <parameter type-id='type-id-23' name='ptr' filepath='./Modules/_tracemalloc.c' line='1733' column='1'/>
      <parameter type-id='type-id-19' name='size' filepath='./Modules/_tracemalloc.c' line='1734' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyTraceMalloc_Untrack' mangled-name='PyTraceMalloc_Untrack' filepath='./Modules/_tracemalloc.c' line='1756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTraceMalloc_Untrack'>
      <parameter type-id='type-id-22' name='domain' filepath='./Modules/_tracemalloc.c' line='1756' column='1'/>
      <parameter type-id='type-id-23' name='ptr' filepath='./Modules/_tracemalloc.c' line='1756' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_GetTraceback' mangled-name='_PyTraceMalloc_GetTraceback' filepath='./Modules/_tracemalloc.c' line='1815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_GetTraceback'>
      <parameter type-id='type-id-22' name='domain' filepath='./Modules/_tracemalloc.c' line='1815' column='1'/>
      <parameter type-id='type-id-23' name='ptr' filepath='./Modules/_tracemalloc.c' line='1815' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-21'/>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/faulthandler.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <enum-decl name='__rlimit_resource' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='31' column='1' id='type-id-24'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='RLIMIT_CPU' value='0'/>
      <enumerator name='RLIMIT_FSIZE' value='1'/>
      <enumerator name='RLIMIT_DATA' value='2'/>
      <enumerator name='RLIMIT_STACK' value='3'/>
      <enumerator name='RLIMIT_CORE' value='4'/>
      <enumerator name='__RLIMIT_RSS' value='5'/>
      <enumerator name='RLIMIT_NOFILE' value='7'/>
      <enumerator name='__RLIMIT_OFILE' value='7'/>
      <enumerator name='RLIMIT_AS' value='9'/>
      <enumerator name='__RLIMIT_NPROC' value='6'/>
      <enumerator name='__RLIMIT_MEMLOCK' value='8'/>
      <enumerator name='__RLIMIT_LOCKS' value='10'/>
      <enumerator name='__RLIMIT_SIGPENDING' value='11'/>
      <enumerator name='__RLIMIT_MSGQUEUE' value='12'/>
      <enumerator name='__RLIMIT_NICE' value='13'/>
      <enumerator name='__RLIMIT_RTPRIO' value='14'/>
      <enumerator name='__RLIMIT_RTTIME' value='15'/>
      <enumerator name='__RLIMIT_NLIMITS' value='16'/>
      <enumerator name='__RLIM_NLIMITS' value='16'/>
    </enum-decl>
    <typedef-decl name='rlim_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='133' column='1' id='type-id-27'/>
    <class-decl name='rlimit' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='139' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rlim_cur' type-id='type-id-27' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rlim_max' type-id='type-id-27' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='144' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__rlim64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='158' column='1' id='type-id-26'/>
    <class-decl name='stack_t' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/stack_t.h' line='26' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_sp' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/stack_t.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ss_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/stack_t.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ss_size' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/stack_t.h' line='30' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='stack_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/types/stack_t.h' line='31' column='1' id='type-id-29'/>
    <typedef-decl name='__rlimit_resource_t' type-id='type-id-24' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='38' column='1' id='type-id-32'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-35'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-36'/>
    <qualified-type-def type-id='type-id-36' restrict='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-39'/>
    <qualified-type-def type-id='type-id-39' restrict='yes' id='type-id-40'/>
    <function-decl name='_Py_DumpTraceback' filepath='./Include/internal/pycore_traceback.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='sigaltstack' filepath='/usr/include/signal.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-37'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getauxval' filepath='/usr/include/x86_64-linux-gnu/sys/auxv.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-21'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-42'/>
    <type-decl name='int' size-in-bits='32' id='type-id-8'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-21'/>
    <type-decl name='variadic parameter type' id='type-id-43'/>
    <typedef-decl name='size_t' type-id='type-id-21' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-19'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-15'/>
    <qualified-type-def type-id='type-id-42' const='yes' id='type-id-44'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-12'/>
    <function-decl name='PyOS_snprintf' mangled-name='PyOS_snprintf' filepath='./Include/pyerrors.h' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_snprintf'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-12'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo'>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='_Py_gitversion' mangled-name='_Py_gitversion' filepath='./Modules/getbuildinfo.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitversion'>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier'>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getpath.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='_Py_FindEnvConfigValue' filepath='./Include/internal/pycore_pathconfig.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='wcscpy' filepath='/usr/include/wchar.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='wcscat' filepath='/usr/include/wchar.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='wcsncat' filepath='/usr/include/wchar.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-48'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/posixmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-49' size-in-bits='1024' id='type-id-50'>
      <subrange length='16' type-id='type-id-21' id='type-id-51'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-52' size-in-bits='256' id='type-id-53'>
      <subrange length='32' type-id='type-id-21' id='type-id-54'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='2048' id='type-id-55'>
      <subrange length='256' type-id='type-id-21' id='type-id-56'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='520' id='type-id-57'>
      <subrange length='65' type-id='type-id-21' id='type-id-58'/>
    </array-type-def>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-59'/>
    <class-decl name='__spawn_action' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-60'/>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='512' id='type-id-61'>
      <subrange length='16' type-id='type-id-21' id='type-id-51'/>
    </array-type-def>
    <typedef-decl name='DIR' type-id='type-id-59' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-62'/>
    <class-decl name='posix_spawnattr_t' size-in-bits='2688' is-struct='yes' naming-typedef-id='type-id-63' visibility='default' filepath='/usr/include/spawn.h' line='29' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__flags' type-id='type-id-65' visibility='default' filepath='/usr/include/spawn.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__pgrp' type-id='type-id-66' visibility='default' filepath='/usr/include/spawn.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__sd' type-id='type-id-67' visibility='default' filepath='/usr/include/spawn.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__ss' type-id='type-id-67' visibility='default' filepath='/usr/include/spawn.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='__sp' type-id='type-id-68' visibility='default' filepath='/usr/include/spawn.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='__policy' type-id='type-id-8' visibility='default' filepath='/usr/include/spawn.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='__pad' type-id='type-id-61' visibility='default' filepath='/usr/include/spawn.h' line='37' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='posix_spawnattr_t' type-id='type-id-64' filepath='/usr/include/spawn.h' line='38' column='1' id='type-id-63'/>
    <class-decl name='posix_spawn_file_actions_t' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-69' visibility='default' filepath='/usr/include/spawn.h' line='43' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__allocated' type-id='type-id-8' visibility='default' filepath='/usr/include/spawn.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__used' type-id='type-id-8' visibility='default' filepath='/usr/include/spawn.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__actions' type-id='type-id-71' visibility='default' filepath='/usr/include/spawn.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__pad' type-id='type-id-61' visibility='default' filepath='/usr/include/spawn.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='posix_spawn_file_actions_t' type-id='type-id-70' filepath='/usr/include/spawn.h' line='49' column='1' id='type-id-69'/>
    <typedef-decl name='__compar_fn_t' type-id='type-id-72' filepath='/usr/include/stdlib.h' line='816' column='1' id='type-id-73'/>
    <typedef-decl name='__cpu_mask' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='32' column='1' id='type-id-49'/>
    <class-decl name='cpu_set_t' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-74' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='39' column='1' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__bits' type-id='type-id-50' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='41' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cpu_set_t' type-id='type-id-75' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='42' column='1' id='type-id-74'/>
    <class-decl name='dirent' size-in-bits='2240' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='22' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-77' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-6' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-78' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-55' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='winsize' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/ioctl-types.h' line='27' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ws_row' type-id='type-id-78' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/ioctl-types.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ws_col' type-id='type-id-78' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/ioctl-types.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ws_xpixel' type-id='type-id-78' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/ioctl-types.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ws_ypixel' type-id='type-id-78' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/ioctl-types.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='__priority_which' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='187' column='1' id='type-id-81'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='PRIO_PROCESS' value='0'/>
      <enumerator name='PRIO_PGRP' value='1'/>
      <enumerator name='PRIO_USER' value='2'/>
    </enum-decl>
    <class-decl name='statvfs' size-in-bits='896' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='29' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='f_bsize' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f_frsize' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='f_blocks' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_bfree' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_bavail' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_files' type-id='type-id-84' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_ffree' type-id='type-id-84' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_favail' type-id='type-id-84' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_fsid' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_flag' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_namemax' type-id='type-id-21' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='__f_spare' type-id='type-id-85' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/statvfs.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='termios' size-in-bits='480' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='24' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='c_iflag' type-id='type-id-87' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='c_oflag' type-id='type-id-87' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='c_cflag' type-id='type-id-87' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='c_lflag' type-id='type-id-87' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='c_line' type-id='type-id-52' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='c_cc' type-id='type-id-53' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='c_ispeed' type-id='type-id-88' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_ospeed' type-id='type-id-88' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/termios-struct.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='cc_t' type-id='type-id-79' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='23' column='1' id='type-id-52'/>
    <typedef-decl name='speed_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='24' column='1' id='type-id-88'/>
    <typedef-decl name='tcflag_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/termios.h' line='25' column='1' id='type-id-87'/>
    <typedef-decl name='__ino64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='149' column='1' id='type-id-77'/>
    <typedef-decl name='__id_t' type-id='type-id-22' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='159' column='1' id='type-id-89'/>
    <typedef-decl name='__fsblkcnt64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='185' column='1' id='type-id-83'/>
    <typedef-decl name='__fsfilcnt64_t' type-id='type-id-21' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='189' column='1' id='type-id-84'/>
    <typedef-decl name='clock_t' type-id='type-id-90' filepath='/usr/include/x86_64-linux-gnu/bits/types/clock_t.h' line='7' column='1' id='type-id-91'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h' line='26' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-31' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-19' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rusage' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='33' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ru_utime' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ru_stime' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='' type-id='type-id-98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='' type-id='type-id-99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='' type-id='type-id-100' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='' type-id='type-id-101' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='type-id-102' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='' type-id='type-id-104' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='' type-id='type-id-105' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='' type-id='type-id-106' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='type-id-107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='' type-id='type-id-108' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='40' column='1' id='type-id-95'>
      <data-member access='public'>
        <var-decl name='ru_maxrss' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='42' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_maxrss_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='43' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='47' column='1' id='type-id-96'>
      <data-member access='public'>
        <var-decl name='ru_ixrss' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_ixrss_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='50' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='53' column='1' id='type-id-97'>
      <data-member access='public'>
        <var-decl name='ru_idrss' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_idrss_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='56' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='59' column='1' id='type-id-98'>
      <data-member access='public'>
        <var-decl name='ru_isrss' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='61' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_isrss_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='62' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='66' column='1' id='type-id-99'>
      <data-member access='public'>
        <var-decl name='ru_minflt' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='68' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_minflt_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='69' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='72' column='1' id='type-id-100'>
      <data-member access='public'>
        <var-decl name='ru_majflt' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='74' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_majflt_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='75' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='78' column='1' id='type-id-101'>
      <data-member access='public'>
        <var-decl name='ru_nswap' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nswap_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='81' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='85' column='1' id='type-id-102'>
      <data-member access='public'>
        <var-decl name='ru_inblock' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_inblock_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='88' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='91' column='1' id='type-id-103'>
      <data-member access='public'>
        <var-decl name='ru_oublock' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='93' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_oublock_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='94' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__9' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='97' column='1' id='type-id-104'>
      <data-member access='public'>
        <var-decl name='ru_msgsnd' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='99' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_msgsnd_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='100' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__10' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='103' column='1' id='type-id-105'>
      <data-member access='public'>
        <var-decl name='ru_msgrcv' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='105' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_msgrcv_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='106' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__11' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='109' column='1' id='type-id-106'>
      <data-member access='public'>
        <var-decl name='ru_nsignals' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='111' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nsignals_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='112' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__12' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='117' column='1' id='type-id-107'>
      <data-member access='public'>
        <var-decl name='ru_nvcsw' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='119' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nvcsw_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='120' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__13' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='124' column='1' id='type-id-108'>
      <data-member access='public'>
        <var-decl name='ru_nivcsw' type-id='type-id-109' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='126' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_nivcsw_word' type-id='type-id-110' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_rusage.h' line='127' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='sched_param' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_sched_param.h' line='23' column='1' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sched_priority' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_sched_param.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__priority_which_t' type-id='type-id-81' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='40' column='1' id='type-id-111'/>
    <class-decl name='tms' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/times.h' line='32' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tms_utime' type-id='type-id-91' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/times.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tms_stime' type-id='type-id-91' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/times.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tms_cutime' type-id='type-id-91' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/times.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tms_cstime' type-id='type-id-91' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/times.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gid_t' type-id='type-id-113' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='64' column='1' id='type-id-114'/>
    <typedef-decl name='mode_t' type-id='type-id-115' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='69' column='1' id='type-id-116'/>
    <typedef-decl name='uid_t' type-id='type-id-117' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='79' column='1' id='type-id-118'/>
    <typedef-decl name='pid_t' type-id='type-id-119' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='97' column='1' id='type-id-66'/>
    <typedef-decl name='id_t' type-id='type-id-89' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='103' column='1' id='type-id-120'/>
    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='48' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='domainname' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='idtype_t' naming-typedef-id='type-id-122' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='75' column='1' id='type-id-123'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='P_ALL' value='0'/>
      <enumerator name='P_PID' value='1'/>
      <enumerator name='P_PGID' value='2'/>
    </enum-decl>
    <typedef-decl name='idtype_t' type-id='type-id-123' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='79' column='1' id='type-id-122'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-127'/>
    <qualified-type-def type-id='type-id-128' restrict='yes' id='type-id-129'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-130'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-131'/>
    <qualified-type-def type-id='type-id-74' const='yes' id='type-id-132'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-133'/>
    <qualified-type-def type-id='type-id-92' const='yes' id='type-id-134'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-135'/>
    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-136'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <qualified-type-def type-id='type-id-137' restrict='yes' id='type-id-138'/>
    <qualified-type-def type-id='type-id-63' const='yes' id='type-id-139'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-140'/>
    <qualified-type-def type-id='type-id-140' restrict='yes' id='type-id-141'/>
    <qualified-type-def type-id='type-id-68' const='yes' id='type-id-142'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-143'/>
    <qualified-type-def type-id='type-id-143' restrict='yes' id='type-id-144'/>
    <qualified-type-def type-id='type-id-67' const='yes' id='type-id-145'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <qualified-type-def type-id='type-id-146' restrict='yes' id='type-id-147'/>
    <qualified-type-def type-id='type-id-86' const='yes' id='type-id-148'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-149'/>
    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-155'/>
    <qualified-type-def type-id='type-id-155' restrict='yes' id='type-id-156'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-157' restrict='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-159'/>
    <qualified-type-def type-id='type-id-159' restrict='yes' id='type-id-160'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-163'/>
    <qualified-type-def type-id='type-id-163' restrict='yes' id='type-id-164'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-167'/>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-59'/>
    <class-decl name='__spawn_action' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-60'/>
    <function-decl name='_PyEval_ReInitThreads' filepath='./Include/internal/pycore_ceval.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyImport_ReInitLock' filepath='./Include/internal/pycore_import.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PySignal_AfterFork' mangled-name='_PySignal_AfterFork' filepath='./Include/intrcheck.h' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySignal_AfterFork'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyOS_BeforeFork' mangled-name='PyOS_BeforeFork' filepath='./Modules/posixmodule.c' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_BeforeFork'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Parent' mangled-name='PyOS_AfterFork_Parent' filepath='./Modules/posixmodule.c' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Parent'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork_Child' mangled-name='PyOS_AfterFork_Child' filepath='./Modules/posixmodule.c' line='588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork_Child'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='./Modules/posixmodule.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='./Modules/posixmodule.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid'>
      <parameter type-id='type-id-118' name='uid' filepath='./Modules/posixmodule.c' line='636' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromGid' mangled-name='_PyLong_FromGid' filepath='./Modules/posixmodule.c' line='644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromGid'>
      <parameter type-id='type-id-114' name='gid' filepath='./Modules/posixmodule.c' line='644' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='./Modules/posixmodule.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='./Modules/posixmodule.c' line='652' column='1'/>
      <parameter type-id='type-id-166' name='p' filepath='./Modules/posixmodule.c' line='652' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='./Modules/posixmodule.c' line='758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='./Modules/posixmodule.c' line='758' column='1'/>
      <parameter type-id='type-id-154' name='p' filepath='./Modules/posixmodule.c' line='758' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_Sigset_Converter' mangled-name='_Py_Sigset_Converter' filepath='./Modules/posixmodule.c' line='1445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Sigset_Converter'>
      <parameter type-id='type-id-1' name='obj' filepath='./Modules/posixmodule.c' line='1445' column='1'/>
      <parameter type-id='type-id-31' name='addr' filepath='./Modules/posixmodule.c' line='1445' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='opendir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='fdopendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='closedir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rewinddir' filepath='/usr/include/dirent.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='setgroups' filepath='/usr/include/grp.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getgrouplist' filepath='/usr/include/grp.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='initgroups' filepath='/usr/include/grp.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='openpty' filepath='/usr/include/pty.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='forkpty' filepath='/usr/include/pty.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_setparam' filepath='/usr/include/sched.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_getparam' filepath='/usr/include/sched.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-162'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_setscheduler' filepath='/usr/include/sched.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_getscheduler' filepath='/usr/include/sched.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_get_priority_max' filepath='/usr/include/sched.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_get_priority_min' filepath='/usr/include/sched.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_rr_get_interval' filepath='/usr/include/sched.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_setaffinity' filepath='/usr/include/sched.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sched_getaffinity' filepath='/usr/include/sched.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='killpg' filepath='/usr/include/signal.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigaddset' filepath='/usr/include/signal.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawn' filepath='/usr/include/spawn.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnp' filepath='/usr/include/spawn.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_init' filepath='/usr/include/spawn.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_destroy' filepath='/usr/include/spawn.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setsigdefault' filepath='/usr/include/spawn.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setsigmask' filepath='/usr/include/spawn.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-147'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setflags' filepath='/usr/include/spawn.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setpgroup' filepath='/usr/include/spawn.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setschedpolicy' filepath='/usr/include/spawn.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawnattr_setschedparam' filepath='/usr/include/spawn.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-160'/>
      <parameter type-id='type-id-144'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_init' filepath='/usr/include/spawn.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_destroy' filepath='/usr/include/spawn.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addopen' filepath='/usr/include/spawn.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_addclose' filepath='/usr/include/spawn.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='posix_spawn_file_actions_adddup2' filepath='/usr/include/spawn.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='renameat' filepath='/usr/include/stdio.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='ctermid' filepath='/usr/include/stdio.h' line='837' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='unsetenv' filepath='/usr/include/stdlib.h' line='664' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='system' filepath='/usr/include/stdlib.h' line='791' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='qsort' filepath='/usr/include/stdlib.h' line='838' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='getloadavg' filepath='/usr/include/stdlib.h' line='1013' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='faccessat' filepath='/usr/include/unistd.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pipe' filepath='/usr/include/unistd.h' line='437' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pipe2' filepath='/usr/include/unistd.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='chown' filepath='/usr/include/unistd.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fchown' filepath='/usr/include/unistd.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lchown' filepath='/usr/include/unistd.h' line='503' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fchownat' filepath='/usr/include/unistd.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='chdir' filepath='/usr/include/unistd.h' line='517' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fchdir' filepath='/usr/include/unistd.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dup2' filepath='/usr/include/unistd.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='dup3' filepath='/usr/include/unistd.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='execve' filepath='/usr/include/unistd.h' line='572' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fexecve' filepath='/usr/include/unistd.h' line='578' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-128'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='execv' filepath='/usr/include/unistd.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-128'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='nice' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_exit' filepath='/usr/include/unistd.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='pathconf' filepath='/usr/include/unistd.h' line='633' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='fpathconf' filepath='/usr/include/unistd.h' line='637' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='sysconf' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='getppid' filepath='/usr/include/unistd.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='getpgrp' filepath='/usr/include/unistd.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='getpgid' filepath='/usr/include/unistd.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='setpgid' filepath='/usr/include/unistd.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setpgrp' filepath='/usr/include/unistd.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setsid' filepath='/usr/include/unistd.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='getsid' filepath='/usr/include/unistd.h' line='693' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='getuid' filepath='/usr/include/unistd.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='getgid' filepath='/usr/include/unistd.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='getegid' filepath='/usr/include/unistd.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='getgroups' filepath='/usr/include/unistd.h' line='711' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setuid' filepath='/usr/include/unistd.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setreuid' filepath='/usr/include/unistd.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='seteuid' filepath='/usr/include/unistd.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setgid' filepath='/usr/include/unistd.h' line='739' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setregid' filepath='/usr/include/unistd.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setegid' filepath='/usr/include/unistd.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getresuid' filepath='/usr/include/unistd.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getresgid' filepath='/usr/include/unistd.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setresuid' filepath='/usr/include/unistd.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setresgid' filepath='/usr/include/unistd.h' line='770' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fork' filepath='/usr/include/unistd.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='ttyname_r' filepath='/usr/include/unistd.h' line='803' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='link' filepath='/usr/include/unistd.h' line='819' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='linkat' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='symlinkat' filepath='/usr/include/unistd.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='readlinkat' filepath='/usr/include/unistd.h' line='851' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='unlinkat' filepath='/usr/include/unistd.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='rmdir' filepath='/usr/include/unistd.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='tcgetpgrp' filepath='/usr/include/unistd.h' line='871' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='tcsetpgrp' filepath='/usr/include/unistd.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getlogin' filepath='/usr/include/unistd.h' line='881' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='chroot' filepath='/usr/include/unistd.h' line='977' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fsync' filepath='/usr/include/unistd.h' line='989' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sync' filepath='/usr/include/unistd.h' line='1005' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='copy_file_range' filepath='/usr/include/unistd.h' line='1142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='fdatasync' filepath='/usr/include/unistd.h' line='1150' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__sched_cpucount' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__sched_cpualloc' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-152'/>
    </function-decl>
    <function-decl name='__sched_cpufree' filepath='/usr/include/x86_64-linux-gnu/bits/cpu-set.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='memfd_create' filepath='/usr/include/x86_64-linux-gnu/bits/mman-shared.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getpriority' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setpriority' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='chmod' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fchmod' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fchmodat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='umask' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-115'/>
    </function-decl>
    <function-decl name='mkdir' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mkdirat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mknod' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mknodat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mkfifo' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='mkfifoat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='425' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='utimensat' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='futimens' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='gnu_dev_major' filepath='/usr/include/x86_64-linux-gnu/sys/sysmacros.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnu_dev_minor' filepath='/usr/include/x86_64-linux-gnu/sys/sysmacros.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='gnu_dev_makedev' filepath='/usr/include/x86_64-linux-gnu/sys/sysmacros.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-176'/>
    </function-decl>
    <function-decl name='times' filepath='/usr/include/x86_64-linux-gnu/sys/times.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='readv' filepath='/usr/include/x86_64-linux-gnu/sys/uio.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='writev' filepath='/usr/include/x86_64-linux-gnu/sys/uio.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='wait' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='waitpid' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='waitid' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-122'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-178'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='wait3' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='wait4' filepath='/usr/include/x86_64-linux-gnu/sys/wait.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='setxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lsetxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fsetxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='lgetxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='fgetxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='listxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='llistxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='flistxattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-175'/>
    </function-decl>
    <function-decl name='removexattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='lremovexattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fremovexattr' filepath='/usr/include/x86_64-linux-gnu/sys/xattr.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-78'/>
    <function-type size-in-bits='64' id='type-id-179'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/pwdmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <class-decl name='passwd' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/pwd.h' line='49' column='1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pw_name' type-id='type-id-15' visibility='default' filepath='/usr/include/pwd.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pw_passwd' type-id='type-id-15' visibility='default' filepath='/usr/include/pwd.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pw_uid' type-id='type-id-117' visibility='default' filepath='/usr/include/pwd.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pw_gid' type-id='type-id-113' visibility='default' filepath='/usr/include/pwd.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pw_gecos' type-id='type-id-15' visibility='default' filepath='/usr/include/pwd.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pw_dir' type-id='type-id-15' visibility='default' filepath='/usr/include/pwd.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pw_shell' type-id='type-id-15' visibility='default' filepath='/usr/include/pwd.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <qualified-type-def type-id='type-id-181' restrict='yes' id='type-id-182'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-183'/>
    <qualified-type-def type-id='type-id-183' restrict='yes' id='type-id-184'/>
    <function-decl name='setpwent' filepath='/usr/include/pwd.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='endpwent' filepath='/usr/include/pwd.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='getpwent' filepath='/usr/include/pwd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-181'/>
    </function-decl>
    <function-decl name='getpwuid_r' filepath='/usr/include/pwd.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getpwnam_r' filepath='/usr/include/pwd.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/signalmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <enum-decl name='__itimer_which' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='114' column='1' id='type-id-185'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='ITIMER_REAL' value='0'/>
      <enumerator name='ITIMER_VIRTUAL' value='1'/>
      <enumerator name='ITIMER_PROF' value='2'/>
    </enum-decl>
    <class-decl name='itimerval' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='130' column='1' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='it_interval' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='it_value' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__itimer_which_t' type-id='type-id-185' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='141' column='1' id='type-id-187'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-189'/>
    <qualified-type-def type-id='type-id-189' restrict='yes' id='type-id-190'/>
    <qualified-type-def type-id='type-id-188' const='yes' id='type-id-191'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-192'/>
    <qualified-type-def type-id='type-id-192' restrict='yes' id='type-id-193'/>
    <qualified-type-def type-id='type-id-186' const='yes' id='type-id-194'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-195'/>
    <qualified-type-def type-id='type-id-195' restrict='yes' id='type-id-196'/>
    <qualified-type-def type-id='type-id-169' restrict='yes' id='type-id-197'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-198'/>
    <qualified-type-def type-id='type-id-198' restrict='yes' id='type-id-199'/>
    <qualified-type-def type-id='type-id-178' restrict='yes' id='type-id-200'/>
    <function-decl name='_PyErr_CheckSignals' mangled-name='_PyErr_CheckSignals' filepath='./Modules/signalmodule.c' line='1772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyErr_CheckSignals'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='./Modules/signalmodule.c' line='1785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='./Modules/signalmodule.c' line='1794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='1876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='./Modules/signalmodule.c' line='1905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='raise' filepath='/usr/include/signal.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigfillset' filepath='/usr/include/signal.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigismember' filepath='/usr/include/signal.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigpending' filepath='/usr/include/signal.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigwait' filepath='/usr/include/signal.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-197'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigwaitinfo' filepath='/usr/include/signal.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='sigtimedwait' filepath='/usr/include/signal.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-200'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='siginterrupt' filepath='/usr/include/signal.h' line='324' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmin' filepath='/usr/include/signal.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmax' filepath='/usr/include/signal.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strsignal' filepath='/usr/include/string.h' line='478' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='alarm' filepath='/usr/include/unistd.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='pause' filepath='/usr/include/unistd.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_sigmask' filepath='/usr/include/x86_64-linux-gnu/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='pthread_kill' filepath='/usr/include/x86_64-linux-gnu/bits/sigthread.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getitimer' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-198'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='setitimer' filepath='/usr/include/x86_64-linux-gnu/sys/time.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-196'/>
      <parameter type-id='type-id-199'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/timemodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-203' size-in-bits='1024' id='type-id-204'>
      <subrange length='16' type-id='type-id-21' id='type-id-51'/>
    </array-type-def>
    <enum-decl name='__rusage_who' filepath='/usr/include/x86_64-linux-gnu/bits/resource.h' line='158' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-25'/>
      <enumerator name='RUSAGE_SELF' value='0'/>
      <enumerator name='RUSAGE_CHILDREN' value='-1'/>
      <enumerator name='RUSAGE_THREAD' value='1'/>
    </enum-decl>
    <typedef-decl name='__rusage_who_t' type-id='type-id-205' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='39' column='1' id='type-id-206'/>
    <typedef-decl name='__fd_mask' type-id='type-id-109' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='49' column='1' id='type-id-203'/>
    <class-decl name='fd_set' size-in-bits='1024' is-struct='yes' naming-typedef-id='type-id-207' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='59' column='1' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fds_bits' type-id='type-id-204' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='fd_set' type-id='type-id-208' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='70' column='1' id='type-id-207'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <qualified-type-def type-id='type-id-211' const='yes' id='type-id-212'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-213'/>
    <qualified-type-def type-id='type-id-213' restrict='yes' id='type-id-214'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-215'/>
    <qualified-type-def type-id='type-id-215' restrict='yes' id='type-id-216'/>
    <function-decl name='pthread_getcpuclockid' filepath='/usr/include/pthread.h' line='1315' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-210'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='clock' filepath='/usr/include/time.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='tzset' filepath='/usr/include/time.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='clock_settime' filepath='/usr/include/time.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-220'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='wcsftime' filepath='/usr/include/wchar.h' line='852' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='getrusage' filepath='/usr/include/x86_64-linux-gnu/sys/resource.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='select' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/dynload_shlib.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='256' id='type-id-222'>
      <subrange length='4' type-id='type-id-21' id='type-id-223'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-12' size-in-bits='infinite' id='type-id-224'>
      <subrange length='infinite' id='type-id-225'/>
    </array-type-def>
    <var-decl name='_PyImport_DynLoadFiletab' type-id='type-id-224' visibility='default' filepath='./Python/importdl.h' line='9' column='1'/>
    <function-decl name='dlopen' filepath='/usr/include/dlfcn.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='dlerror' filepath='/usr/include/dlfcn.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/getplatform.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='Py_GetPlatform' mangled-name='Py_GetPlatform' filepath='./Python/getplatform.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPlatform'>
      <return type-id='type-id-12'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/importdl.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <typedef-decl name='dl_funcptr' type-id='type-id-227' filepath='./Python/importdl.h' line='20' column='1' id='type-id-228'/>
    <function-decl name='_PyImport_FindSharedFuncptr' filepath='./Python/importdl.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-229'>
      <return type-id='type-id-20'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/initconfig.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <class-decl name='_PyArgv' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='64' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argc' type-id='type-id-14' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_bytes_argv' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bytes_argv' type-id='type-id-128' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wchar_argv' type-id='type-id-231' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyArgv' type-id='type-id-230' filepath='./Include/internal/pycore_initconfig.h' line='69' column='1' id='type-id-232'/>
    <class-decl name='_PyPreCmdline' size-in-bits='384' is-struct='yes' naming-typedef-id='type-id-233' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='97' column='1' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argv' type-id='type-id-235' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xoptions' type-id='type-id-235' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='isolated' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='use_environment' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dev_mode' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyPreCmdline' type-id='type-id-234' filepath='./Include/internal/pycore_initconfig.h' line='103' column='1' id='type-id-233'/>
    <typedef-decl name='nl_item' type-id='type-id-8' filepath='/usr/include/nl_types.h' line='36' column='1' id='type-id-236'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-240'/>
    <qualified-type-def type-id='type-id-237' const='yes' id='type-id-241'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-242'/>
    <qualified-type-def type-id='type-id-235' const='yes' id='type-id-243'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <qualified-type-def type-id='type-id-232' const='yes' id='type-id-245'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <qualified-type-def type-id='type-id-233' const='yes' id='type-id-247'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-248'/>
    <qualified-type-def type-id='type-id-16' restrict='yes' id='type-id-18'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-249'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-48' restrict='yes' id='type-id-17'/>
    <qualified-type-def type-id='type-id-46' restrict='yes' id='type-id-250'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-251'/>
    <function-decl name='_Py_isabs' mangled-name='_Py_isabs' filepath='./Include/cpython/fileutils.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_isabs'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_abspath' mangled-name='_Py_abspath' filepath='./Include/cpython/fileutils.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_abspath'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <var-decl name='Py_UTF8Mode' type-id='type-id-8' mangled-name='Py_UTF8Mode' visibility='default' filepath='./Include/fileobject.h' line='29' column='1' elf-symbol-id='Py_UTF8Mode'/>
    <function-decl name='_Py_GetForceASCII' mangled-name='_Py_GetForceASCII' filepath='./Include/internal/pycore_fileutils.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_GetForceASCII'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyOS_ResetGetOpt' filepath='./Include/internal/pycore_getopt.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyOS_GetOpt' filepath='./Include/internal/pycore_getopt.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyArgv_AsWstrList' mangled-name='_PyArgv_AsWstrList' filepath='./Include/internal/pycore_initconfig.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArgv_AsWstrList'>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_Py_str_to_int' mangled-name='_Py_str_to_int' filepath='./Include/internal/pycore_initconfig.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_str_to_int'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_get_xoption' mangled-name='_Py_get_xoption' filepath='./Include/internal/pycore_initconfig.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_get_xoption'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_Py_GetEnv' mangled-name='_Py_GetEnv' filepath='./Include/internal/pycore_initconfig.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_GetEnv'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='_Py_get_env_flag' mangled-name='_Py_get_env_flag' filepath='./Include/internal/pycore_initconfig.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_get_env_flag'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyPreCmdline_Clear' filepath='./Include/internal/pycore_initconfig.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyPreCmdline_SetConfig' filepath='./Include/internal/pycore_initconfig.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-248'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PyPreCmdline_Read' filepath='./Include/internal/pycore_initconfig.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PyPreConfig_InitFromPreConfig' filepath='./Include/internal/pycore_initconfig.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PyPreConfig_AsDict' filepath='./Include/internal/pycore_initconfig.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyPreConfig_GetConfig' filepath='./Include/internal/pycore_initconfig.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-238'/>
      <parameter type-id='type-id-253'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyConfig_InitPathConfig' filepath='./Include/internal/pycore_initconfig.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <var-decl name='_Py_global_config_int_max_str_digits' type-id='type-id-8' visibility='default' filepath='./Include/internal/pycore_initconfig.h' line='159' column='1'/>
    <function-decl name='_Py_IsLocaleCoercionTarget' mangled-name='_Py_IsLocaleCoercionTarget' filepath='./Include/internal/pycore_pylifecycle.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_IsLocaleCoercionTarget'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PySys_ReadPreinitWarnOptions' filepath='./Include/internal/pycore_pylifecycle.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PySys_ReadPreinitXOptions' filepath='./Include/internal/pycore_pylifecycle.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_Py_PreInitializeFromConfig' mangled-name='_Py_PreInitializeFromConfig' filepath='./Include/internal/pycore_pylifecycle.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_PreInitializeFromConfig'>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-246'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <var-decl name='Py_DebugFlag' type-id='type-id-8' mangled-name='Py_DebugFlag' visibility='default' filepath='./Include/pydebug.h' line='8' column='1' elf-symbol-id='Py_DebugFlag'/>
    <var-decl name='Py_VerboseFlag' type-id='type-id-8' mangled-name='Py_VerboseFlag' visibility='default' filepath='./Include/pydebug.h' line='9' column='1' elf-symbol-id='Py_VerboseFlag'/>
    <var-decl name='Py_QuietFlag' type-id='type-id-8' mangled-name='Py_QuietFlag' visibility='default' filepath='./Include/pydebug.h' line='10' column='1' elf-symbol-id='Py_QuietFlag'/>
    <var-decl name='Py_InteractiveFlag' type-id='type-id-8' mangled-name='Py_InteractiveFlag' visibility='default' filepath='./Include/pydebug.h' line='11' column='1' elf-symbol-id='Py_InteractiveFlag'/>
    <var-decl name='Py_InspectFlag' type-id='type-id-8' mangled-name='Py_InspectFlag' visibility='default' filepath='./Include/pydebug.h' line='12' column='1' elf-symbol-id='Py_InspectFlag'/>
    <var-decl name='Py_OptimizeFlag' type-id='type-id-8' mangled-name='Py_OptimizeFlag' visibility='default' filepath='./Include/pydebug.h' line='13' column='1' elf-symbol-id='Py_OptimizeFlag'/>
    <var-decl name='Py_NoSiteFlag' type-id='type-id-8' mangled-name='Py_NoSiteFlag' visibility='default' filepath='./Include/pydebug.h' line='14' column='1' elf-symbol-id='Py_NoSiteFlag'/>
    <var-decl name='Py_BytesWarningFlag' type-id='type-id-8' mangled-name='Py_BytesWarningFlag' visibility='default' filepath='./Include/pydebug.h' line='15' column='1' elf-symbol-id='Py_BytesWarningFlag'/>
    <var-decl name='Py_FrozenFlag' type-id='type-id-8' mangled-name='Py_FrozenFlag' visibility='default' filepath='./Include/pydebug.h' line='16' column='1' elf-symbol-id='Py_FrozenFlag'/>
    <var-decl name='Py_IgnoreEnvironmentFlag' type-id='type-id-8' mangled-name='Py_IgnoreEnvironmentFlag' visibility='default' filepath='./Include/pydebug.h' line='17' column='1' elf-symbol-id='Py_IgnoreEnvironmentFlag'/>
    <var-decl name='Py_DontWriteBytecodeFlag' type-id='type-id-8' mangled-name='Py_DontWriteBytecodeFlag' visibility='default' filepath='./Include/pydebug.h' line='18' column='1' elf-symbol-id='Py_DontWriteBytecodeFlag'/>
    <var-decl name='Py_NoUserSiteDirectory' type-id='type-id-8' mangled-name='Py_NoUserSiteDirectory' visibility='default' filepath='./Include/pydebug.h' line='19' column='1' elf-symbol-id='Py_NoUserSiteDirectory'/>
    <var-decl name='Py_UnbufferedStdioFlag' type-id='type-id-8' mangled-name='Py_UnbufferedStdioFlag' visibility='default' filepath='./Include/pydebug.h' line='20' column='1' elf-symbol-id='Py_UnbufferedStdioFlag'/>
    <var-decl name='Py_HashRandomizationFlag' type-id='type-id-8' mangled-name='Py_HashRandomizationFlag' visibility='default' filepath='./Include/pydebug.h' line='21' column='1' elf-symbol-id='Py_HashRandomizationFlag'/>
    <var-decl name='Py_IsolatedFlag' type-id='type-id-8' mangled-name='Py_IsolatedFlag' visibility='default' filepath='./Include/pydebug.h' line='22' column='1' elf-symbol-id='Py_IsolatedFlag'/>
    <function-decl name='PyStatus_Ok' mangled-name='PyStatus_Ok' filepath='./Python/initconfig.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStatus_Ok'>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyStatus_Error' mangled-name='PyStatus_Error' filepath='./Python/initconfig.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStatus_Error'>
      <parameter type-id='type-id-12' name='err_msg' filepath='./Python/initconfig.c' line='257' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyStatus_NoMemory' mangled-name='PyStatus_NoMemory' filepath='./Python/initconfig.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStatus_NoMemory'>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyStatus_Exit' mangled-name='PyStatus_Exit' filepath='./Python/initconfig.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStatus_Exit'>
      <parameter type-id='type-id-8' name='exitcode' filepath='./Python/initconfig.c' line='266' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyStatus_IsError' mangled-name='PyStatus_IsError' filepath='./Python/initconfig.c' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStatus_IsError'>
      <parameter type-id='type-id-47' name='status' filepath='./Python/initconfig.c' line='270' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyStatus_IsExit' mangled-name='PyStatus_IsExit' filepath='./Python/initconfig.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyStatus_IsExit'>
      <parameter type-id='type-id-47' name='status' filepath='./Python/initconfig.c' line='273' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyWideStringList_Clear' mangled-name='_PyWideStringList_Clear' filepath='./Python/initconfig.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyWideStringList_Clear'>
      <parameter type-id='type-id-239' name='list' filepath='./Python/initconfig.c' line='299' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyWideStringList_Copy' mangled-name='_PyWideStringList_Copy' filepath='./Python/initconfig.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyWideStringList_Copy'>
      <parameter type-id='type-id-239' name='list' filepath='./Python/initconfig.c' line='312' column='1'/>
      <parameter type-id='type-id-244' name='list2' filepath='./Python/initconfig.c' line='312' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyWideStringList_Insert' mangled-name='PyWideStringList_Insert' filepath='./Python/initconfig.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyWideStringList_Insert'>
      <parameter type-id='type-id-239' name='list' filepath='./Python/initconfig.c' line='347' column='1'/>
      <parameter type-id='type-id-14' name='index' filepath='./Python/initconfig.c' line='348' column='1'/>
      <parameter type-id='type-id-16' name='item' filepath='./Python/initconfig.c' line='348' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyWideStringList_Append' mangled-name='PyWideStringList_Append' filepath='./Python/initconfig.c' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyWideStringList_Append'>
      <parameter type-id='type-id-239' name='list' filepath='./Python/initconfig.c' line='388' column='1'/>
      <parameter type-id='type-id-16' name='item' filepath='./Python/initconfig.c' line='388' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PyWideStringList_Extend' mangled-name='_PyWideStringList_Extend' filepath='./Python/initconfig.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyWideStringList_Extend'>
      <parameter type-id='type-id-239' name='list' filepath='./Python/initconfig.c' line='395' column='1'/>
      <parameter type-id='type-id-244' name='list2' filepath='./Python/initconfig.c' line='395' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PyWideStringList_AsList' mangled-name='_PyWideStringList_AsList' filepath='./Python/initconfig.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyWideStringList_AsList'>
      <parameter type-id='type-id-244' name='list' filepath='./Python/initconfig.c' line='420' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='Py_SetStandardStreamEncoding' mangled-name='Py_SetStandardStreamEncoding' filepath='./Python/initconfig.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_SetStandardStreamEncoding'>
      <parameter type-id='type-id-12' name='encoding' filepath='./Python/initconfig.c' line='451' column='1'/>
      <parameter type-id='type-id-12' name='errors' filepath='./Python/initconfig.c' line='451' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_ClearStandardStreamEncoding' mangled-name='_Py_ClearStandardStreamEncoding' filepath='./Python/initconfig.c' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_ClearStandardStreamEncoding'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_ClearArgcArgv' mangled-name='_Py_ClearArgcArgv' filepath='./Python/initconfig.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_ClearArgcArgv'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='Py_GetArgcArgv' mangled-name='Py_GetArgcArgv' filepath='./Python/initconfig.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetArgcArgv'>
      <parameter type-id='type-id-169' name='argc' filepath='./Python/initconfig.c' line='561' column='1'/>
      <parameter type-id='type-id-251' name='argv' filepath='./Python/initconfig.c' line='561' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyConfig_InitCompatConfig' mangled-name='_PyConfig_InitCompatConfig' filepath='./Python/initconfig.c' line='620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyConfig_InitCompatConfig'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='620' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyConfig_InitIsolatedConfig' mangled-name='PyConfig_InitIsolatedConfig' filepath='./Python/initconfig.c' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_InitIsolatedConfig'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='699' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyConfig_SetString' mangled-name='PyConfig_SetString' filepath='./Python/initconfig.c' line='721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_SetString'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='721' column='1'/>
      <parameter type-id='type-id-46' name='config_str' filepath='./Python/initconfig.c' line='721' column='1'/>
      <parameter type-id='type-id-16' name='str' filepath='./Python/initconfig.c' line='721' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyConfig_SetBytesString' mangled-name='PyConfig_SetBytesString' filepath='./Python/initconfig.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_SetBytesString'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='783' column='1'/>
      <parameter type-id='type-id-46' name='config_str' filepath='./Python/initconfig.c' line='783' column='1'/>
      <parameter type-id='type-id-12' name='str' filepath='./Python/initconfig.c' line='784' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyConfig_SetBytesArgv' mangled-name='PyConfig_SetBytesArgv' filepath='./Python/initconfig.c' line='2516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_SetBytesArgv'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='2516' column='1'/>
      <parameter type-id='type-id-14' name='argc' filepath='./Python/initconfig.c' line='2516' column='1'/>
      <parameter type-id='type-id-128' name='argv' filepath='./Python/initconfig.c' line='2516' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyConfig_SetArgv' mangled-name='PyConfig_SetArgv' filepath='./Python/initconfig.c' line='2528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_SetArgv'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='2528' column='1'/>
      <parameter type-id='type-id-14' name='argc' filepath='./Python/initconfig.c' line='2528' column='1'/>
      <parameter type-id='type-id-231' name='argv' filepath='./Python/initconfig.c' line='2528' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyConfig_SetWideStringList' mangled-name='PyConfig_SetWideStringList' filepath='./Python/initconfig.c' line='2540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_SetWideStringList'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='2540' column='1'/>
      <parameter type-id='type-id-239' name='list' filepath='./Python/initconfig.c' line='2540' column='1'/>
      <parameter type-id='type-id-14' name='length' filepath='./Python/initconfig.c' line='2541' column='1'/>
      <parameter type-id='type-id-46' name='items' filepath='./Python/initconfig.c' line='2541' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='PyConfig_Read' mangled-name='PyConfig_Read' filepath='./Python/initconfig.c' line='2564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyConfig_Read'>
      <parameter type-id='type-id-252' name='config' filepath='./Python/initconfig.c' line='2564' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_Py_GetConfigsAsDict' mangled-name='_Py_GetConfigsAsDict' filepath='./Python/initconfig.c' line='2675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_GetConfigsAsDict'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='setvbuf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='printf' filepath='/usr/include/stdio.h' line='356' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='wcschr' filepath='/usr/include/wchar.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='wcstok' filepath='/usr/include/wchar.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='wcstol' filepath='/usr/include/wchar.h' line='429' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-109'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/sysmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='_PyPathConfig_ComputeSysPath0' filepath='./Include/internal/pycore_pathconfig.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyErr_WriteUnraisableDefaultHook' filepath='./Include/internal/pycore_pylifecycle.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyThread_GetInfo' mangled-name='PyThread_GetInfo' filepath='./Include/pythread.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyThread_GetInfo'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_AddAuditHook' mangled-name='PySys_AddAuditHook' filepath='./Python/sysmodule.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddAuditHook'>
      <parameter type-id='type-id-258' name='hook' filepath='./Python/sysmodule.c' line='361' column='1'/>
      <parameter type-id='type-id-31' name='userData' filepath='./Python/sysmodule.c' line='361' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PySys_GetSizeOf' mangled-name='_PySys_GetSizeOf' filepath='./Python/sysmodule.c' line='1682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetSizeOf'>
      <parameter type-id='type-id-1' name='o' filepath='./Python/sysmodule.c' line='1682' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='PySys_ResetWarnOptions' mangled-name='PySys_ResetWarnOptions' filepath='./Python/sysmodule.c' line='2212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_ResetWarnOptions'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOptionUnicode' mangled-name='PySys_AddWarnOptionUnicode' filepath='./Python/sysmodule.c' line='2240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOptionUnicode'>
      <parameter type-id='type-id-1' name='option' filepath='./Python/sysmodule.c' line='2240' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOption' mangled-name='PySys_AddWarnOption' filepath='./Python/sysmodule.c' line='2252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOption'>
      <parameter type-id='type-id-16' name='s' filepath='./Python/sysmodule.c' line='2252' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_HasWarnOptions' mangled-name='PySys_HasWarnOptions' filepath='./Python/sysmodule.c' line='2268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_HasWarnOptions'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySys_AddXOption' mangled-name='PySys_AddXOption' filepath='./Python/sysmodule.c' line='2342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddXOption'>
      <parameter type-id='type-id-16' name='s' filepath='./Python/sysmodule.c' line='2342' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_GetXOptions' mangled-name='PySys_GetXOptions' filepath='./Python/sysmodule.c' line='2356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetXOptions'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_SetPath' mangled-name='PySys_SetPath' filepath='./Python/sysmodule.c' line='3144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetPath'>
      <parameter type-id='type-id-16' name='path' filepath='./Python/sysmodule.c' line='3144' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_SetArgvEx' mangled-name='PySys_SetArgvEx' filepath='./Python/sysmodule.c' line='3176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgvEx'>
      <parameter type-id='type-id-8' name='argc' filepath='./Python/sysmodule.c' line='3176' column='1'/>
      <parameter type-id='type-id-46' name='argv' filepath='./Python/sysmodule.c' line='3176' column='1'/>
      <parameter type-id='type-id-8' name='updatepath' filepath='./Python/sysmodule.c' line='3176' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_WriteStdout' mangled-name='PySys_WriteStdout' filepath='./Python/sysmodule.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStdout'>
      <parameter type-id='type-id-12' name='format' filepath='./Python/sysmodule.c' line='3313' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySys_FormatStdout' mangled-name='PySys_FormatStdout' filepath='./Python/sysmodule.c' line='3356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStdout'>
      <parameter type-id='type-id-12' name='format' filepath='./Python/sysmodule.c' line='3356' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/config.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='Modules/config.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='Modules/config.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='Modules/config.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='Modules/config.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='Modules/config.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='Modules/config.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='Modules/config.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='Modules/config.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='Modules/config.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__abc' mangled-name='PyInit__abc' filepath='Modules/config.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__abc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='Modules/config.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='Modules/config.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='Modules/config.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='Modules/config.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='Modules/config.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='Modules/config.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='Modules/config.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='Modules/config.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='Modules/config.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='Modules/config.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__peg_parser' mangled-name='PyInit__peg_parser' filepath='Modules/config.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__peg_parser'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='Modules/config.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_xxsubtype' mangled-name='PyInit_xxsubtype' filepath='Modules/config.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_xxsubtype'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='Modules/config.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/gcmodule.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='_PyFrame_ClearFreeList' filepath='./Include/internal/pycore_gc.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyTuple_ClearFreeList' filepath='./Include/internal/pycore_gc.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyFloat_ClearFreeList' filepath='./Include/internal/pycore_gc.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyList_ClearFreeList' filepath='./Include/internal/pycore_gc.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyDict_ClearFreeList' filepath='./Include/internal/pycore_gc.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyAsyncGen_ClearFreeLists' filepath='./Include/internal/pycore_gc.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyContext_ClearFreeList' filepath='./Include/internal/pycore_gc.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='Modules/gcmodule.c' line='2057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect'>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Calloc' mangled-name='_PyObject_GC_Calloc' filepath='Modules/gcmodule.c' line='2298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Calloc'>
      <parameter type-id='type-id-19' name='basicsize' filepath='Modules/gcmodule.c' line='2298' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_IsTracked' mangled-name='PyObject_GC_IsTracked' filepath='Modules/gcmodule.c' line='2363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_IsTracked'>
      <parameter type-id='type-id-1' name='obj' filepath='Modules/gcmodule.c' line='2363' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_GC_IsFinalized' mangled-name='PyObject_GC_IsFinalized' filepath='Modules/gcmodule.c' line='2372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_IsFinalized'>
      <parameter type-id='type-id-1' name='obj' filepath='Modules/gcmodule.c' line='2372' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/main.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <function-decl name='_PyPathConfig_ClearGlobal' filepath='./Include/internal/pycore_pathconfig.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyImport_Fini2' filepath='./Include/internal/pycore_pylifecycle.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='Py_RunMain' mangled-name='Py_RunMain' filepath='Modules/main.c' line='677' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_RunMain'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='Modules/main.c' line='716' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main'>
      <parameter type-id='type-id-8' name='argc' filepath='Modules/main.c' line='716' column='1'/>
      <parameter type-id='type-id-46' name='argv' filepath='Modules/main.c' line='716' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='Py_BytesMain' mangled-name='Py_BytesMain' filepath='Modules/main.c' line='728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_BytesMain'>
      <parameter type-id='type-id-8' name='argc' filepath='Modules/main.c' line='728' column='1'/>
      <parameter type-id='type-id-259' name='argv' filepath='Modules/main.c' line='728' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/abstract.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-260' size-in-bits='32' id='type-id-261'>
      <subrange length='1' type-id='type-id-21' id='type-id-262'/>
    </array-type-def>
    <class-decl name='PyListObject' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-263' visibility='default' filepath='./Include/cpython/listobject.h' line='9' column='1' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-265' visibility='default' filepath='./Include/cpython/listobject.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_item' type-id='type-id-257' visibility='default' filepath='./Include/cpython/listobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='allocated' type-id='type-id-14' visibility='default' filepath='./Include/cpython/listobject.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyListObject' type-id='type-id-264' filepath='./Include/cpython/listobject.h' line='26' column='1' id='type-id-263'/>
    <typedef-decl name='digit' type-id='type-id-266' filepath='./Include/longintrepr.h' line='45' column='1' id='type-id-260'/>
    <class-decl name='_longobject' size-in-bits='256' is-struct='yes' visibility='default' filepath='./Include/longintrepr.h' line='85' column='1' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-265' visibility='default' filepath='./Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-261' visibility='default' filepath='./Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyLongObject' type-id='type-id-267' filepath='./Include/longobject.h' line='10' column='1' id='type-id-268'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-270'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' id='type-id-272'/>
    <qualified-type-def type-id='type-id-15' const='yes' id='type-id-273'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' id='type-id-128'/>
    <qualified-type-def type-id='type-id-274' const='yes' id='type-id-275'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' id='type-id-276'/>
    <qualified-type-def type-id='type-id-14' const='yes' id='type-id-277'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' id='type-id-278'/>
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-279'/>
    <function-decl name='PyObject_CallFunctionObjArgs' mangled-name='PyObject_CallFunctionObjArgs' filepath='./Include/abstract.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CallFunctionObjArgs'>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBytes_AsStringAndSize' mangled-name='PyBytes_AsStringAndSize' filepath='./Include/bytesobject.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBytes_AsStringAndSize'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-259'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_VectorcallMethod' mangled-name='PyObject_VectorcallMethod' filepath='./Include/cpython/abstract.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_VectorcallMethod'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyList_Extend' mangled-name='_PyList_Extend' filepath='./Include/cpython/listobject.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyList_Extend'>
      <parameter type-id='type-id-269'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_LookupSpecial' mangled-name='_PyObject_LookupSpecial' filepath='./Include/cpython/object.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_LookupSpecial'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-272'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_LookupAttrId' mangled-name='_PyObject_LookupAttrId' filepath='./Include/cpython/object.h' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_LookupAttrId'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-281'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyObject_NextNotImplemented' mangled-name='_PyObject_NextNotImplemented' filepath='./Include/cpython/object.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_NextNotImplemented'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyTuple_Resize' mangled-name='_PyTuple_Resize' filepath='./Include/cpython/tupleobject.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTuple_Resize'>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyUnicode_New' mangled-name='PyUnicode_New' filepath='./Include/cpython/unicodeobject.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_New'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-282'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyUnicode_FromId' mangled-name='_PyUnicode_FromId' filepath='./Include/cpython/unicodeobject.h' line='1227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyUnicode_FromId'>
      <parameter type-id='type-id-272'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyDict_Keys' mangled-name='PyDict_Keys' filepath='./Include/dictobject.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Keys'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyDict_Values' mangled-name='PyDict_Values' filepath='./Include/dictobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Values'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyDict_Items' mangled-name='PyDict_Items' filepath='./Include/dictobject.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyDict_Items'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyFloat_FromString' mangled-name='PyFloat_FromString' filepath='./Include/floatobject.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyFloat_FromString'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='Py_GenericAlias' mangled-name='Py_GenericAlias' filepath='./Include/genericaliasobject.h' line='8' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GenericAlias'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyImport_ImportModule' mangled-name='PyImport_ImportModule' filepath='./Include/import.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyImport_ImportModule'>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_CheckRecursiveCall' mangled-name='_Py_CheckRecursiveCall' filepath='./Include/internal/pycore_ceval.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_CheckRecursiveCall'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySeqIter_New' mangled-name='PySeqIter_New' filepath='./Include/iterobject.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySeqIter_New'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyList_AsTuple' mangled-name='PyList_AsTuple' filepath='./Include/listobject.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_AsTuple'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_Copy' mangled-name='_PyLong_Copy' filepath='./Include/longintrepr.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_Copy'>
      <parameter type-id='type-id-270'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyLong_FromSsize_t' mangled-name='PyLong_FromSsize_t' filepath='./Include/longobject.h' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyLong_FromSsize_t'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyLong_AsSsize_t' mangled-name='PyLong_AsSsize_t' filepath='./Include/longobject.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyLong_AsSsize_t'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyLong_AsDouble' mangled-name='PyLong_AsDouble' filepath='./Include/longobject.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyLong_AsDouble'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-283'/>
    </function-decl>
    <function-decl name='PyLong_FromUnicodeObject' mangled-name='PyLong_FromUnicodeObject' filepath='./Include/longobject.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyLong_FromUnicodeObject'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromBytes' mangled-name='_PyLong_FromBytes' filepath='./Include/longobject.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromBytes'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_Sign' mangled-name='_PyLong_Sign' filepath='./Include/longobject.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_Sign'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyLong_FromNbInt' mangled-name='_PyLong_FromNbInt' filepath='./Include/longobject.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromNbInt'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromNbIndexOrNbInt' mangled-name='_PyLong_FromNbIndexOrNbInt' filepath='./Include/longobject.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromNbIndexOrNbInt'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_Format' mangled-name='_PyLong_Format' filepath='./Include/longobject.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_Format'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyType_IsSubtype' mangled-name='PyType_IsSubtype' filepath='./Include/object.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_IsSubtype'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_RichCompareBool' mangled-name='PyObject_RichCompareBool' filepath='./Include/object.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_RichCompareBool'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_IsTrue' mangled-name='PyObject_IsTrue' filepath='./Include/object.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsTrue'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyErr_GivenExceptionMatches' mangled-name='PyErr_GivenExceptionMatches' filepath='./Include/pyerrors.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_GivenExceptionMatches'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PySlice_FromIndices' mangled-name='_PySlice_FromIndices' filepath='./Include/sliceobject.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySlice_FromIndices'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyTuple_New' mangled-name='PyTuple_New' filepath='./Include/tupleobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyTuple_New'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyErr_WarnFormat' mangled-name='PyErr_WarnFormat' filepath='./Include/warnings.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnFormat'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-12'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='35' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='70' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='Objects/abstract.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='77' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='89' column='1'/>
      <parameter type-id='type-id-14' name='defaultvalue' filepath='Objects/abstract.c' line='89' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='146' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='Objects/abstract.c' line='146' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='200' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='Objects/abstract.c' line='200' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='Objects/abstract.c' line='200' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='232' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='Objects/abstract.c' line='232' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='264' column='1'/>
      <parameter type-id='type-id-12' name='key' filepath='Objects/abstract.c' line='264' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CheckBuffer' mangled-name='PyObject_CheckBuffer' filepath='Objects/abstract.c' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='284' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='295' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='330' column='1'/>
      <parameter type-id='type-id-285' name='buffer' filepath='Objects/abstract.c' line='331' column='1'/>
      <parameter type-id='type-id-13' name='buffer_len' filepath='Objects/abstract.c' line='332' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='Objects/abstract.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='337' column='1'/>
      <parameter type-id='type-id-279' name='buffer' filepath='Objects/abstract.c' line='338' column='1'/>
      <parameter type-id='type-id-13' name='buffer_len' filepath='Objects/abstract.c' line='339' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='344' column='1'/>
      <parameter type-id='type-id-279' name='buffer' filepath='Objects/abstract.c' line='345' column='1'/>
      <parameter type-id='type-id-13' name='buffer_len' filepath='Objects/abstract.c' line='346' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='373' column='1'/>
      <parameter type-id='type-id-286' name='view' filepath='Objects/abstract.c' line='373' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Objects/abstract.c' line='373' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous'>
      <parameter type-id='type-id-276' name='view' filepath='Objects/abstract.c' line='454' column='1'/>
      <parameter type-id='type-id-42' name='order' filepath='Objects/abstract.c' line='454' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer'>
      <parameter type-id='type-id-286' name='view' filepath='Objects/abstract.c' line='470' column='1'/>
      <parameter type-id='type-id-13' name='indices' filepath='Objects/abstract.c' line='470' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='Objects/abstract.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='486' column='1'/>
      <parameter type-id='type-id-13' name='index' filepath='Objects/abstract.c' line='486' column='1'/>
      <parameter type-id='type-id-278' name='shape' filepath='Objects/abstract.c' line='486' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='Objects/abstract.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='502' column='1'/>
      <parameter type-id='type-id-13' name='index' filepath='Objects/abstract.c' line='502' column='1'/>
      <parameter type-id='type-id-278' name='shape' filepath='Objects/abstract.c' line='502' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyBuffer_SizeFromFormat' mangled-name='PyBuffer_SizeFromFormat' filepath='Objects/abstract.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_SizeFromFormat'>
      <parameter type-id='type-id-12' name='format' filepath='Objects/abstract.c' line='518' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous'>
      <parameter type-id='type-id-286' name='view' filepath='Objects/abstract.c' line='560' column='1'/>
      <parameter type-id='type-id-31' name='buf' filepath='Objects/abstract.c' line='560' column='1'/>
      <parameter type-id='type-id-14' name='len' filepath='Objects/abstract.c' line='560' column='1'/>
      <parameter type-id='type-id-42' name='fort' filepath='Objects/abstract.c' line='560' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData'>
      <parameter type-id='type-id-1' name='dest' filepath='Objects/abstract.c' line='611' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='Objects/abstract.c' line='611' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='682' column='1'/>
      <parameter type-id='type-id-13' name='shape' filepath='Objects/abstract.c' line='682' column='1'/>
      <parameter type-id='type-id-13' name='strides' filepath='Objects/abstract.c' line='683' column='1'/>
      <parameter type-id='type-id-8' name='itemsize' filepath='Objects/abstract.c' line='683' column='1'/>
      <parameter type-id='type-id-42' name='fort' filepath='Objects/abstract.c' line='684' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo'>
      <parameter type-id='type-id-286' name='view' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-31' name='buf' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-14' name='len' filepath='Objects/abstract.c' line='706' column='1'/>
      <parameter type-id='type-id-8' name='readonly' filepath='Objects/abstract.c' line='707' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Objects/abstract.c' line='707' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release'>
      <parameter type-id='type-id-286' name='view' filepath='Objects/abstract.c' line='745' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='759' column='1'/>
      <parameter type-id='type-id-1' name='format_spec' filepath='Objects/abstract.c' line='759' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='820' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='1007' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1007' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1007' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='1008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1008' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1008' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1009' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1009' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='1010' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1010' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1010' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1011' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1011' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1012' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1012' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='1013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1013' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1013' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='1016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1016' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1016' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='1047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1047' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1047' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='1066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1066' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1066' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='1072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1072' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1072' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='1078' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1078' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1078' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1084' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1084' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1090' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1090' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='Objects/abstract.c' line='1090' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1146' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1146' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1147' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1147' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1148' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1148' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceLshift' mangled-name='PyNumber_InPlaceLshift' filepath='Objects/abstract.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceLshift'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1149' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1149' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRshift' mangled-name='PyNumber_InPlaceRshift' filepath='Objects/abstract.c' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRshift'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1150' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1150' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceSubtract' mangled-name='PyNumber_InPlaceSubtract' filepath='Objects/abstract.c' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceSubtract'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1151' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1151' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceFloorDivide' mangled-name='PyNumber_InPlaceFloorDivide' filepath='Objects/abstract.c' line='1155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceFloorDivide'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1155' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1155' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceTrueDivide' mangled-name='PyNumber_InPlaceTrueDivide' filepath='Objects/abstract.c' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceTrueDivide'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1162' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1162' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAdd' mangled-name='PyNumber_InPlaceAdd' filepath='Objects/abstract.c' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAdd'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1169' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1169' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMultiply' mangled-name='PyNumber_InPlaceMultiply' filepath='Objects/abstract.c' line='1190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1190' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1190' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceMatrixMultiply' mangled-name='PyNumber_InPlaceMatrixMultiply' filepath='Objects/abstract.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceMatrixMultiply'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1219' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1219' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceRemainder' mangled-name='PyNumber_InPlaceRemainder' filepath='Objects/abstract.c' line='1226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceRemainder'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1226' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1226' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_InPlacePower' mangled-name='PyNumber_InPlacePower' filepath='Objects/abstract.c' line='1233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlacePower'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='1233' column='1'/>
      <parameter type-id='type-id-1' name='z' filepath='Objects/abstract.c' line='1233' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Negative' mangled-name='PyNumber_Negative' filepath='Objects/abstract.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Negative'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1248' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Positive' mangled-name='PyNumber_Positive' filepath='Objects/abstract.c' line='1264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Positive'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1264' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Invert' mangled-name='PyNumber_Invert' filepath='Objects/abstract.c' line='1280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Invert'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1280' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Absolute' mangled-name='PyNumber_Absolute' filepath='Objects/abstract.c' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Absolute'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1296' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyIndex_Check' mangled-name='PyIndex_Check' filepath='Objects/abstract.c' line='1313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIndex_Check'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='1313' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNumber_Index' mangled-name='PyNumber_Index' filepath='Objects/abstract.c' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Index'>
      <parameter type-id='type-id-1' name='item' filepath='Objects/abstract.c' line='1324' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_AsSsize_t' mangled-name='PyNumber_AsSsize_t' filepath='Objects/abstract.c' line='1366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsSsize_t'>
      <parameter type-id='type-id-1' name='item' filepath='Objects/abstract.c' line='1366' column='1'/>
      <parameter type-id='type-id-1' name='err' filepath='Objects/abstract.c' line='1366' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyNumber_Long' mangled-name='PyNumber_Long' filepath='Objects/abstract.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Long'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1411' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_Float' mangled-name='PyNumber_Float' filepath='Objects/abstract.c' line='1510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Float'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1510' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyNumber_ToBase' mangled-name='PyNumber_ToBase' filepath='Objects/abstract.c' line='1569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_ToBase'>
      <parameter type-id='type-id-1' name='n' filepath='Objects/abstract.c' line='1569' column='1'/>
      <parameter type-id='type-id-8' name='base' filepath='Objects/abstract.c' line='1569' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Check' mangled-name='PySequence_Check' filepath='Objects/abstract.c' line='1588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Check'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1588' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_Size' mangled-name='PySequence_Size' filepath='Objects/abstract.c' line='1597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Size'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1597' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PySequence_Length' mangled-name='PySequence_Length' filepath='Objects/abstract.c' line='1623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Length'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1623' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PySequence_Concat' mangled-name='PySequence_Concat' filepath='Objects/abstract.c' line='1630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Concat'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1630' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1630' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Repeat' mangled-name='PySequence_Repeat' filepath='Objects/abstract.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Repeat'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1655' column='1'/>
      <parameter type-id='type-id-14' name='count' filepath='Objects/abstract.c' line='1655' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceConcat' mangled-name='PySequence_InPlaceConcat' filepath='Objects/abstract.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceConcat'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1685' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1685' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_InPlaceRepeat' mangled-name='PySequence_InPlaceRepeat' filepath='Objects/abstract.c' line='1710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_InPlaceRepeat'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1710' column='1'/>
      <parameter type-id='type-id-14' name='count' filepath='Objects/abstract.c' line='1710' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_GetItem' mangled-name='PySequence_GetItem' filepath='Objects/abstract.c' line='1740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetItem'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1740' column='1'/>
      <parameter type-id='type-id-14' name='i' filepath='Objects/abstract.c' line='1740' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_GetSlice' mangled-name='PySequence_GetSlice' filepath='Objects/abstract.c' line='1770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_GetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1770' column='1'/>
      <parameter type-id='type-id-14' name='i1' filepath='Objects/abstract.c' line='1770' column='1'/>
      <parameter type-id='type-id-14' name='i2' filepath='Objects/abstract.c' line='1770' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_SetItem' mangled-name='PySequence_SetItem' filepath='Objects/abstract.c' line='1793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetItem'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1793' column='1'/>
      <parameter type-id='type-id-14' name='i' filepath='Objects/abstract.c' line='1793' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1793' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_DelItem' mangled-name='PySequence_DelItem' filepath='Objects/abstract.c' line='1826' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelItem'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1826' column='1'/>
      <parameter type-id='type-id-14' name='i' filepath='Objects/abstract.c' line='1826' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_SetSlice' mangled-name='PySequence_SetSlice' filepath='Objects/abstract.c' line='1859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_SetSlice'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-14' name='i1' filepath='Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-14' name='i2' filepath='Objects/abstract.c' line='1859' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='1859' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_DelSlice' mangled-name='PySequence_DelSlice' filepath='Objects/abstract.c' line='1884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_DelSlice'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-14' name='i1' filepath='Objects/abstract.c' line='1884' column='1'/>
      <parameter type-id='type-id-14' name='i2' filepath='Objects/abstract.c' line='1884' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_Tuple' mangled-name='PySequence_Tuple' filepath='Objects/abstract.c' line='1908' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Tuple'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1908' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_List' mangled-name='PySequence_List' filepath='Objects/abstract.c' line='1992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_List'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='1992' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySequence_Fast' mangled-name='PySequence_Fast' filepath='Objects/abstract.c' line='2015' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Fast'>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='2015' column='1'/>
      <parameter type-id='type-id-12' name='m' filepath='Objects/abstract.c' line='2015' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PySequence_IterSearch' mangled-name='_PySequence_IterSearch' filepath='Objects/abstract.c' line='2048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_IterSearch'>
      <parameter type-id='type-id-1' name='seq' filepath='Objects/abstract.c' line='2048' column='1'/>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='2048' column='1'/>
      <parameter type-id='type-id-8' name='operation' filepath='Objects/abstract.c' line='2048' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PySequence_Count' mangled-name='PySequence_Count' filepath='Objects/abstract.c' line='2133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Count'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='2133' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2133' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PySequence_Contains' mangled-name='PySequence_Contains' filepath='Objects/abstract.c' line='2142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Contains'>
      <parameter type-id='type-id-1' name='seq' filepath='Objects/abstract.c' line='2142' column='1'/>
      <parameter type-id='type-id-1' name='ob' filepath='Objects/abstract.c' line='2142' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_In' mangled-name='PySequence_In' filepath='Objects/abstract.c' line='2155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_In'>
      <parameter type-id='type-id-1' name='w' filepath='Objects/abstract.c' line='2155' column='1'/>
      <parameter type-id='type-id-1' name='v' filepath='Objects/abstract.c' line='2155' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySequence_Index' mangled-name='PySequence_Index' filepath='Objects/abstract.c' line='2161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySequence_Index'>
      <parameter type-id='type-id-1' name='s' filepath='Objects/abstract.c' line='2161' column='1'/>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2161' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyMapping_Check' mangled-name='PyMapping_Check' filepath='Objects/abstract.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Check'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2169' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_Size' mangled-name='PyMapping_Size' filepath='Objects/abstract.c' line='2176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Size'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2176' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyMapping_Length' mangled-name='PyMapping_Length' filepath='Objects/abstract.c' line='2203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Length'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2203' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyMapping_GetItemString' mangled-name='PyMapping_GetItemString' filepath='Objects/abstract.c' line='2210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_GetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2210' column='1'/>
      <parameter type-id='type-id-12' name='key' filepath='Objects/abstract.c' line='2210' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_SetItemString' mangled-name='PyMapping_SetItemString' filepath='Objects/abstract.c' line='2227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_SetItemString'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2227' column='1'/>
      <parameter type-id='type-id-12' name='key' filepath='Objects/abstract.c' line='2227' column='1'/>
      <parameter type-id='type-id-1' name='value' filepath='Objects/abstract.c' line='2227' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_HasKeyString' mangled-name='PyMapping_HasKeyString' filepath='Objects/abstract.c' line='2246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKeyString'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2246' column='1'/>
      <parameter type-id='type-id-12' name='key' filepath='Objects/abstract.c' line='2246' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_HasKey' mangled-name='PyMapping_HasKey' filepath='Objects/abstract.c' line='2260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_HasKey'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2260' column='1'/>
      <parameter type-id='type-id-1' name='key' filepath='Objects/abstract.c' line='2260' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyMapping_Keys' mangled-name='PyMapping_Keys' filepath='Objects/abstract.c' line='2305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Keys'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2305' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Items' mangled-name='PyMapping_Items' filepath='Objects/abstract.c' line='2319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Items'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2319' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyMapping_Values' mangled-name='PyMapping_Values' filepath='Objects/abstract.c' line='2333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyMapping_Values'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2333' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_IsInstance' mangled-name='PyObject_IsInstance' filepath='Objects/abstract.c' line='2554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='Objects/abstract.c' line='2554' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='Objects/abstract.c' line='2554' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_IsSubclass' mangled-name='PyObject_IsSubclass' filepath='Objects/abstract.c' line='2637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_IsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='Objects/abstract.c' line='2637' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='Objects/abstract.c' line='2637' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsInstance' mangled-name='_PyObject_RealIsInstance' filepath='Objects/abstract.c' line='2645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsInstance'>
      <parameter type-id='type-id-1' name='inst' filepath='Objects/abstract.c' line='2645' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='Objects/abstract.c' line='2645' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyObject_RealIsSubclass' mangled-name='_PyObject_RealIsSubclass' filepath='Objects/abstract.c' line='2651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_RealIsSubclass'>
      <parameter type-id='type-id-1' name='derived' filepath='Objects/abstract.c' line='2651' column='1'/>
      <parameter type-id='type-id-1' name='cls' filepath='Objects/abstract.c' line='2651' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_GetIter' mangled-name='PyObject_GetIter' filepath='Objects/abstract.c' line='2658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetIter'>
      <parameter type-id='type-id-1' name='o' filepath='Objects/abstract.c' line='2658' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyIter_Check' mangled-name='PyIter_Check' filepath='Objects/abstract.c' line='2685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Check'>
      <parameter type-id='type-id-1' name='obj' filepath='Objects/abstract.c' line='2685' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyIter_Next' mangled-name='PyIter_Next' filepath='Objects/abstract.c' line='2699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyIter_Next'>
      <parameter type-id='type-id-1' name='iter' filepath='Objects/abstract.c' line='2699' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PySequence_BytesToCharpArray' mangled-name='_PySequence_BytesToCharpArray' filepath='Objects/abstract.c' line='2720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySequence_BytesToCharpArray'>
      <parameter type-id='type-id-1' name='self' filepath='Objects/abstract.c' line='2720' column='1'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='_Py_FreeCharPArray' mangled-name='_Py_FreeCharPArray' filepath='Objects/abstract.c' line='2779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_FreeCharPArray'>
      <parameter type-id='type-id-128' name='array' filepath='Objects/abstract.c' line='2779' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/accu.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <class-decl name='_PyAccu' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-287' visibility='default' filepath='./Include/internal/pycore_accu.h' line='24' column='1' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='large' type-id='type-id-1' visibility='default' filepath='./Include/internal/pycore_accu.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small' type-id='type-id-1' visibility='default' filepath='./Include/internal/pycore_accu.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_PyAccu' type-id='type-id-288' filepath='./Include/internal/pycore_accu.h' line='27' column='1' id='type-id-287'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-289'/>
    <function-decl name='PyList_Append' mangled-name='PyList_Append' filepath='./Include/listobject.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_Append'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyList_SetSlice' mangled-name='PyList_SetSlice' filepath='./Include/listobject.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_SetSlice'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyUnicode_Join' mangled-name='PyUnicode_Join' filepath='./Include/unicodeobject.h' line='902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_Join'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyAccu_Init' mangled-name='_PyAccu_Init' filepath='Objects/accu.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Init'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='18' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyAccu_Accumulate' mangled-name='_PyAccu_Accumulate' filepath='Objects/accu.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Accumulate'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='55' column='1'/>
      <parameter type-id='type-id-1' name='unicode' filepath='Objects/accu.c' line='55' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyAccu_FinishAsList' mangled-name='_PyAccu_FinishAsList' filepath='Objects/accu.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_FinishAsList'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='76' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyAccu_Finish' mangled-name='_PyAccu_Finish' filepath='Objects/accu.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Finish'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='93' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyAccu_Destroy' mangled-name='_PyAccu_Destroy' filepath='Objects/accu.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyAccu_Destroy'>
      <parameter type-id='type-id-289' name='acc' filepath='Objects/accu.c' line='111' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/boolobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <var-decl name='PyBool_Type' type-id='type-id-7' mangled-name='PyBool_Type' visibility='default' filepath='./Include/boolobject.h' line='10' column='1' elf-symbol-id='PyBool_Type'/>
    <var-decl name='_Py_FalseStruct' type-id='type-id-267' mangled-name='_Py_FalseStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_FalseStruct'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-267' mangled-name='_Py_TrueStruct' visibility='default' filepath='./Include/boolobject.h' line='18' column='1' elf-symbol-id='_Py_TrueStruct'/>
    <function-decl name='PyArg_UnpackTuple' mangled-name='PyArg_UnpackTuple' filepath='./Include/modsupport.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyArg_UnpackTuple'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyArg_NoKeywords' mangled-name='_PyArg_NoKeywords' filepath='./Include/modsupport.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_NoKeywords'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBool_FromLong' mangled-name='PyBool_FromLong' filepath='Objects/boolobject.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBool_FromLong'>
      <parameter type-id='type-id-109' name='ok' filepath='Objects/boolobject.c' line='28' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/bytearrayobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='infinite' id='type-id-290'>
      <subrange length='infinite' id='type-id-225'/>
    </array-type-def>
    <class-decl name='PyWideStringList' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-235' visibility='default' filepath='./Include/cpython/initconfig.h' line='31' column='1' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='type-id-14' visibility='default' filepath='./Include/cpython/initconfig.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='items' type-id='type-id-46' visibility='default' filepath='./Include/cpython/initconfig.h' line='35' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyWideStringList' type-id='type-id-291' filepath='./Include/cpython/initconfig.h' line='36' column='1' id='type-id-235'/>
    <class-decl name='PyConfig' size-in-bits='3136' is-struct='yes' naming-typedef-id='type-id-292' visibility='default' filepath='./Include/cpython/initconfig.h' line='133' column='1' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_config_init' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='isolated' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='use_environment' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dev_mode' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='install_signal_handlers' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_hash_seed' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hash_seed' type-id='type-id-21' visibility='default' filepath='./Include/cpython/initconfig.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='faulthandler' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='_use_peg_parser' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tracemalloc' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='import_time' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='show_ref_count' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='dump_refs' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='malloc_stats' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='filesystem_encoding' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='filesystem_errors' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pycache_prefix' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='parse_argv' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='argv' type-id='type-id-235' visibility='default' filepath='./Include/cpython/initconfig.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='program_name' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='xoptions' type-id='type-id-235' visibility='default' filepath='./Include/cpython/initconfig.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='warnoptions' type-id='type-id-235' visibility='default' filepath='./Include/cpython/initconfig.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='site_import' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='bytes_warning' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='inspect' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='interactive' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='optimization_level' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='parser_debug' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='write_bytecode' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='verbose' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='quiet' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='user_site_directory' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='configure_c_stdio' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='buffered_stdio' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='stdio_encoding' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='stdio_errors' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='check_hash_pycs_mode' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='pathconfig_warnings' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='pythonpath_env' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='home' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='module_search_paths_set' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='module_search_paths' type-id='type-id-235' visibility='default' filepath='./Include/cpython/initconfig.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='executable' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='base_executable' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='prefix' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='base_prefix' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='exec_prefix' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='base_exec_prefix' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='platlibdir' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='skip_source_first_line' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='run_command' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='run_module' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='run_filename' type-id='type-id-48' visibility='default' filepath='./Include/cpython/initconfig.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='_install_importlib' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2912'>
        <var-decl name='_init_main' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='_isolated_interpreter' type-id='type-id-8' visibility='default' filepath='./Include/cpython/initconfig.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='_orig_argv' type-id='type-id-235' visibility='default' filepath='./Include/cpython/initconfig.h' line='424' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='PyConfig' type-id='type-id-293' filepath='./Include/cpython/initconfig.h' line='425' column='1' id='type-id-292'/>
    <class-decl name='_PyArg_Parser' size-in-bits='512' is-struct='yes' visibility='default' filepath='./Include/modsupport.h' line='92' column='1' id='type-id-294'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='type-id-12' visibility='default' filepath='./Include/modsupport.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='keywords' type-id='type-id-295' visibility='default' filepath='./Include/modsupport.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fname' type-id='type-id-12' visibility='default' filepath='./Include/modsupport.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='custom_msg' type-id='type-id-12' visibility='default' filepath='./Include/modsupport.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pos' type-id='type-id-8' visibility='default' filepath='./Include/modsupport.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='min' type-id='type-id-8' visibility='default' filepath='./Include/modsupport.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='max' type-id='type-id-8' visibility='default' filepath='./Include/modsupport.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kwtuple' type-id='type-id-1' visibility='default' filepath='./Include/modsupport.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next' type-id='type-id-296' visibility='default' filepath='./Include/modsupport.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='wchar_t' type-id='type-id-8' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='321' column='1' id='type-id-256'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-296'/>
    <qualified-type-def type-id='type-id-292' const='yes' id='type-id-297'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-253'/>
    <qualified-type-def type-id='type-id-298' const='yes' id='type-id-299'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-300'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-295'/>
    <qualified-type-def type-id='type-id-8' const='yes' id='type-id-302'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-46'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-7' mangled-name='PyByteArray_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='22' column='1' elf-symbol-id='PyByteArray_Type'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-7' mangled-name='PyByteArrayIter_Type' visibility='default' filepath='./Include/bytearrayobject.h' line='23' column='1' elf-symbol-id='PyByteArrayIter_Type'/>
    <function-decl name='PyBuffer_ToContiguous' mangled-name='PyBuffer_ToContiguous' filepath='./Include/cpython/abstract.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_ToContiguous'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-290' mangled-name='_PyByteArray_empty_string' visibility='default' filepath='./Include/cpython/bytearrayobject.h' line='20' column='1' elf-symbol-id='_PyByteArray_empty_string'/>
    <function-decl name='_PyBytes_FormatEx' mangled-name='_PyBytes_FormatEx' filepath='./Include/cpython/bytesobject.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FormatEx'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyBytes_FromHex' mangled-name='_PyBytes_FromHex' filepath='./Include/cpython/bytesobject.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyBytes_FromHex'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyEval_GetBuiltinId' mangled-name='_PyEval_GetBuiltinId' filepath='./Include/cpython/ceval.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyEval_GetBuiltinId'>
      <parameter type-id='type-id-272'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_GetConfig' mangled-name='_Py_GetConfig' filepath='./Include/cpython/pystate.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_GetConfig'>
      <return type-id='type-id-253'/>
    </function-decl>
    <function-decl name='_Py_bytes_isspace' filepath='./Include/internal/pycore_bytes_methods.h' line='13' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalpha' filepath='./Include/internal/pycore_bytes_methods.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isalnum' filepath='./Include/internal/pycore_bytes_methods.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isascii' filepath='./Include/internal/pycore_bytes_methods.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isdigit' filepath='./Include/internal/pycore_bytes_methods.h' line='17' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_islower' filepath='./Include/internal/pycore_bytes_methods.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_isupper' filepath='./Include/internal/pycore_bytes_methods.h' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_istitle' filepath='./Include/internal/pycore_bytes_methods.h' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_lower' filepath='./Include/internal/pycore_bytes_methods.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_bytes_upper' filepath='./Include/internal/pycore_bytes_methods.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_bytes_title' filepath='./Include/internal/pycore_bytes_methods.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_bytes_capitalize' filepath='./Include/internal/pycore_bytes_methods.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_bytes_swapcase' filepath='./Include/internal/pycore_bytes_methods.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_bytes_find' filepath='./Include/internal/pycore_bytes_methods.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_index' filepath='./Include/internal/pycore_bytes_methods.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_rfind' filepath='./Include/internal/pycore_bytes_methods.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_rindex' filepath='./Include/internal/pycore_bytes_methods.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_count' filepath='./Include/internal/pycore_bytes_methods.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_contains' filepath='./Include/internal/pycore_bytes_methods.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_bytes_startswith' filepath='./Include/internal/pycore_bytes_methods.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_endswith' filepath='./Include/internal/pycore_bytes_methods.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_bytes_maketrans' filepath='./Include/internal/pycore_bytes_methods.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-286'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyList_Reverse' mangled-name='PyList_Reverse' filepath='./Include/listobject.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyList_Reverse'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyLong_AsLong' mangled-name='PyLong_AsLong' filepath='./Include/longobject.h' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyLong_AsLong'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='_PyLong_AsInt' mangled-name='_PyLong_AsInt' filepath='./Include/longobject.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_AsInt'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyArg_ParseTupleAndKeywords_SizeT' mangled-name='_PyArg_ParseTupleAndKeywords_SizeT' filepath='./Include/modsupport.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_ParseTupleAndKeywords_SizeT'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-259'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyArg_BadArgument' mangled-name='_PyArg_BadArgument' filepath='./Include/modsupport.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_BadArgument'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_PyArg_CheckPositional' mangled-name='_PyArg_CheckPositional' filepath='./Include/modsupport.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_CheckPositional'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyArg_UnpackKeywords' mangled-name='_PyArg_UnpackKeywords' filepath='./Include/modsupport.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_UnpackKeywords'>
      <parameter type-id='type-id-280'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-257'/>
      <return type-id='type-id-280'/>
    </function-decl>
    <function-decl name='PyType_GenericAlloc' mangled-name='PyType_GenericAlloc' filepath='./Include/object.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GenericAlloc'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyType_GenericNew' mangled-name='PyType_GenericNew' filepath='./Include/object.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyType_GenericNew'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_SelfIter' mangled-name='PyObject_SelfIter' filepath='./Include/object.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SelfIter'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GenericGetAttr' mangled-name='PyObject_GenericGetAttr' filepath='./Include/object.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GenericGetAttr'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_New' mangled-name='_PyObject_New' filepath='./Include/objimpl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_New'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='./Include/objimpl.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New'>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='./Include/objimpl.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='_Py_strhex_with_sep' mangled-name='_Py_strhex_with_sep' filepath='./Include/pystrhex.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_strhex_with_sep'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-277'/>
      <parameter type-id='type-id-300'/>
      <parameter type-id='type-id-302'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyErr_Print' mangled-name='PyErr_Print' filepath='./Include/pythonrun.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_Print'>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='PySlice_Unpack' mangled-name='PySlice_Unpack' filepath='./Include/sliceobject.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySlice_Unpack'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySlice_AdjustIndices' mangled-name='PySlice_AdjustIndices' filepath='./Include/sliceobject.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySlice_AdjustIndices'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyUnicode_FromEncodedObject' mangled-name='PyUnicode_FromEncodedObject' filepath='./Include/unicodeobject.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_FromEncodedObject'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyUnicode_GetDefaultEncoding' mangled-name='PyUnicode_GetDefaultEncoding' filepath='./Include/unicodeobject.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_GetDefaultEncoding'>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='PyUnicode_AsEncodedString' mangled-name='PyUnicode_AsEncodedString' filepath='./Include/unicodeobject.h' line='409' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_AsEncodedString'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyUnicode_DecodeLatin1' mangled-name='PyUnicode_DecodeLatin1' filepath='./Include/unicodeobject.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyUnicode_DecodeLatin1'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyErr_WarnEx' mangled-name='PyErr_WarnEx' filepath='./Include/warnings.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_WarnEx'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='PyByteArray_FromObject' mangled-name='PyByteArray_FromObject' filepath='Objects/bytearrayobject.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_FromObject'>
      <parameter type-id='type-id-1' name='input' filepath='Objects/bytearrayobject.c' line='88' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyByteArray_Size' mangled-name='PyByteArray_Size' filepath='Objects/bytearrayobject.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Size'>
      <parameter type-id='type-id-1' name='self' filepath='Objects/bytearrayobject.c' line='158' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='PyByteArray_Resize' mangled-name='PyByteArray_Resize' filepath='Objects/bytearrayobject.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Resize'>
      <parameter type-id='type-id-1' name='self' filepath='Objects/bytearrayobject.c' line='176' column='1'/>
      <parameter type-id='type-id-14' name='requested_size' filepath='Objects/bytearrayobject.c' line='176' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyByteArray_Concat' mangled-name='PyByteArray_Concat' filepath='Objects/bytearrayobject.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyByteArray_Concat'>
      <parameter type-id='type-id-1' name='a' filepath='Objects/bytearrayobject.c' line='255' column='1'/>
      <parameter type-id='type-id-1' name='b' filepath='Objects/bytearrayobject.c' line='255' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/bytes_methods.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='984' id='type-id-303'>
      <subrange length='123' type-id='type-id-21' id='type-id-304'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='992' id='type-id-305'>
      <subrange length='124' type-id='type-id-21' id='type-id-306'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1008' id='type-id-307'>
      <subrange length='126' type-id='type-id-21' id='type-id-308'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1040' id='type-id-309'>
      <subrange length='130' type-id='type-id-21' id='type-id-310'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1056' id='type-id-311'>
      <subrange length='132' type-id='type-id-21' id='type-id-312'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1128' id='type-id-313'>
      <subrange length='141' type-id='type-id-21' id='type-id-314'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1240' id='type-id-315'>
      <subrange length='155' type-id='type-id-21' id='type-id-316'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1592' id='type-id-317'>
      <subrange length='199' type-id='type-id-21' id='type-id-318'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1840' id='type-id-319'>
      <subrange length='230' type-id='type-id-21' id='type-id-320'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1912' id='type-id-321'>
      <subrange length='239' type-id='type-id-21' id='type-id-322'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='1928' id='type-id-323'>
      <subrange length='241' type-id='type-id-21' id='type-id-324'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='2112' id='type-id-325'>
      <subrange length='264' type-id='type-id-21' id='type-id-326'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='2144' id='type-id-327'>
      <subrange length='268' type-id='type-id-21' id='type-id-328'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='2160' id='type-id-329'>
      <subrange length='270' type-id='type-id-21' id='type-id-330'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='2168' id='type-id-331'>
      <subrange length='271' type-id='type-id-21' id='type-id-332'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='2328' id='type-id-333'>
      <subrange length='291' type-id='type-id-21' id='type-id-334'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='744' id='type-id-335'>
      <subrange length='93' type-id='type-id-21' id='type-id-336'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='784' id='type-id-337'>
      <subrange length='98' type-id='type-id-21' id='type-id-338'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='infinite' id='type-id-339'>
      <subrange length='infinite' id='type-id-225'/>
    </array-type-def>
    <function-decl name='_PyEval_SliceIndex' mangled-name='_PyEval_SliceIndex' filepath='./Include/cpython/ceval.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyEval_SliceIndex'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <var-decl name='_Py_isspace__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='42' column='1'/>
    <var-decl name='_Py_isalpha__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='43' column='1'/>
    <var-decl name='_Py_isalnum__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='44' column='1'/>
    <var-decl name='_Py_isascii__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='45' column='1'/>
    <var-decl name='_Py_isdigit__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='46' column='1'/>
    <var-decl name='_Py_islower__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='47' column='1'/>
    <var-decl name='_Py_isupper__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='48' column='1'/>
    <var-decl name='_Py_istitle__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='49' column='1'/>
    <var-decl name='_Py_lower__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='50' column='1'/>
    <var-decl name='_Py_upper__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='51' column='1'/>
    <var-decl name='_Py_title__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='52' column='1'/>
    <var-decl name='_Py_capitalize__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='53' column='1'/>
    <var-decl name='_Py_swapcase__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='54' column='1'/>
    <var-decl name='_Py_count__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='55' column='1'/>
    <var-decl name='_Py_find__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='56' column='1'/>
    <var-decl name='_Py_index__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='57' column='1'/>
    <var-decl name='_Py_rfind__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='58' column='1'/>
    <var-decl name='_Py_rindex__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='59' column='1'/>
    <var-decl name='_Py_startswith__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='60' column='1'/>
    <var-decl name='_Py_endswith__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='61' column='1'/>
    <var-decl name='_Py_maketrans__doc__' type-id='type-id-339' visibility='default' filepath='./Include/internal/pycore_bytes_methods.h' line='62' column='1'/>
    <function-decl name='_PyArg_ParseTuple_SizeT' mangled-name='_PyArg_ParseTuple_SizeT' filepath='./Include/modsupport.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyArg_ParseTuple_SizeT'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-12'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='memchr' filepath='/usr/include/string.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='memrchr' filepath='/usr/include/string.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-31'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/bytesobject.c' comp-dir-path='/home/runner/work/cpython/cpython' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='4096' id='type-id-340'>
      <subrange length='512' type-id='type-id-21' id='type-id-341'/>
    </array-type-def>
    <class-decl name='_PyBytesWriter' size-in-bits='4416' is-struct='yes' naming-typedef-id='type-id-342' visibility='default' filepath='./Include/cpython/bytesobject.h' line='44' column='1' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-1' visibility='default' filepath='./Include/cpython/bytesobject.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-14' visibility='default' filepath='./Include/cpython/bytesobject.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
